//=================================================================================================
// Получение сообщений из очередей обмена сообщениями
//=================================================================================================

Процедура ШинаДанныхОбработкаСообщений() Экспорт





КонецПроцедуры 

Процедура АгрегаторОбработкаСообщений() Экспорт
	
	// Процедура опрашивает очередь сообщений, которая отвечает за документооборот с Агрегатором ОИТ
	// В зависимости от полученного сообщения вызывает связанную процедуру обработки этого сообщения
	//-------------------------------------------------------------------------------------------------
	СтрОчередь = "MatrixAgregator";
	СтрМетка = "Регистрация пропущенный звонок";
	МассивСообщений = Взаимодействие.ОчередьСообщенияПолучить(СтрОчередь,СтрМетка);
	
	Для Каждого ТекСтрока Из МассивСообщений Цикл
		Справочники.Звонки.ЗаявкаНоваяСоздать(ТекСтрока.Сообщение);
	КонецЦикла;
КонецПроцедуры

Процедура JivositeОбработкаСообщений() Экспорт	
	//Процедура получает сообщения из очереди "MatrixJivosite" и меткой "Регистрация чата"
	// и записывает их в справочник JivositeОбсуждения     
	
	МассивСообщений = Взаимодействие.ОчередьСообщенияПолучить("MatrixJivosite", "Регистрация чата");
	Для Каждого i Из МассивСообщений Цикл
		JivositeОбработкаСообщения(i.Сообщение);		
	КонецЦикла;
КонецПроцедуры  

Процедура JivositeОбработкаСообщения(Сообщение) Экспорт
	
		//Найди сотрудника по email
		Чт = Новый ЧтениеXML();
		Чт.УстановитьСтроку(Сообщение);
		ТекСтрока = ФабрикаXDTO.ПрочитатьXML(Чт);
		Если Не ЗначениеЗаполнено(ТекСтрока.ЭлПочтаОператора) Тогда
			ЗаписьЖурналаРегистрации("JivositeОбработкаСообщения", УровеньЖурналаРегистрации.Ошибка,, Сообщение, "Не указан email сотрудника");
			Возврат;
		КонецЕсли;  
		
		sql = "ВЫБРАТЬ ПЕРВЫЕ 1 Ссылка ИЗ Справочник.Сотрудники ГДЕ ЭлектроннаяПочта ПОДОБНО &ЭлектроннаяПочта";
		Сотр = ОбщНазн.ЗапросВыполнитьНаЗначение(sql, Новый Структура("ЭлектроннаяПочта", "%"+ТекСтрока.ЭлПочтаОператора+"%"));
		
		Если Сотр = Неопределено Тогда
			sql 	= "ВЫБРАТЬ ПЕРВЫЕ 1 Сотрудник ИЗ РегистрСведений.ЗначенияСвойствСотрудников.СрезПоследних ГДЕ Свойство = &Свойство И Значение = &Значение "; 
			Парам 	= Новый Структура("Свойство, Значение", Справочники.ЗначенияСвойствОбъектов.Сотрудники_ДопАдресЭлПочтыДляJivosite1, ТекСтрока.ЭлПочтаОператора);
			Сотр 	= ОбщНазн.ЗапросВыполнитьНаЗначение(sql, Парам);
		КонецЕсли;
		
		Если Сотр = Неопределено Тогда
			sql		= "ВЫБРАТЬ ПЕРВЫЕ 1 Сотрудник ИЗ РегистрСведений.ЗначенияСвойствСотрудников.СрезПоследних ГДЕ Свойство = &Свойство И Значение = &Значение "; 
			Парам 	= Новый Структура("Свойство, Значение", Справочники.ЗначенияСвойствОбъектов.Сотрудники_ДопАдресЭлПочтыДляJivosite2, ТекСтрока.ЭлПочтаОператора);
			Сотр 	= ОбщНазн.ЗапросВыполнитьНаЗначение(sql, Парам); 
		КонецЕсли;  
		
		Если Сотр = Неопределено Тогда
			ЗаписьЖурналаРегистрации("JivositeОбработкаСообщения", УровеньЖурналаРегистрации.Предупреждение,, Сообщение, "Не найден сотрудник по email "+ТекСтрока.ЭлПочтаОператора);
		КонецЕсли;  

		Сотр = ?(Сотр = Неопределено, Справочники.Сотрудники.ПустаяСсылка(), Сотр);
			
		//Запиши обсуждение
		Зап = Справочники.JivositeОбсуждения.НайтиПоКоду(ТекСтрока.ЧатИд);
		Если Зап <> Справочники.JivositeОбсуждения.ПустаяСсылка() Тогда
			Возврат;
		КонецЕсли;
		
		Зап = Справочники.JivositeОбсуждения.СоздатьЭлемент();		
		Зап.Код				= ТекСтрока.ЧатИд;
		Зап.Наименование	= "Чат  от "+Формат(Дата(ТекСтрока.Дата), "ДФ='dd.MM.yyyy HH:mm'")+" ("+ТекСтрока.ЧатИд+")"; 
		Зап.Дата		 	= ТекСтрока.Дата;
		Зап.Содержание		= ТекСтрока.Сообщения;
		Зап.Сотрудник		= Сотр;
		Зап.ОбработкаПлан	= ТекСтрока.Дата + 3600;
		Зап.Состояние 		= Справочники.СтатусыОбъектов.ОбщийНовый;
		Попытка
			Зап.Записать();
		Исключение
			ЗаписьЖурналаРегистрации("JivositeОбработкаСообщения", УровеньЖурналаРегистрации.Ошибка,, ТекСтрока, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));	
		КонецПопытки	

КонецПроцедуры 


//=================================================================================================
// Импорт внутренних заказ-нарядов созданных без заявки на люксовку (регистр "ЗаказНарядыИмпорт")
//=================================================================================================

Процедура ЗаказНарядыИмпортРегламентноеЗадание() Экспорт
	
	// Процедура выполняет поиск и загрузку документов из баз данных СТО за последние 2 месяца
	//-------------------------------------------------------------------------------------------------
	КонПериода = (ЗначенияСервера.ТекущаяДатаСервер() + 86400);
	НачПериода = НачалоМесяца(ДобавитьМесяц(КонПериода,-2));
	
	РегистрыСведений.ЗаказНарядыИмпорт.ДанныеПолучить(НачПериода,КонПериода);
	РегистрыСведений.ЗаказНарядыИмпорт.ДанныеПроверить();
КонецПроцедуры


//=================================================================================================
// Работа с геоданными и адресной информацией
//=================================================================================================

Функция ПодключитьИнформационнуюБазу(СтрокаПодключения,Кэшировать = Ложь) Экспорт
	ИБ = Неопределено;
	
	Если ПустаяСтрока(СтрокаПодключения)=Ложь Тогда
		// Ищем доступные соединения в кэше, вне зависимости от флага Кэшировать 
		//-------------------------------------------------------------------------------------------------
		АдресХранилищаСоединения = ПараметрыСеанса.КэшCOMСоединений.Получить(СтрокаПодключения);
		Если АдресХранилищаСоединения<>Неопределено Тогда
			СтруктураСоединения = ПолучитьИзВременногоХранилища(АдресХранилищаСоединения);
			
			Попытка
				ИБ = СтруктураСоединения.Объект;
				НомерВерсииПодключеннойБазы = СокрЛП(ИБ.Метаданные.Версия);
			Исключение
				НомерВерсииПодключеннойБазы = "";
			КонецПопытки;
			
			Если ПустаяСтрока(НомерВерсииПодключеннойБазы) Тогда
				ИБ = Неопределено;
				// Очистим временное хранилище 
				//-------------------------------------------------------------------------------------------------
				Попытка
					УдалитьИзВременногоХранилища(АдресХранилищаСоединения);
				Исключение
				КонецПопытки;
			КонецЕсли; 
		КонецЕсли; 
		
		Если ИБ=Неопределено Тогда
			// Если не нашли - создаем подключение
			//-------------------------------------------------------------------------------------------------
			V8COMConnector= Новый COMОбъект("V85.COMConnector");
			Попытка
				ИБ = V8COMConnector.Connect(СтрокаПодключения);
			Исключение
				Сообщить(ОписаниеОшибки());
				ИБ = Неопределено;
			КонецПопытки;
		КонецЕсли; 
		
		Если Кэшировать И ИБ<>Неопределено Тогда
			// Добавим соединение в кэш
			//-------------------------------------------------------------------------------------------------
			Попытка
				СтруктураСоединения = Новый Структура("Объект", ИБ);
				АдресХранилищаСоединения = ПоместитьВоВременноеХранилище(СтруктураСоединения, Новый УникальныйИдентификатор);
				
				ВременноеСоответствие = Новый Соответствие(ПараметрыСеанса.КэшCOMСоединений);
				ВременноеСоответствие.Вставить(СтрокаПодключения, АдресХранилищаСоединения);
				ПараметрыСеанса.КэшCOMСоединений = Новый ФиксированноеСоответствие(ВременноеСоответствие);
			Исключение
			КонецПопытки;
		КонецЕсли; 
	КонецЕсли; 
	
	Возврат ИБ;		
КонецФункции

Функция РегионПоНомеруТелефонаПолучить(Знач НомерТелефона) Экспорт
	
	// Функция по переданному номеру телефона пытается получить ссылку на элемент справочника "Страны"
	// Поиск элементов выполняется только в иерархии страны "Россия". Если элемент найден, то
	// возвращается ссылка на него. В противном случае возвращается Неопределено
	//-------------------------------------------------------------------------------------------------
	НомерТелефона = Конвертация.ТелефонВнешнийНормализовать(НомерТелефона);
	Доступно = Конвертация.ЭтоТолькоЦифры(НомерТелефона) И (СтрДлина(НомерТелефона) = 10);
	Ответ = Неопределено;
	
	Если (Доступно = Истина) Тогда
		ТекстЗапроса = "
		|SELECT	TOP 1 Region AS Регион
		|FROM	ВнешнийИсточникДанных.ТелСервер.Таблица.РегДиапазоны
		|WHERE	(&НомерТелефона BETWEEN From_Num AND To_Num) И (Region <> """")";
		
		Запрос = Новый Запрос(ТекстЗапроса);
		Запрос.УстановитьПараметр("НомерТелефона",НомерТелефона);
		Результат = Запрос.Выполнить().Выбрать();
		
		Если (Результат.Следующий()) Тогда
			СпрСсылка = Справочники.Страны.НайтиПоКоду(ВРег(СокрЛП(Результат.Регион)));
			Ответ = ?(ЗначениеЗаполнено(СпрСсылка),СпрСсылка,Ответ);
		КонецЕсли;
	КонецЕсли;
	
	Возврат (Ответ);
КонецФункции


//=================================================================================================
// Бухгалтерия предприятия КОРП 3.0
//=================================================================================================

Функция БПК3_ПолучитьАктуальнуюПолнуюСтавкуНДС(ИБ, Знач ДатаАктуальности)
	СтруктураНДС = ИБ.NewObject("Структура");
	
	Если ТипЗнч(ДатаАктуальности)<>Тип("Дата") ИЛИ НачалоДня(ДатаАктуальности)=Дата(1,1,1) Тогда
		ДатаАктуальности = ТекущаяДата();		
	КонецЕсли; 
	
	Если ДатаАктуальности>Дата(2026,1,1) Тогда
		СтруктураНДС.Вставить("Ставка", ИБ.Перечисления.СтавкиНДС.НДС22); 
		СтруктураНДС.Вставить("Процент", 22); 
	ИначеЕсли ДатаАктуальности<Дата(2019,1,1) Тогда
		СтруктураНДС.Вставить("Ставка", ИБ.Перечисления.СтавкиНДС.НДС18); 
		СтруктураНДС.Вставить("Процент", 18); 
	Иначе
		СтруктураНДС.Вставить("Ставка", ИБ.Перечисления.СтавкиНДС.НДС20); 
		СтруктураНДС.Вставить("Процент", 20); 
	КонецЕсли; 
	
	Возврат СтруктураНДС;
КонецФункции

Функция БПК3_ПолучитьФизЛицо(ИБ,СНИЛС,ИНН,КонтрСсылка) Экспорт
	
	// Функция выполняет поиск физического лица по переданному СНИЛС в справочнике "ФизическиеЛица".
	// В случае успеха возвращает ссылку на найденный элемент справочника. Если элемент с переданным
	// СНИЛС не найден, то функция пытается создать новый элемент в справочнике "ФизическиеЛица" с
	// переданным СНИЛС. В случае успеха возвращает Истину. В остальных случаях - Неопределено
	//-------------------------------------------------------------------------------------------------
	Доступно = (ТипЗнч(СНИЛС) = Тип("Строка"));
	Доступно = Доступно И (ТипЗнч(КонтрСсылка) = Тип("СправочникСсылка.Контрагенты"));
	Доступно = Доступно И ЗначениеЗаполнено(КонтрСсылка);
	Доступно = Доступно И ЗначениеЗаполнено(СНИЛС);
	
	Если (Доступно = Ложь) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	// Если мы оказались здесь, значит СНИЛС передан. Выполним поиск физического лица
	//-------------------------------------------------------------------------------------------------
	ТекстЗапроса = "
	|SELECT	TOP 1 Ссылка
	|FROM	Справочник.ФизическиеЛица
	|WHERE	(ПометкаУдаления = Ложь) И (СтраховойНомерПФР = &СНИЛС)
	|ORDER	BY Код DESC";
	
	Запрос = ИБ.NewObject("Запрос");
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("СНИЛС",ВРег(СокрЛП(СНИЛС)));
	Результат = Запрос.Выполнить().Выбрать();
	
	Если (Результат.Следующий() = Истина) Тогда
		Возврат (Результат.Ссылка);
	КонецЕсли;
	
	// Если мы оказались здесь, значит физлицо с переданным СНИЛС не найдено в базе и его нужно создать
	//-------------------------------------------------------------------------------------------------
	СпрОбъект = ИБ.Справочники.ФизическиеЛица.СоздатьЭлемент();
	СпрОбъект.ОбменДанными.Загрузка = Истина;
	СпрОбъект.Заполнить(Неопределено);
	СпрОбъект.УстановитьНовыйКод();
	
	// Попытаемся из полного ФИО выделить фамилию, имя, отчество и инициалы физического лица
	//-------------------------------------------------------------------------------------------------
	СтруктураФИО = ИБ.ФизическиеЛицаКлиентСервер.ЧастиИмени(КонтрСсылка.Наименование);
	СпрОбъект.Инициалы = ИБ.ФизическиеЛицаЗарплатаКадрыКлиентСервер.ИнициалыПоИмениОтчеству(СтруктураФИО.Имя,СтруктураФИО.Отчество);
	СпрОбъект.Отчество = СтруктураФИО.Отчество;
	СпрОбъект.Фамилия = СтруктураФИО.Фамилия;
	СпрОбъект.Имя = СтруктураФИО.Имя;
	
	// Если отчество определено, то попытаемся определить пол физического лица
	//-------------------------------------------------------------------------------------------------
	Если (ЗначениеЗаполнено(СпрОбъект.Отчество)) Тогда
		СпрОбъект.Пол = ИБ.СотрудникиКлиентСервер.ОпределитьПолПоОтчеству(СпрОбъект.Отчество);
	Иначе
		СпрОбъект.Пол = ИБ.Перечисления.ПолФизическогоЛица.Мужской;
	КонецЕсли;
	
	// Заполним остальные реквизиты
	//-------------------------------------------------------------------------------------------------
	СпрОбъект.ФИО = СокрЛП(КонтрСсылка.Наименование);
	СпрОбъект.СтраховойНомерПФР = ВРег(СокрЛП(СНИЛС));
	СпрОбъект.ДатаРождения = КонтрСсылка.ДатаОснования;
	СпрОбъект.ИНН = ВРег(Конвертация.СтрокаПолучить(ИНН));
	СпрОбъект.Наименование = СокрЛП(КонтрСсылка.Наименование);
	СпрОбъект.Записать();
	
	// Добавим сведения о паспорте физического лица (при наличии)
	//-------------------------------------------------------------------------------------------------
	Доступно = ЗначениеЗаполнено(КонтрСсылка.СерияДокумента);
	Доступно = Доступно И ЗначениеЗаполнено(КонтрСсылка.НомерДокумента);
	
	Если (Доступно = Истина) Тогда
		РегОбъект = ИБ.РегистрыСведений.ДокументыФизическихЛиц.СоздатьМенеджерЗаписи();
		РегОбъект.ВидДокумента = ИБ.Справочники.ВидыДокументовФизическихЛиц.ПаспортРФ;
		РегОбъект.Период = НачалоДня(ЗначенияСервера.ТекущаяДатаСервер());
		РегОбъект.ЯвляетсяДокументомУдостоверяющимЛичность = Истина;
		РегОбъект.Физлицо = СпрОбъект.Ссылка;
		
		РегОбъект.ДатаВыдачи = КонтрСсылка.ДатаДокумента;
		РегОбъект.КемВыдан = СокрЛП(КонтрСсылка.ЭмитентДокумента);
		РегОбъект.Серия = ВРег(СокрЛП(КонтрСсылка.СерияДокумента));
		РегОбъект.Номер = ВРег(СокрЛП(КонтрСсылка.НомерДокумента));
		РегОбъект.Записать(Истина);
	КонецЕсли;
	
	Возврат (СпрОбъект.Ссылка);
КонецФункции

Функция БПК3_ПолучитьКонтрагента(ИБ,Контрагент,ПерсонализироватьФЛ = Ложь) Экспорт
	
	//=================================================================================================
	// Поиск переданного контрагента в справочнике "Контрагенты" переданной базы
	// Если искомый контрагент - юридическое лицо, то поиск выполняется по ИНН и КПП
	//=================================================================================================
	Если (Контрагент.ТипКонтрагента = Перечисления.ТипКонтрагента.Юл) Тогда
		ТекстЗапроса = "
		|SELECT	TOP 1 Ссылка
		|FROM	Справочник.Контрагенты
		|WHERE	(ПометкаУдаления = Ложь) И (ИНН <> """" И ИНН = &ИНН И КПП = &КПП)
		|ORDER	BY Код DESC";
		
		Запрос = ИБ.NewObject("Запрос");
		Запрос.Текст = ТекстЗапроса;
		Запрос.УстановитьПараметр("ИНН",СокрЛП(Контрагент.ИНН));
		Запрос.УстановитьПараметр("КПП",СокрЛП(Контрагент.КПП));
		Результат = Запрос.Выполнить().Выбрать();
		
		Если (Результат.Следующий() = Истина) Тогда
			Возврат (Результат.Ссылка);
		КонецЕсли;
		
		// Если искомый контрагент - индивидуальный предприниматель, то поиск выполняется только по ИНН
		//-------------------------------------------------------------------------------------------------
	ИначеЕсли (Контрагент.ТипКонтрагента = Перечисления.ТипКонтрагента.Ип) Тогда
		ТекстЗапроса = "
		|SELECT	TOP 1 Ссылка
		|FROM	Справочник.Контрагенты
		|WHERE	(ПометкаУдаления = Ложь) И (ИНН <> """" И ИНН = &ИНН)
		|ORDER	BY Код DESC";
		
		Запрос = ИБ.NewObject("Запрос");
		Запрос.Текст = ТекстЗапроса;
		Запрос.УстановитьПараметр("ИНН",СокрЛП(Контрагент.ИНН));
		Результат = Запрос.Выполнить().Выбрать();
		
		Если (Результат.Следующий() = Истина) Тогда
			Возврат (Результат.Ссылка);
		КонецЕсли;
		
		// Если мы оказались здесь, значит искомый контрагент - физическое лицо
		// Если параметр "ПерсонализироватьФЛ" равен Истине, значит требуется учет контрагентов-физических
		// лиц по наименованию (персонализированный учет). Попытаемся получить контрагента по его UID
		//-------------------------------------------------------------------------------------------------
	ИначеЕсли (ПерсонализироватьФЛ = Истина) Тогда
		ВнешИД = ИБ.NewObject("УникальныйИдентификатор",СокрЛП(Контрагент.УникальныйИдентификатор()));
		КонтрСсылка = ИБ.Справочники.Контрагенты.ПолучитьСсылку(ВнешИД);
		КонтрОбъект = КонтрСсылка.ПолучитьОбъект();
		
		Если (КонтрОбъект <> Неопределено) Тогда
			Возврат (КонтрСсылка);
		КонецЕсли;
		
		// Если мы оказались здесь, значит персонализированный учет по контрагентам не требуется. Выполним
		// поиск контрагента "Частное лицо" (делаем это запросом, т.к. нужно исключить удаленные записи)
		//-------------------------------------------------------------------------------------------------
	Иначе
		ТекстЗапроса = "
		|SELECT	TOP 1 Ссылка
		|FROM	Справочник.Контрагенты
		|WHERE	(ПометкаУдаления = Ложь) И (Наименование = ""Частное лицо"")
		|ORDER	BY Код DESC";
		
		Запрос = ИБ.NewObject("Запрос");
		Запрос.Текст = ТекстЗапроса;
		Результат = Запрос.Выполнить().Выбрать();
		
		Если (Результат.Следующий() = Истина) Тогда
			Возврат (Результат.Ссылка);
		КонецЕсли;
	КонецЕсли;
	
	//=================================================================================================
	// Если мы оказались здесь, значит переданный контрагент не найден в базе и его нужно создать
	// Внимание: новый контрагент сразу создается с уникальным идентификатором переданного контрагента
	//=================================================================================================
	ВнешИД = ИБ.NewObject("УникальныйИдентификатор",СокрЛП(Контрагент.УникальныйИдентификатор()));
	КонтрСсылка = ИБ.Справочники.Контрагенты.ПолучитьСсылку(ВнешИД);
	СпрОбъект = ИБ.Справочники.Контрагенты.СоздатьЭлемент();
	СпрОбъект.УстановитьСсылкуНового(КонтрСсылка);
	СпрОбъект.ОбменДанными.Загрузка = Истина;
	СпрОбъект.УстановитьНовыйКод();
	
	// Заполнение юридического лица
	//-------------------------------------------------------------------------------------------------
	Если (Контрагент.ТипКонтрагента = Перечисления.ТипКонтрагента.Юл) Тогда
		СпрОбъект.ЮридическоеФизическоеЛицо = ИБ.Перечисления.ЮридическоеФизическоеЛицо.ЮридическоеЛицо;
		СпрОбъект.НаименованиеПолное = СокрЛП(Контрагент.НаименованиеПолное);
		СпрОбъект.Наименование = СокрЛП(Контрагент.Наименование);
		СпрОбъект.ИНН = ВРег(СокрЛП(Контрагент.ИНН));
		СпрОбъект.КПП = ВРег(СокрЛП(Контрагент.КПП));
		
		// Создание индивидуального предпринимателя
		//-------------------------------------------------------------------------------------------------
	ИначеЕсли (Контрагент.ТипКонтрагента = Перечисления.ТипКонтрагента.Ип) Тогда
		СпрОбъект.ЮридическоеФизическоеЛицо = ИБ.Перечисления.ЮридическоеФизическоеЛицо.ФизическоеЛицо;
		СпрОбъект.НаименованиеПолное = СокрЛП(Контрагент.НаименованиеПолное);
		СпрОбъект.Наименование = СокрЛП(Контрагент.Наименование);
		СпрОбъект.ИНН = ВРег(СокрЛП(Контрагент.ИНН));
		
		// Создание персонализированного физического лица
		//-------------------------------------------------------------------------------------------------
	ИначеЕсли (ПерсонализироватьФЛ = Истина) Тогда
		СпрОбъект.ЮридическоеФизическоеЛицо = ИБ.Перечисления.ЮридическоеФизическоеЛицо.ФизическоеЛицо;
		СпрОбъект.НаименованиеПолное = СокрЛП(Контрагент.Наименование);
		СпрОбъект.Наименование = СокрЛП(Контрагент.Наименование);
		
		Если (ЗначениеЗаполнено(Контрагент.НомерДокумента)) Тогда
			СтрДок = Конвертация.ПараметрДобавить("","",СокрЛП(Контрагент.ТипДокумента));
			СтрДок = Конвертация.ПараметрДобавить(СтрДок,"Серия:",СокрЛП(Контрагент.СерияДокумента));
			СтрДок = Конвертация.ПараметрДобавить(СтрДок,"Номер:",СокрЛП(Контрагент.НомерДокумента));
			СтрДок = Конвертация.ПараметрДобавить(СтрДок,"Выдан:",СокрЛП(Контрагент.ЭмитентДокумента));
			СпрОбъект.ДокументУдостоверяющийЛичность = СокрЛП(СтрДок);
		КонецЕсли;
		
		// Если мы оказались здесь, значит создается неперсонализированное физическое лицо
		//-------------------------------------------------------------------------------------------------
	Иначе
		СпрОбъект.ЮридическоеФизическоеЛицо = ИБ.Перечисления.ЮридическоеФизическоеЛицо.ФизическоеЛицо;
		СпрОбъект.НаименованиеПолное = "Частное лицо";
		СпрОбъект.Наименование = "Частное лицо";
	КонецЕсли;
	
	// Запишем контрагента и вернем ссылку на него
	//-------------------------------------------------------------------------------------------------
	СпрОбъект.Записать();
	Возврат (СпрОбъект.Ссылка);
КонецФункции

Функция БПК3_ПолучитьДоговорКонтрагента(ИБ,СтруктураЭлемента,ОбособленноеПодразделение,ДогНомерДоступно = Ложь) Экспорт  
	
	// Функция выполняет поиск и создание (при необходимости) договора. Если параметр ДогНомерДоступно
	// равен Истине, то поиск и создание договора будет выполняться с учетом переданного номера,
	// независимо от того является контрагент физическим лицом или нет
	//------------------------------------------------------------------------------------------------- 
	
	НайденныйЭлемент = Неопределено; 
	
	Доступно = (СтруктураЭлемента.Свойство("УИДДоговора")=Истина);
	Доступно = Доступно И (ЗначениеЗаполнено(СтруктураЭлемента.УИДДоговора)=Истина); 
	Доступно = Доступно И (Конвертация.ЭтоУникальныйИдентификатор(СтруктураЭлемента.УИДДоговора)=Истина);
	
	Если Доступно=Истина Тогда
		УИДДоговора = ИБ.NewObject("УникальныйИдентификатор", СтруктураЭлемента.УИДДоговора);
		СпрСсылка = ИБ.Справочники.ДоговорыКонтрагентов.ПолучитьСсылку(УИДДоговора);
		СпрОбъект = СпрСсылка.ПолучитьОбъект();
		Если СпрОбъект<>Неопределено Тогда
			НайденныйЭлемент = СпрСсылка;			
		КонецЕсли;
	Иначе
		УИДДоговора = Неопределено;
	КонецЕсли;
	
	Если НайденныйЭлемент=Неопределено Тогда
		НаименованиеДоговора = СокрЛП(ИБ.String(СтруктураЭлемента.ВидДоговора));
		НаименованиеДоговора = НаименованиеДоговора + " " + СокрЛП(ИБ.String(СтруктураЭлемента.Организация));
		
		Запрос = ИБ.NewObject("Запрос");
		
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДоговорыКонтрагентов.Ссылка
		|ПОМЕСТИТЬ Договоры
		|ИЗ
		|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
		|ГДЕ                                                                                                                            
		|	ДоговорыКонтрагентов.Владелец = &Владелец
		|	И ДоговорыКонтрагентов.Организация = &Организация
		|	И ДоговорыКонтрагентов.ВидДоговора = &ВидДоговора
		|	И ДоговорыКонтрагентов.ПометкаУдаления = ЛОЖЬ";
		
		Запрос.УстановитьПараметр("Владелец", СтруктураЭлемента.Контрагент);
		Запрос.УстановитьПараметр("Организация", СтруктураЭлемента.Организация);
		Запрос.УстановитьПараметр("ВидДоговора", СтруктураЭлемента.ВидДоговора);
		
		// Выясним нужно ли искать договор с учетом его номера. Поиск договора с учетом номера выполняется
		// если у контрагента заполнен ИНН или параметр "ДогНомерДоступно" равен Истине
		//-------------------------------------------------------------------------------------------------
		УчетПоНомеруДоговора = (ДогНомерДоступно = Истина);
		УчетПоНомеруДоговора = УчетПоНомеруДоговора ИЛИ ЗначениеЗаполнено(СтруктураЭлемента.Контрагент.ИНН);
		УчетПоНомеруДоговора = УчетПоНомеруДоговора И ЗначениеЗаполнено(СтруктураЭлемента.НомерДоговора);
		
		Если (УчетПоНомеруДоговора = Истина) Тогда
			Запрос.Текст = Запрос.Текст + "
			|	И ДоговорыКонтрагентов.Номер = &Номер";
			
			Запрос.УстановитьПараметр("Номер", СтруктураЭлемента.НомерДоговора);
		Иначе
			Запрос.Текст = Запрос.Текст + "
			|	И ДоговорыКонтрагентов.Наименование ПОДОБНО &Наименование";
			
			Запрос.УстановитьПараметр("Наименование", НаименованиеДоговора+"%");
		КонецЕсли; 
		
		// Продолжим формирование текста запроса
		//-------------------------------------------------------------------------------------------------
		Запрос.Текст = Запрос.Текст+"
		|;
		|ВЫБРАТЬ ПЕРВЫЕ 1
		|		ДополнительныеРеквизитыИСведения.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ Свойство
		|ИЗ
		|	ПланВидовХарактеристик.ДополнительныеРеквизитыИСведения КАК ДополнительныеРеквизитыИСведения
		|ГДЕ
		|	ДополнительныеРеквизитыИСведения.НаборСвойств = ЗНАЧЕНИЕ(Справочник.НаборыДополнительныхРеквизитовИСведений.Справочник_ДоговорыКонтрагентов)
		|	И ДополнительныеРеквизитыИСведения.Заголовок = ""Подразделение""
		|	И ЭтоДополнительноеСведение=ЛОЖЬ
		|;
		|ВЫБРАТЬ
		|	Ссылка,
		|	Значение
		|ПОМЕСТИТЬ ДоговорыСвойства
		|ИЗ Справочник.ДоговорыКонтрагентов.ДополнительныеРеквизиты
		|ГДЕ Ссылка В (ВЫБРАТЬ Ссылка ИЗ Договоры) И Свойство В (ВЫБРАТЬ Ссылка ИЗ Свойство)
		|;
		|ВЫБРАТЬ
		|	Ссылка, Значение 
		|ПОМЕСТИТЬ ВсеДоговоры 
		|ИЗ ДоговорыСвойства
		|ОБЪЕДИНИТЬ ВСЕ
		|ВЫБРАТЬ 
		|	Ссылка, ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка)
		|ИЗ Справочник.ДоговорыКонтрагентов 
		|ГДЕ Ссылка В (ВЫБРАТЬ Ссылка ИЗ Договоры) И НЕ Ссылка В (ВЫБРАТЬ Ссылка ИЗ ДоговорыСвойства)
		|;
		|ВЫБРАТЬ ПЕРВЫЕ 1 ВсеДоговоры.Ссылка 
		|ИЗ ВсеДоговоры КАК ВсеДоговоры
		|ЛЕВОЕ СОЕДИНЕНИЕ Свойство КАК Свойство ПО ИСТИНА=ИСТИНА 
		|ГДЕ (Значение=&Значение ИЛИ Свойство.Ссылка IS NULL)
		|УПОРЯДОЧИТЬ ПО
		|	ВсеДоговоры.Ссылка.Код УБЫВ	
		|";
		
		Запрос.УстановитьПараметр("Значение", ОбособленноеПодразделение);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			НайденныйЭлемент = Выборка.Ссылка;
		КонецЦикла; 
		
		Если НайденныйЭлемент=Неопределено Тогда
			ЭлементОбъект = ИБ.Справочники.ДоговорыКонтрагентов.СоздатьЭлемент();
			
			Если УИДДоговора<>Неопределено Тогда
				СпрСсылка = ИБ.Справочники.ДоговорыКонтрагентов.ПолучитьСсылку(УИДДоговора);
				ЭлементОбъект.УстановитьСсылкуНового(СпрСсылка);	
			КонецЕсли;
			
			ЭлементОбъект.Наименование = НаименованиеДоговора;
			
			ЭлементОбъект.Владелец = СтруктураЭлемента.Контрагент;
			ЭлементОбъект.Организация = СтруктураЭлемента.Организация;
			ЭлементОбъект.ВидДоговора = СтруктураЭлемента.ВидДоговора;
			ЭлементОбъект.ВалютаВзаиморасчетов = ИБ.Константы.ВалютаРегламентированногоУчета.Получить();
			
			// Lemmy
			// Если переменная "УчетПоНомеруДоговора" равна Истине, значит поиск выполнялся по номеру договора,
			// поэтому и создание договора также должно учитывать его номер. Заполним номер договора, а также
			// сформируем наименование элемента с учетом номера
			//-------------------------------------------------------------------------------------------------
			Если (УчетПоНомеруДоговора = Истина) Тогда
				ЭлементОбъект.Номер = ВРег(СокрЛП(СтруктураЭлемента.НомерДоговора));
				
				// Если дата договора передана, то заполним реквизит с датой и учтем ее в наименовании договора
				//-------------------------------------------------------------------------------------------------
				Доступно = (СтруктураЭлемента.Свойство("ДатаДоговора") = Истина);
				Доступно = Доступно И ЗначениеЗаполнено(СтруктураЭлемента.ДатаДоговора);
				
				Если (Доступно = Истина) Тогда
					ЭлементОбъект.Дата = НачалоДня(СтруктураЭлемента.ДатаДоговора);
					
					СтрТемп = СокрЛП(ЭлементОбъект.Номер) + " от ";
					СтрТемп = СтрТемп + СокрЛП(Формат(ЭлементОбъект.Дата,"ДЛФ=DD"));
					СтрТемп = СтрТемп + ", " + СокрЛП(ИБ.String(СтруктураЭлемента.Организация));
					ЭлементОбъект.Наименование = СокрЛП(СтрТемп);
				КонецЕсли;
			КонецЕсли; 
			
			ЭлементОбъект.СпособВыставленияДокументов = ИБ.Перечисления.СпособыВыставленияДокументов.Автоматически;
			
			ЭлементОбъект.СрокОплаты = 0;
			ЭлементОбъект.УстановленСрокОплаты = Ложь;
			
			// Дополнительные реквизиты
			//====================================================================================================================== 
			Если ИБ.ЗначениеЗаполнено(ОбособленноеПодразделение)=Истина Тогда
				РеквизитПодразделение = ИБ.ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоРеквизиту("Заголовок", "Подразделение");
				Если РеквизитПодразделение.Пустая()=Ложь Тогда
					СтрокаДополнительныеРеквизиты = ЭлементОбъект.ДополнительныеРеквизиты.Найти(РеквизитПодразделение, "Свойство");
					Если СтрокаДополнительныеРеквизиты = Неопределено Тогда
						СтрокаДополнительныеРеквизиты = ЭлементОбъект.ДополнительныеРеквизиты.Добавить();
					КонецЕсли;
					СтрокаДополнительныеРеквизиты.Свойство = РеквизитПодразделение;
					СтрокаДополнительныеРеквизиты.Значение = ОбособленноеПодразделение;
				КонецЕсли;			
			КонецЕсли; 
			
			ЭлементОбъект.УстановитьНовыйКод();
			ЭлементОбъект.ОбменДанными.Загрузка = Истина;
			ЭлементОбъект.Записать();
			
			НайденныйЭлемент = ЭлементОбъект.Ссылка;
		КонецЕсли; 
	КонецЕсли;
	
	Возврат НайденныйЭлемент;
КонецФункции

Функция БПК3_ПолучитьПользователя(ИБ, Наименование) Экспорт
	ЭлементСсылка = Неопределено;
	
	Запрос = ИБ.NewObject("Запрос");
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Пользователи.Ссылка
	|ИЗ
	|	Справочник.Пользователи КАК Пользователи
	|ГДЕ
	|	Пользователи.Наименование ПОДОБНО &Наименование
	|	И Пользователи.ПометкаУдаления = ЛОЖЬ
	|УПОРЯДОЧИТЬ ПО Недействителен
	|";
	
	Запрос.УстановитьПараметр("Наименование", СокрЛП(Наименование));
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		ЭлементСсылка = Выборка.Ссылка;
	КонецЦикла;  
	
	Если ЭлементСсылка=Неопределено Тогда
		ЭлементОбъект = ИБ.Справочники.Пользователи.СоздатьЭлемент();
		
		ЭлементОбъект.Наименование = СокрЛП(Наименование);
		ЭлементОбъект.УстановитьНовыйКод();
		
		ЭлементОбъект.ОбменДанными.Загрузка = Истина;
		ЭлементОбъект.Записать();
		
		ЭлементСсылка = ЭлементОбъект.Ссылка;
	КонецЕсли;  
	
	Возврат ЭлементСсылка;
КонецФункции

Функция БПК3_ПолучитьВидОплаты(ИБ, ИННОрганизации, ОбособленноеПодразделение) Экспорт
	// получаем последний вид оплаты по организации
	
	ЭлементСсылка = Неопределено;
	
	Если ЗначениеЗаполнено(ИННОрганизации)=Ложь Тогда
		Возврат ЭлементСсылка;		
	КонецЕсли; 
	
	Запрос = ИБ.NewObject("Запрос");
	Запрос.Текст = "
	|	ВЫБРАТЬ ПЕРВЫЕ 1
	|		ДополнительныеРеквизитыИСведения.Ссылка КАК Ссылка
	|	ПОМЕСТИТЬ Свойство
	|	ИЗ
	|		ПланВидовХарактеристик.ДополнительныеРеквизитыИСведения КАК ДополнительныеРеквизитыИСведения
	|	ГДЕ
	|		ДополнительныеРеквизитыИСведения.НаборСвойств = ЗНАЧЕНИЕ(Справочник.НаборыДополнительныхРеквизитовИСведений.Справочник_ДоговорыКонтрагентов)
	|		И ДополнительныеРеквизитыИСведения.Заголовок = ""Подразделение""
	|		И ЭтоДополнительноеСведение=ЛОЖЬ
	|	;
	|	ВЫБРАТЬ
	|		Ссылка
	|	ПОМЕСТИТЬ Договоры
	|	ИЗ Справочник.ДоговорыКонтрагентов.ДополнительныеРеквизиты
	|	ГДЕ Свойство В (ВЫБРАТЬ Ссылка ИЗ Свойство)
	|		И Значение=&Значение
	|		И Ссылка.Организация.ИНН=&ИНН
	|	;
	|	ВЫБРАТЬ
	|		Ссылка
	|	ПОМЕСТИТЬ ДоговорыБезПодразделения
	|	ИЗ Справочник.ДоговорыКонтрагентов
	|	ГДЕ НЕ Ссылка В (ВЫБРАТЬ Ссылка ИЗ Договоры)
	|		И Ссылка.Организация.ИНН=&ИНН
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		Ссылка
	|	ИЗ Справочник.ДоговорыКонтрагентов.ДополнительныеРеквизиты
	|	ГДЕ Свойство В (ВЫБРАТЬ Ссылка ИЗ Свойство)
	|		И Значение=ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка)
	|		И Ссылка.Организация.ИНН=&ИНН
	|	;
	|	ВЫБРАТЬ ПЕРВЫЕ 1
	|		Ссылка
	|	ИЗ Справочник.ВидыОплатОрганизаций
	|	ГДЕ Организация.ИНН=&ИНН
	|		И ТипОплаты=ЗНАЧЕНИЕ(Перечисление.ТипыОплат.ПлатежнаяКарта)
	|		И 
	|		((ДоговорКонтрагента В (ВЫБРАТЬ Ссылка ИЗ Договоры) И &ПустойДоговор=ЛОЖЬ)
	|		ИЛИ
	|		(ДоговорКОнтрагента В (ВЫБРАТЬ Ссылка ИЗ ДоговорыБезПодразделения) И &ПустойДоговор=ИСТИНА))
	|	УПОРЯДОЧИТЬ ПО Код УБЫВ";
	
	Запрос.УстановитьПараметр("ИНН", СокрЛП(ИННОрганизации));
	
	Если ОбособленноеПодразделение=Неопределено Тогда
		Запрос.УстановитьПараметр("ПустойДоговор", Истина);
		Запрос.УстановитьПараметр("Значение", ИБ.Справочники.ПодразделенияОрганизаций.ПустаяСсылка());
	Иначе
		Запрос.УстановитьПараметр("ПустойДоговор", Ложь);
		Запрос.УстановитьПараметр("Значение", ОбособленноеПодразделение);
	КонецЕсли; 
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ЭлементСсылка = Выборка.Ссылка;			
	КонецЦикла; 
	
	Если (ЭлементСсылка = Неопределено) И (ОбособленноеПодразделение<>Неопределено) Тогда
		ЭлементСсылка = БПК3_ПолучитьВидОплаты(ИБ, ИННОрганизации, Неопределено);		
	КонецЕсли; 
	
	Возврат ЭлементСсылка;
КонецФункции

Функция БПК3_ПолучитьОбособленноеПодразделение(ИБ, Организация, ТочкаОформления) Экспорт
	ЭлементСсылка = Неопределено;
	
	Если ЗначениеЗаполнено(Организация)=Ложь ИЛИ ЗначениеЗаполнено(ТочкаОформления)=Ложь Тогда
		Возврат ЭлементСсылка;		
	КонецЕсли;  
	
	Если ИБ.Метаданные.Справочники.Найти("АВ_НастройкиОбмена")<>Неопределено 
		И ИБ.Метаданные.Справочники.АВ_НастройкиОбмена.ТабличныеЧасти.Найти("СоответствияОрганизаций")<>Неопределено Тогда 
		// Получаем обособленное подразделение из табличной части СоответствияОрганизаций справочника АВ_НастройкиОбмена
		//======================================================================================================================
		Запрос = ИБ.NewObject("Запрос");
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		|	ПодразделениеОрганизации КАК ПодразделениеОрганизации
		|ИЗ
		|	Справочник.АВ_НастройкиОбмена.СоответствияОрганизаций
		|ГДЕ
		|	Организация.ИНН = &ОрганизацияИНН
		|	И (ТочкаОформления.Наименование ПОДОБНО &ТочкаОформленияНаименование
		|			ИЛИ ТочкаОформления = ЗНАЧЕНИЕ(Справочник.ЗначенияСвойствОбъектов.ПустаяСсылка))
		|УПОРЯДОЧИТЬ ПО
		|	ВЫБОР
		|		КОГДА ТочкаОформления.Наименование = &ТочкаОформленияНаименование
		|			ТОГДА 0
		|		КОГДА ТочкаОформления.Наименование ПОДОБНО &ТочкаОформленияНаименование
		|			ТОГДА 1
		|		ИНАЧЕ 99
		|	КОНЕЦ,
		|	НомерСтроки
		|";
		
		Запрос.УстановитьПараметр("ОрганизацияИНН", СокрЛП(Организация.ИНН));
		Запрос.УстановитьПараметр("ТочкаОформленияНаименование", СокрЛП(ТочкаОформления.Наименование));  
		
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			ЭлементСсылка = Выборка.ПодразделениеОрганизации;			
		КонецЦикла; 
	Иначе  
		// Получаем обособленное подразделение по дополнительному свойству "УИД_ОП", куда помещаем УИД Точки _ УИД Организации 
		//-------------------------------------------------------------------------------------------------	 
		СтруктураХолдераНаТочке = ОбщНазн.ХолдерНаТочкеПолучитьСтруктуру(Организация, ТочкаОформления); 
		
		Запрос = ИБ.NewObject("Запрос");
		Запрос.Текст = 
		"	ВЫБРАТЬ ПЕРВЫЕ 1
		|		ДополнительныеРеквизитыИСведения.Ссылка КАК Ссылка
		|	ПОМЕСТИТЬ Свойство
		|	ИЗ
		|		ПланВидовХарактеристик.ДополнительныеРеквизитыИСведения КАК ДополнительныеРеквизитыИСведения
		|	ГДЕ
		|		ДополнительныеРеквизитыИСведения.НаборСвойств = ЗНАЧЕНИЕ(Справочник.НаборыДополнительныхРеквизитовИСведений.Справочник_ПодразделенияОрганизаций)
		|		И ДополнительныеРеквизитыИСведения.Заголовок = ""УИД_ОП""
		|		И ЭтоДополнительноеСведение=ИСТИНА
		|	;
		|	ВЫБРАТЬ
		|		Объект КАК Ссылка
		|	ИЗ РегистрСведений.ДополнительныеСведения
		|	ГДЕ Свойство В (ВЫБРАТЬ Ссылка ИЗ Свойство)
		|		И Значение=&Значение
		|";
		
		Запрос.УстановитьПараметр("Значение", СтруктураХолдераНаТочке.КлючОбменаБП);
		
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			ЭлементСсылка = Выборка.Ссылка;			
		КонецЦикла; 
	КонецЕсли;
	
	Возврат ЭлементСсылка;
КонецФункции

Функция БПК3_СоздатьПриходныйКассовыйОрдер(Организация,СтруктураДокумента) Экспорт
	Ответ = Новый Структура("НомерДокумента, ИдентификаторДокумента, Результат");
	Ответ.НомерДокумента = Неопределено;
	Ответ.ИдентификаторДокумента = Неопределено;
	Ответ.Результат = Неопределено;
	
	Если Организация.ВыгружатьКассовыеДокументы=Ложь Тогда
		Возврат Ответ;		
	КонецЕсли; 
	
	ИБ = ПодключитьИнформационнуюБазу(Организация.ИнформационнаяБазаБухгалтерии);
	Если ИБ=Неопределено Тогда
		Ответ.Результат = "Ошибка подключения к бухгалтерской ИБ!";
		Возврат Ответ;
	КонецЕсли;
	
	ДокументОбъект = ИБ.Документы.ПриходныйКассовыйОрдер.CreateDocument();
	
	ДокументОбъект.Дата = СтруктураДокумента.Дата;
	
	ДокументОбъект.Организация = ИБ.Справочники.Организации.НайтиПоРеквизиту("ИНН", Организация.ИНН);
	Если ИБ.ЗначениеЗаполнено(ДокументОбъект.Организация)=Ложь Тогда
		Ответ.Результат = "Не найдена организация "+СокрЛП(Организация)+" в бухгалтерской ИБ!";
		Возврат Ответ;
	КонецЕсли;
	
	ОбособленноеПодразделение = БПК3_ПолучитьОбособленноеПодразделение(ИБ, Организация, СтруктураДокумента.ТочкаОформления);
	Если ОбособленноеПодразделение<>Неопределено Тогда
		ДокументОбъект.ПодразделениеОрганизации = ОбособленноеПодразделение;
	КонецЕсли; 
	
	Если ИБ.УчетнаяПолитика.ПлательщикЕНВД(ДокументОбъект.Организация, ДокументОбъект.Дата) ИЛИ ИБ.УчетнаяПолитика.ПрименяетсяУСН(ДокументОбъект.Организация, ДокументОбъект.Дата) ИЛИ ИБ.УчетнаяПолитика.ПрименяетсяУСНПатент(ДокументОбъект.Организация, ДокументОбъект.Дата) Тогда
		СтавкаНДС = ИБ.Перечисления.СтавкиНДС.БезНДС;
		СуммаНДС = 0;
	Иначе
		СтруктураНДС = БПК3_ПолучитьАктуальнуюПолнуюСтавкуНДС(ИБ, ДокументОбъект.Дата);
		СтавкаНДС = СтруктураНДС.Ставка;
		СуммаНДС = Окр((СтруктураДокумента.СуммаДокумента*СтруктураНДС.Процент)/(100+СтруктураНДС.Процент),2,РежимОкругления.Окр15как10);
	КонецЕсли;	
	
	ДокументОбъект.ВидОперации = ИБ.Перечисления.ВидыОперацийПКО.ОплатаПокупателя;
	ДокументОбъект.ВалютаДокумента = ИБ.Константы.ВалютаРегламентированногоУчета.Получить();
	
	ИБ.ЗаполнениеДокументов.Заполнить(ДокументОбъект, Неопределено, Истина);
	ДокументОбъект.СчетКасса = ИБ.ПланыСчетов.Хозрасчетный.КассаОрганизации;
	ДокументОбъект.СуммаДокумента = СтруктураДокумента.СуммаДокумента;
	
	// Хахалин
	// Если в параметре "СтруктураДокумента" есть реквизит "ПерсонализироватьФЛ", то передадим его
	// в функцию поиска/создания контрагента. Если реквизит отсутствует, то передадим Ложь. Этот
	// реквизит влияет на персонализацию контрагентов - физических лиц (Истина - поиск/создание
	// выполняется по наименованию контрагента, Ложь - контрагент всегда "Частное лицо")
	//-------------------------------------------------------------------------------------------------
	ПерсДоступно = ?(СтруктураДокумента.Свойство("ПерсонализироватьФЛ") = Истина,СтруктураДокумента.ПерсонализироватьФЛ,Ложь);
	ДокументОбъект.Контрагент = БПК3_ПолучитьКонтрагента(ИБ,СтруктураДокумента.Контрагент,ПерсДоступно);
	
	Если ИБ.ЗначениеЗаполнено(ДокументОбъект.Контрагент)=Ложь Тогда
		Ответ.Результат = "Не найден контрагент "+СокрЛП(СтруктураДокумента.Контрагент)+" в бухгалтерской ИБ!";
		Возврат Ответ;
	КонецЕсли; 
	
	ДокументОбъект.РасшифровкаПлатежа.Очистить();
	нСтрока = ДокументОбъект.РасшифровкаПлатежа.Добавить();
	
	// Хахалин
	// Если в параметре "СтруктураДокумента" есть реквизит "УчетПоНомеруДоговора", то передадим его
	// в функцию поиска/создания договора. Если реквизит отсутствует, то передадим Ложь. Этот реквизит
	// говорит о том, что поиск договора контрагента должен выполняться по номеру договора, независимо
	// от того является контрагент физическим лицом или нет
	//-------------------------------------------------------------------------------------------------
	ДогНомерДоступно = ?(СтруктураДокумента.Свойство("УчетПоНомеруДоговора") = Истина,СтруктураДокумента.УчетПоНомеруДоговора,Ложь);
	
	СтруктураЭлемента = Новый Структура("Контрагент, Организация, ВидДоговора, НомерДоговора, ДатаДоговора, УИДДоговора");
	СтруктураЭлемента.Контрагент = ДокументОбъект.Контрагент;
	СтруктураЭлемента.Организация = ДокументОбъект.Организация;
	СтруктураЭлемента.ВидДоговора = ИБ.Перечисления.ВидыДоговоровКонтрагентов.СПокупателем;
	СтруктураЭлемента.НомерДоговора = СтруктураДокумента.НомерДоговора;
	СтруктураЭлемента.ДатаДоговора = СтруктураДокумента.ДатаДоговора;
	СтруктураДокумента.Свойство("УИДДоговора", СтруктураЭлемента.УИДДоговора);
	
	нСтрока.ДоговорКонтрагента = БПК3_ПолучитьДоговорКонтрагента(ИБ,СтруктураЭлемента,ДокументОбъект.ПодразделениеОрганизации,ДогНомерДоступно);
	
	нСТрока.СпособПогашенияЗадолженности  = ИБ.Перечисления.СпособыПогашенияЗадолженности.Автоматически;
	нСтрока.СуммаПлатежа = СтруктураДокумента.СуммаДокумента;
	нСтрока.КурсВзаиморасчетов = 1;
	нСтрока.СуммаВзаиморасчетов = СтруктураДокумента.СуммаДокумента;                                                    
	нСТрока.СуммаНДС = СуммаНДС;
	нСтрока.СтавкаНДС = СтавкаНДС;
	
	нСтрока.СтатьяДвиженияДенежныхСредств = ИБ.Справочники.СтатьиДвиженияДенежныхСредств.НайтиПоНаименованию("Поступление от покупателей", Истина);
	
	// Отражение аванса в зависимости от вида деятельности	
	//======================================================================================================================
	СистемаНалогообложения = ЗначенияСервера.ПолучитьСистемуНалогообложения(Организация, СтруктураДокумента.ТочкаОформления, СтруктураДокумента.Дата);
	Если СистемаНалогообложения=Перечисления.СистемыНалогообложения.Патент Тогда
		ПараметрыДеятельности = ИБ.УчетПСН.ДеятельностьНаПатентеПоУмолчанию(ДокументОбъект.Организация, ДокументОбъект.Дата);
		ИБ.ЗаполнитьЗначенияСвойств(ДокументОбъект, ПараметрыДеятельности);
		
		нСтрока.ПорядокОтраженияАванса = ПараметрыДеятельности.Патент;
	ИначеЕсли СистемаНалогообложения=Перечисления.СистемыНалогообложения.УСН ИЛИ СистемаНалогообложения=Перечисления.СистемыНалогообложения.УСНДоходРасход Тогда
		нСтрока.ПорядокОтраженияАванса = ИБ.Перечисления.ПорядокОтраженияАвансов.ДоходУСН;		
	КонецЕсли;
	
	//======================================================================================================================
	// счета учета
	нСтрока.СчетУчетаРасчетовСКонтрагентом = ИБ.ПланыСчетов.Хозрасчетный.РасчетыСПокупателями;
	нСтрока.СчетУчетаРасчетовПоАвансам = ИБ.ПланыСчетов.Хозрасчетный.РасчетыПоАвансамПолученным;
	
	ДокументОбъект.Ответственный = БПК3_ПолучитьПользователя(ИБ, СтруктураДокумента.Автор);
	
	ДокументОбъект.ПринятоОт = СокрЛп(СтруктураДокумента.ПринятоОт);
	ДокументОбъект.Основание = СокрЛп(СтруктураДокумента.Основание);
	ДокументОбъект.Приложение = СокрЛп(СтруктураДокумента.Приложение);
	
	ДокументОбъект.Комментарий = СтруктураДокумента.Комментарий;
	
	ДокументОбъект.УстановитьНовыйНомер();
	Попытка
		ДокументОбъект.Записать(ИБ.РежимЗаписиДокумента.Проведение);
		
		Ответ.НомерДокумента = СокрЛП(ДокументОбъект.Номер);
		Ответ.ИдентификаторДокумента = ИБ.XMLСтрока(ДокументОбъект.Ссылка);
		Ответ.Результат = "ОК";
	Исключение
		Попытка
			ДокументОбъект.ОбменДанными.Загрузка = Истина;
			РежимЗаписи = ИБ.РежимЗаписиДокумента.Запись;	
			ДокументОбъект.Записать(РежимЗаписи);
			
			Ответ.НомерДокумента = СокрЛП(ДокументОбъект.Номер);
			Ответ.ИдентификаторДокумента = ИБ.XMLСтрока(ДокументОбъект.Ссылка);
			Ответ.Результат = "ОК";
			
		Исключение	
			
			Ответ.НомерДокумента = Неопределено;
			Ответ.ИдентификаторДокумента = Неопределено;
			Ответ.Результат = "Ошибка проведения документа: "+ОписаниеОшибки();
		КонецПопытки;
	КонецПопытки;
	
	ИБ = Неопределено;
	
	Возврат Ответ;	
КонецФункции

Функция БПК3_СоздатьРасходныйКассовыйОрдер(Организация,СтруктураДокумента) Экспорт
	
	Ответ = Новый Структура("НомерДокумента, ИдентификаторДокумента, Результат");
	Ответ.НомерДокумента = Неопределено;
	Ответ.ИдентификаторДокумента = Неопределено;
	Ответ.Результат = Неопределено;
	
	Если Организация.ВыгружатьКассовыеДокументы=Ложь Тогда
		Возврат Ответ;		
	КонецЕсли; 
	
	ИБ = ПодключитьИнформационнуюБазу(Организация.ИнформационнаяБазаБухгалтерии);
	Если ИБ=Неопределено Тогда
		Ответ.Результат = "Ошибка подключения к бухгалтерской ИБ!";
		Возврат Ответ;
	КонецЕсли;
	
	ДокументОбъект = ИБ.Документы.РасходныйКассовыйОрдер.CreateDocument();
	
	ДокументОбъект.Дата = СтруктураДокумента.Дата;
	
	ДокументОбъект.Организация = ИБ.Справочники.Организации.НайтиПоРеквизиту("ИНН", Организация.ИНН);
	Если ИБ.ЗначениеЗаполнено(ДокументОбъект.Организация)=Ложь Тогда
		Ответ.Результат = "Не найдена организация "+СокрЛП(Организация)+" в бухгалтерской ИБ!";
		Возврат Ответ;
	КонецЕсли; 
	
	ОбособленноеПодразделение = БПК3_ПолучитьОбособленноеПодразделение(ИБ, Организация, СтруктураДокумента.ТочкаОформления);
	Если ОбособленноеПодразделение<>Неопределено Тогда
		ДокументОбъект.ПодразделениеОрганизации = ОбособленноеПодразделение;
	КонецЕсли; 
	
	Если ИБ.УчетнаяПолитика.ПлательщикЕНВД(ДокументОбъект.Организация, ДокументОбъект.Дата) ИЛИ ИБ.УчетнаяПолитика.ПрименяетсяУСН(ДокументОбъект.Организация, ДокументОбъект.Дата) Тогда
		СтавкаНДС = ИБ.Перечисления.СтавкиНДС.БезНДС;
		СуммаНДС = 0;
	Иначе
		СтруктураНДС = БПК3_ПолучитьАктуальнуюПолнуюСтавкуНДС(ИБ, ДокументОбъект.Дата);
		СтавкаНДС = СтруктураНДС.Ставка;
		СуммаНДС = Окр((СтруктураДокумента.СуммаДокумента*СтруктураНДС.Процент)/(100+СтруктураНДС.Процент),2,РежимОкругления.Окр15как10);
	КонецЕсли;	
	
	// Хахалин
	// В параметре "СтруктураДокумента" (тип - Структура) можно передавать дополнительный реквизит
	// "ЭтоОплатаПоставщику" (булево). Если реквизит присутствует и он равен Истине, то вид операции
	// и статья движения ДС в создаваемом РКО примут значения связанные с оплатой поставщикам. Во всех
	// остальных случаях документ настраивается как "ВозвратПокупателю"
	//-------------------------------------------------------------------------------------------------
	ЭтоОплатаПоставщику = (СтруктураДокумента.Свойство("ЭтоОплатаПоставщику") = Истина) И (СтруктураДокумента.ЭтоОплатаПоставщику = Истина);   
	ЭтоОплатаКомитенту = СтруктураДокумента.Свойство("ЭтоОплатаКомитенту") И (СтруктураДокумента.ЭтоОплатаКомитенту = Истина);
	ЭтоОплатаПоДВОУ = СтруктураДокумента.Свойство("ЭтоОплатаПоДВОУ") И (СтруктураДокумента.ЭтоОплатаПоДВОУ = Истина);
	
	Если (ЭтоОплатаПоДВОУ = Истина) Тогда
		ДокументОбъект.ВидОперации = ИБ.Перечисления.ВидыОперацийРКО.ВыплатаСотрудникуПоДоговоруПодряда;
		ТекСтатьяДДС = ИБ.Справочники.СтатьиДвиженияДенежныхСредств.ОплатаПоставщику;
		ТекВидДоговора = ИБ.Перечисления.ВидыДоговоровКонтрагентов.СПоставщиком;
		
		ТекСчетРасчетовПоКонтрагентам = ИБ.ПланыСчетов.Хозрасчетный.ПрочиеРасчетыСФизическимиЛицами;
		ТекСчетРасчетовПоАвансам = ИБ.ПланыСчетов.Хозрасчетный.ПрочиеРасчетыСФизическимиЛицами;
		
	ИначеЕсли (ЭтоОплатаПоставщику = Истина) Тогда
		ДокументОбъект.ВидОперации = ИБ.Перечисления.ВидыОперацийРКО.ОплатаПоставщику;
		
		ТекСтатьяДДС = ИБ.Справочники.СтатьиДвиженияДенежныхСредств.ОплатаПоставщику;
		ТекВидДоговора = ИБ.Перечисления.ВидыДоговоровКонтрагентов.СПоставщиком;
		ТекСчетРасчетовПоКонтрагентам = ИБ.ПланыСчетов.Хозрасчетный.РасчетыСПоставщиками;
		ТекСчетРасчетовПоАвансам = ИБ.ПланыСчетов.Хозрасчетный.РасчетыПоАвансамВыданным;
		
	ИначеЕсли ЭтоОплатаКомитенту Тогда
		ДокументОбъект.ВидОперации 		= ИБ.Перечисления.ВидыОперацийРКО.ОплатаПоставщику;
		
		ТекСтатьяДДС 					= ИБ.Справочники.СтатьиДвиженияДенежныхСредств.ОплатаПоставщику;
		ТекВидДоговора 					= ИБ.Перечисления.ВидыДоговоровКонтрагентов.СКомитентом;
		ТекСчетРасчетовПоКонтрагентам 	= ИБ.ПланыСчетов.Хозрасчетный.ПрочиеРасчетыСРазнымиДебиторамиИКредиторами;
		ТекСчетРасчетовПоАвансам 		= ИБ.ПланыСчетов.Хозрасчетный.ПрочиеРасчетыСРазнымиДебиторамиИКредиторами;
		
	Иначе
		ДокументОбъект.ВидОперации = ИБ.Перечисления.ВидыОперацийРКО.ВозвратПокупателю;
		
		ТекВидДоговора = ИБ.Перечисления.ВидыДоговоровКонтрагентов.СПокупателем;
		ТекСчетРасчетовПоКонтрагентам = ИБ.ПланыСчетов.Хозрасчетный.РасчетыСПокупателями;
		ТекСчетРасчетовПоАвансам = ИБ.ПланыСчетов.Хозрасчетный.РасчетыПоАвансамПолученным;
		ТекСтатьяДДС = ИБ.Справочники.СтатьиДвиженияДенежныхСредств.НайтиПоНаименованию("Возврат покупателю",Истина);
	КонецЕсли;
	
	
	ИБ.ЗаполнениеДокументов.Заполнить(ДокументОбъект, Неопределено, Истина);
	ДокументОбъект.СчетКасса = ИБ.ПланыСчетов.Хозрасчетный.КассаОрганизации;
	ДокументОбъект.СуммаДокумента = СтруктураДокумента.СуммаДокумента;
	
	ДокументОбъект.ВалютаДокумента = ИБ.Константы.ВалютаРегламентированногоУчета.Получить(); 
	
	
	// Хахалин
	// Если в параметре "СтруктураДокумента" есть реквизит "ПерсонализироватьФЛ", то передадим его
	// в функцию поиска/создания контрагента. Если реквизит отсутствует, то передадим Ложь. Этот
	// реквизит влияет на персонализацию контрагентов - физических лиц (Истина - поиск/создание
	// выполняется по наименованию контрагента, Ложь - контрагент всегда "Частное лицо")
	//-------------------------------------------------------------------------------------------------
	Если (ЭтоОплатаПоДВОУ = Истина) Тогда
		Водитель = СтруктураДокумента.Основание.Водитель;
		ВодительИНН = ВРег(СокрЛП(СтруктураДокумента.Основание.ВодительИНН));
		ВодительСНИЛС = ВРег(СокрЛП(СтруктураДокумента.Основание.ВодительСНИЛС));
		ДокументОбъект.Контрагент = БПК3_ПолучитьФизЛицо(ИБ,ВодительСНИЛС,ВодительИНН,Водитель);
		
	Иначе
		ПерсДоступно = ?(СтруктураДокумента.Свойство("ПерсонализироватьФЛ") = Истина,СтруктураДокумента.ПерсонализироватьФЛ,Ложь);
		ДокументОбъект.Контрагент = БПК3_ПолучитьКонтрагента(ИБ,СтруктураДокумента.Контрагент,ПерсДоступно);
	КонецЕсли;
	
	Если ИБ.ЗначениеЗаполнено(ДокументОбъект.Контрагент)=Ложь Тогда
		Ответ.Результат = "Не найден контрагент "+СокрЛП(СтруктураДокумента.Контрагент)+" в бухгалтерской ИБ!";
		Возврат Ответ;
	КонецЕсли; 
	
	ДокументОбъект.РасшифровкаПлатежа.Очистить();
	нСтрока = ДокументОбъект.РасшифровкаПлатежа.Добавить();
	
	// Хахалин
	// Если в параметре "СтруктураДокумента" есть реквизит "УчетПоНомеруДоговора", то передадим его
	// в функцию поиска/создания договора. Если реквизит отсутствует, то передадим Ложь. Этот реквизит
	// говорит о том, что поиск договора контрагента должен выполняться по номеру договора, независимо
	// от того является контрагент физическим лицом или нет
	//-------------------------------------------------------------------------------------------------
	ДогНомерДоступно = ?(СтруктураДокумента.Свойство("УчетПоНомеруДоговора") = Истина,СтруктураДокумента.УчетПоНомеруДоговора,Ложь);
	
	СтруктураЭлемента = Новый Структура("Контрагент, Организация, ВидДоговора, НомерДоговора, ДатаДоговора, УИДДоговора");
	СтруктураЭлемента.Контрагент = ДокументОбъект.Контрагент;
	СтруктураЭлемента.Организация = ДокументОбъект.Организация;
	СтруктураЭлемента.ВидДоговора = ТекВидДоговора;
	СтруктураЭлемента.НомерДоговора = СтруктураДокумента.НомерДоговора;
	СтруктураЭлемента.ДатаДоговора = СтруктураДокумента.ДатаДоговора;
	СтруктураДокумента.Свойство("УИДДоговора", СтруктураЭлемента.УИДДоговора);
	
	нСтрока.ДоговорКонтрагента = БПК3_ПолучитьДоговорКонтрагента(ИБ,СтруктураЭлемента,ДокументОбъект.ПодразделениеОрганизации,ДогНомерДоступно);
	
	нСТрока.СпособПогашенияЗадолженности = ИБ.Перечисления.СпособыПогашенияЗадолженности.Автоматически;
	нСтрока.СуммаПлатежа = СтруктураДокумента.СуммаДокумента;
	нСтрока.КурсВзаиморасчетов = 1;
	нСтрока.СуммаВзаиморасчетов = СтруктураДокумента.СуммаДокумента;
	нСТрока.СуммаНДС = СуммаНДС;
	нСтрока.СтавкаНДС = СтавкаНДС;
	
	нСтрока.СтатьяДвиженияДенежныхСредств = ТекСтатьяДДС;
	
	// счета учета
	нСтрока.СчетУчетаРасчетовПоАвансам = ТекСчетРасчетовПоАвансам;
	нСтрока.СчетУчетаРасчетовСКонтрагентом = ТекСчетРасчетовПоКонтрагентам;
	
	ДокументОбъект.Ответственный = БПК3_ПолучитьПользователя(ИБ, СтруктураДокумента.Автор);
	
	ДокументОбъект.Выдать = СокрЛп(СтруктураДокумента.Выдать);
	ДокументОбъект.Основание = СокрЛп(СтруктураДокумента.Основание);
	ДокументОбъект.Приложение = СокрЛп(СтруктураДокумента.Приложение);
	ДокументОбъект.ПоДокументу = СокрЛп(СтруктураДокумента.ПоДокументу);
	
	ДокументОбъект.Комментарий = СтруктураДокумента.Комментарий;
	
	ДокументОбъект.УстановитьНовыйНомер();
	Попытка
		ДокументОбъект.Записать(ИБ.РежимЗаписиДокумента.Проведение);
		
		Ответ.НомерДокумента = СокрЛП(ДокументОбъект.Номер);
		Ответ.ИдентификаторДокумента = ИБ.XMLСтрока(ДокументОбъект.Ссылка);
		Ответ.Результат = "ОК";
	Исключение
		Попытка
			ДокументОбъект.ОбменДанными.Загрузка = Истина;
			РежимЗаписи = ИБ.РежимЗаписиДокумента.Запись;	
			ДокументОбъект.Записать(РежимЗаписи);
			
			Ответ.НомерДокумента = СокрЛП(ДокументОбъект.Номер);
			Ответ.ИдентификаторДокумента = ИБ.XMLСтрока(ДокументОбъект.Ссылка);
			Ответ.Результат = "ОК";
			
		Исключение	
			
			Ответ.НомерДокумента = Неопределено;
			Ответ.ИдентификаторДокумента = Неопределено;
			Ответ.Результат = "Ошибка проведения документа: "+ОписаниеОшибки();
		КонецПопытки;
	КонецПопытки;
	
	ИБ = Неопределено;
	
	Возврат Ответ;	
КонецФункции

Функция БПК3_СоздатьОплатуПлатежнойКартой(Организация,СтруктураДокумента,ЭтоВозврат=Ложь) Экспорт
	
	Ответ = Новый Структура("НомерДокумента, ИдентификаторДокумента, Результат");
	Ответ.НомерДокумента = Неопределено;
	Ответ.ИдентификаторДокумента = Неопределено;
	Ответ.Результат = Неопределено;
	
	Если Организация.ВыгружатьКассовыеДокументы=Ложь Тогда
		Возврат Ответ;		
	КонецЕсли; 
	
	ИБ = ПодключитьИнформационнуюБазу(Организация.ИнформационнаяБазаБухгалтерии);
	Если ИБ=Неопределено Тогда
		Ответ.Результат = "Ошибка подключения к бухгалтерской ИБ!";
		Возврат Ответ;
	КонецЕсли;
	
	ДокументОбъект = ИБ.Документы.ОплатаПлатежнойКартой.CreateDocument();
	
	ДокументОбъект.Дата = СтруктураДокумента.Дата;
	
	ДокументОбъект.Организация = ИБ.Справочники.Организации.НайтиПоРеквизиту("ИНН", Организация.ИНН);
	Если ИБ.ЗначениеЗаполнено(ДокументОбъект.Организация)=Ложь Тогда
		Ответ.Результат = "Не найдена организация "+СокрЛП(Организация)+" в бухгалтерской ИБ!";
		Возврат Ответ;
	КонецЕсли; 
	
	// Патент	
	//======================================================================================================================
	ПараметрыДеятельности = ИБ.УчетПСН.ДеятельностьНаПатентеПоУмолчанию(ДокументОбъект.Организация, ДокументОбъект.Дата);
	ИБ.ЗаполнитьЗначенияСвойств(ДокументОбъект, ПараметрыДеятельности);
	//======================================================================================================================
	
	ОбособленноеПодразделение = БПК3_ПолучитьОбособленноеПодразделение(ИБ, Организация, СтруктураДокумента.ТочкаОформления);
	Если ОбособленноеПодразделение<>Неопределено Тогда
		ДокументОбъект.ПодразделениеОрганизации = ОбособленноеПодразделение;
	КонецЕсли; 
	
	Если ИБ.УчетнаяПолитика.ПлательщикЕНВД(ДокументОбъект.Организация, ДокументОбъект.Дата) ИЛИ ИБ.УчетнаяПолитика.ПрименяетсяУСН(ДокументОбъект.Организация, ДокументОбъект.Дата) ИЛИ ИБ.УчетнаяПолитика.ПрименяетсяУСНПатент(ДокументОбъект.Организация, ДокументОбъект.Дата) Тогда
		СтавкаНДС = ИБ.Перечисления.СтавкиНДС.БезНДС;
		СуммаНДС = 0;
	Иначе
		СтруктураНДС = БПК3_ПолучитьАктуальнуюПолнуюСтавкуНДС(ИБ, ДокументОбъект.Дата);
		СтавкаНДС = СтруктураНДС.Ставка;
		СуммаНДС = Окр((СтруктураДокумента.СуммаДокумента*СтруктураНДС.Процент)/(100+СтруктураНДС.Процент),2,РежимОкругления.Окр15как10);
	КонецЕсли;	
	
	ДокументОбъект.ВалютаДокумента = ИБ.Константы.ВалютаРегламентированногоУчета.Получить();
	
	Если ЭтоВозврат Тогда
		ДокументОбъект.ВидОперации = ИБ.Перечисления.ВидыОперацийОплатаПлатежнойКартой.ВозвратПокупателю;
	Иначе
		ДокументОбъект.ВидОперации = ИБ.Перечисления.ВидыОперацийОплатаПлатежнойКартой.ОплатаПокупателя;
	КонецЕсли; 
	
	ДокументОбъект.СчетКасса = ИБ.ПланыСчетов.Хозрасчетный.ПродажиПоПлатежнымКартам;
	ДокументОбъект.СуммаДокумента = СтруктураДокумента.СуммаДокумента;
	
	// контрагент
	// Если в параметре "СтруктураДокумента" есть реквизит "ПерсонализироватьФЛ", то передадим его
	// в функцию поиска/создания контрагента. Если реквизит отсутствует, то передадим Ложь. Этот
	// реквизит влияет на персонализацию контрагентов - физических лиц (Истина - поиск/создание
	// выполняется по наименованию контрагента, Ложь - контрагент всегда "Частное лицо")
	
	ПерсДоступно = ?(СтруктураДокумента.Свойство("ПерсонализироватьФЛ") = Истина,СтруктураДокумента.ПерсонализироватьФЛ,Ложь);
	ДокументОбъект.Контрагент = БПК3_ПолучитьКонтрагента(ИБ,СтруктураДокумента.Контрагент,ПерсДоступно);
	
	Если ИБ.ЗначениеЗаполнено(ДокументОбъект.Контрагент)=Ложь Тогда
		Ответ.Результат = "Не найден контрагент "+СокрЛП(СтруктураДокумента.Контрагент)+" в бухгалтерской ИБ!";
		Возврат Ответ;
	КонецЕсли; 
	
	ИБ.ЗаполнениеДокументов.Заполнить(ДокументОбъект, Неопределено);
	
	ПараметрыУСН = ИБ.УчетУСН.СтруктураПараметровОбъектаДляУСН(ДокументОбъект);
	ИБ.НалоговыйУчетУСН.ЗаполнитьОтражениеДокументаВУСН(ДокументОбъект, ПараметрыУСН);
	
	ДокументОбъект.РасшифровкаПлатежа.Очистить();
	нСтрока = ДокументОбъект.РасшифровкаПлатежа.Добавить();
	
	СтруктураЭлемента = Новый Структура("Контрагент, Организация, ВидДоговора, НомерДоговора, ДатаДоговора, УИДДоговора");
	СтруктураЭлемента.Контрагент = ДокументОбъект.Контрагент;
	СтруктураЭлемента.Организация = ДокументОбъект.Организация;
	СтруктураЭлемента.ВидДоговора = ИБ.Перечисления.ВидыДоговоровКонтрагентов.СПокупателем;
	СтруктураЭлемента.НомерДоговора = СтруктураДокумента.НомерДоговора;
	СтруктураЭлемента.ДатаДоговора = СтруктураДокумента.ДатаДоговора;
	СтруктураДокумента.Свойство("УИДДоговора", СтруктураЭлемента.УИДДоговора);
	
	нСтрока.ДоговорКонтрагента = БПК3_ПолучитьДоговорКонтрагента(ИБ, СтруктураЭлемента, ДокументОбъект.ПодразделениеОрганизации);
	
	нСТрока.СпособПогашенияЗадолженности  = ИБ.Перечисления.СпособыПогашенияЗадолженности.Автоматически;
	нСтрока.СуммаПлатежа = СтруктураДокумента.СуммаДокумента;
	нСтрока.КурсВзаиморасчетов = 1;
	нСтрока.КратностьВзаиморасчетов = 1;
	нСтрока.СуммаПлатежа = СтруктураДокумента.СуммаДокумента;
	нСтрока.СуммаВзаиморасчетов = СтруктураДокумента.СуммаДокумента;
	нСТрока.СуммаНДС = СуммаНДС;
	нСтрока.СтавкаНДС = СтавкаНДС;
	
	// счета учета
	нСтрока.СчетУчетаРасчетовСКонтрагентом = ИБ.ПланыСчетов.Хозрасчетный.РасчетыСПокупателями;
	нСтрока.СчетУчетаРасчетовПоАвансам = ИБ.ПланыСчетов.Хозрасчетный.РасчетыПоАвансамПолученным;
	
	ДокументОбъект.Ответственный = БПК3_ПолучитьПользователя(ИБ, СтруктураДокумента.Автор);
	
	ДокументОбъект.Комментарий = СтруктураДокумента.Комментарий;
	
	// вид оплаты
	ВидОплаты = БПК3_ПолучитьВидОплаты(ИБ, Организация.ИНН, ОбособленноеПодразделение);
	Если ВидОплаты=Неопределено Тогда
		ДокументОбъект.ОбменДанными.Загрузка = Истина;
		РежимЗаписи = ИБ.РежимЗаписиДокумента.Запись;
	Иначе
		ДокументОбъект.ВидОплаты = ВидОплаты;
		ДокументОбъект.СчетКасса = ВидОплаты.СчетУчетаРасчетов;
		ДокументОбъект.Эквайер = ВидОплаты.Контрагент;
		ДокументОбъект.ДоговорЭквайринга = ВидОплаты.ДоговорКонтрагента;
		
		РежимЗаписи = ИБ.РежимЗаписиДокумента.Проведение;
	КонецЕсли; 
	
	ДокументОбъект.УстановитьНовыйНомер();
	Попытка
		ДокументОбъект.Записать(РежимЗаписи);
		
		Ответ.НомерДокумента = СокрЛП(ДокументОбъект.Номер);
		Ответ.ИдентификаторДокумента = ИБ.XMLСтрока(ДокументОбъект.Ссылка);
		Ответ.Результат = "ОК";
	Исключение
		Попытка
			ДокументОбъект.ОбменДанными.Загрузка = Истина;
			РежимЗаписи = ИБ.РежимЗаписиДокумента.Запись;	
			ДокументОбъект.Записать(РежимЗаписи);
			
			Ответ.НомерДокумента = СокрЛП(ДокументОбъект.Номер);
			Ответ.ИдентификаторДокумента = ИБ.XMLСтрока(ДокументОбъект.Ссылка);
			Ответ.Результат = "ОК";
			
		Исключение	
			Ответ.НомерДокумента = Неопределено;
			Ответ.ИдентификаторДокумента = Неопределено;
			Ответ.Результат = "Ошибка проведения документа: "+ОписаниеОшибки();
		КонецПопытки;
	КонецПопытки;
	
	ИБ = Неопределено;
	
	Возврат Ответ;	
КонецФункции

Функция БПК3_ПолучитьМассивБанковскихВыписок(Организация, ПараметрыОтбора, ПолучатьВсеВыписки=Истина) Экспорт 
	МассивБанковскихВыписок = Новый Массив;
	
	Если Организация.ЗагружатьБанковскиеВыписки=Ложь Тогда
		Возврат МассивБанковскихВыписок;		
	КонецЕсли; 
	
	ИБ = ПодключитьИнформационнуюБазу(Организация.ИнформационнаяБазаБухгалтерии);
	Если ИБ=Неопределено Тогда
		Сообщить("Ошибка подключения к бухгалтерской ИБ!");
		Возврат МассивБанковскихВыписок;
	КонецЕсли;
	
	// СписаниеСРасчетногоСчета - вид операции "Оплата поставщику"
	// ПоступлениеНаРасчетныйСчет - вид операции "Оплата от покупателя"
	Запрос = ИБ.NewObject("Запрос");
	Если ПараметрыОтбора.ЗагружатьСписания Тогда
		Запрос.Текст = Запрос.Текст+?(ПустаяСтрока(Запрос.Текст), "", " ОБЪЕДИНИТЬ ВСЕ ")+"
		|ВЫБРАТЬ 
		|	СчетОрганизации.НомерСчета КАК НомерСчета,
		|	ПРЕДСТАВЛЕНИЕ(СчетОрганизации.Банк) КАК Банк,
		|	НомерВходящегоДокумента,
		|	ДатаВходящегоДокумента,
		|	Контрагент.Наименование КАК КонтрагентНаименование,
		|	Контрагент.ИНН КАК КонтрагентИНН,
		|	Контрагент.КПП КАК КонтрагентКПП,
		|	СуммаДокумента,
		|	НазначениеПлатежа,
		|	ПРЕДСТАВЛЕНИЕ(Ссылка) КАК Документ,
		|	Ссылка,
		|	Дата КАК Дата,
		|	ПРЕДСТАВЛЕНИЕ(СтатьяДвиженияДенежныхСредств) КАК СтатьяДвиженияДенежныхСредств,
		|	ПРЕДСТАВЛЕНИЕ(ВидОперации) КАК ВидОперации,
		|	""Списание"" КАК ВидДвиженияДС,
		|	ПодразделениеОрганизации КАК ПодразделениеОрганизации,
		|	ДоговорКонтрагента.Номер КАК ДоговорНомер,
		|	ДоговорКонтрагента.Дата КАК ДоговорДата
		|ИЗ Документ.СписаниеСРасчетногоСчета
		|ГДЕ Дата МЕЖДУ НАЧАЛОПЕРИОДА(&начДата, ДЕНЬ) И КОНЕЦПЕРИОДА(&конДата, ДЕНЬ)
		|	И (ВидОперации=ЗНАЧЕНИЕ(Перечисление.ВидыОперацийСписаниеДенежныхСредств.ОплатаПоставщику) ИЛИ ВидОперации=ЗНАЧЕНИЕ(Перечисление.ВидыОперацийСписаниеДенежныхСредств.ВозвратПокупателю))
		|	И Организация.ИНН=&ИНН
		|";
	КонецЕсли;
	Если ПараметрыОтбора.ЗагружатьПоступления Тогда
		Запрос.Текст = Запрос.Текст+?(ПустаяСтрока(Запрос.Текст), "", " ОБЪЕДИНИТЬ ВСЕ ")+"
		|ВЫБРАТЬ 
		|	СчетОрганизации.НомерСчета КАК НомерСчета,
		|	ПРЕДСТАВЛЕНИЕ(СчетОрганизации.Банк) КАК Банк,
		|	НомерВходящегоДокумента,
		|	ДатаВходящегоДокумента,
		|	Контрагент.Наименование КАК КонтрагентНаименование,
		|	Контрагент.ИНН,
		|	Контрагент.КПП,
		|	СуммаДокумента,
		|	НазначениеПлатежа,
		|	ПРЕДСТАВЛЕНИЕ(Ссылка) КАК Документ,
		|	Ссылка,
		|	Дата КАК Дата,
		|	ПРЕДСТАВЛЕНИЕ(СтатьяДвиженияДенежныхСредств) КАК СтатьяДвиженияДенежныхСредств,
		|	ПРЕДСТАВЛЕНИЕ(Ссылка.ВидОперации) КАК ВидОперации,
		|	""Поступление"" КАК ВидДвиженияДС,
		|	ПодразделениеОрганизации КАК ПодразделениеОрганизации,
		|	ДоговорКонтрагента.Номер КАК ДоговорНомер,
		|	ДоговорКонтрагента.Дата КАК ДоговорДата
		|ИЗ Документ.ПоступлениеНаРасчетныйСчет
		|ГДЕ Дата МЕЖДУ НАЧАЛОПЕРИОДА(&начДата, ДЕНЬ) И КОНЕЦПЕРИОДА(&конДата, ДЕНЬ)
		|	И (ВидОперации=ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоступлениеДенежныхСредств.ОплатаПокупателя) ИЛИ ВидОперации=ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоступлениеДенежныхСредств.ВозвратОтПоставщика))	
		|	И Организация.ИНН=&ИНН
		|";
	КонецЕсли;
	
	Если ПустаяСтрока(Запрос.Текст) Тогда
		Возврат МассивБанковскихВыписок;		
	КонецЕсли; 
	
	Запрос.УстановитьПараметр("начДата", ПараметрыОтбора.начДата);		
	Запрос.УстановитьПараметр("конДата", ПараметрыОтбора.конДата);		
	Запрос.УстановитьПараметр("ИНН", СокрЛП(Организация.ИНН));		
	
	Если ЗначениеЗаполнено(ПараметрыОтбора.БанковскийСчет) Тогда
		Запрос.Текст = Запрос.Текст+"
		|	И СчетОрганизации.НомерСчета=&НомерСчета";
		Запрос.УстановитьПараметр("НомерСчета", ПараметрыОтбора.БанковскийСчет.РасчСчет);		
	КонецЕсли;
	Если ПараметрыОтбора.МассивКонтрагентов.Количество()>0 Тогда
		Запрос.Текст = Запрос.Текст+"
		|	И Контрагент.ИНН В (&МассивИНН)
		|	И НЕ Контрагент.ИНН=""""";
		
		МассивИНН = ИБ.NewObject("Массив");
		Для каждого текЭлемент Из ПараметрыОтбора.МассивКонтрагентов Цикл
			Если ЗначениеЗаполнено(текЭлемент.ИНН) Тогда
				МассивИНН.Добавить(СокрЛП(текЭлемент.ИНН));
			КонецЕсли; 
		КонецЦикла; 
		Запрос.УстановитьПараметр("МассивИНН", МассивИНН);		
	КонецЕсли; 
	
	МассивИдентификаторов = Новый Массив;
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		нСтрока = Новый Структура("Дата, Банк, НомерСчета, ВидДвиженияДС, ИдентификаторДокумента, НомерВходящегоДокумента, ДатаВходящегоДокумента, НазначениеПлатежа, СуммаДокумента, КонтрагентКПП, КонтрагентНаименование, КонтрагентИНН, Документ, СтатьяДвиженияДенежныхСредств, ВидОперации, ДоговорНомер, ДоговорДата");	
		
		ЗаполнитьЗначенияСвойств(нСтрока, Выборка);
		нСтрока.ИдентификаторДокумента = ИБ.XMLСтрока(Выборка.Ссылка);
		
		МассивИдентификаторов.Добавить(нСтрока.ИдентификаторДокумента);
		МассивБанковскихВыписок.Добавить(нСтрока);
	КонецЦикла;
	
	Если ПолучатьВсеВыписки=Ложь И МассивИдентификаторов.Количество()>0 Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Выписка.ВнешнийИдентификатор
		|ИЗ
		|	Документ.ДвижениеПоРасчетномуСчету КАК Выписка
		|ГДЕ
		|	Выписка.ВнешнийИдентификатор В(&МассивИдентификаторов)";
		Запрос.УстановитьПараметр("МассивИдентификаторов", МассивИдентификаторов);
		РезультатЗапроса = Запрос.Выполнить();
		
		НайденныеИдентификаторы = РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("ВнешнийИдентификатор");
		
		РезультирующийМассив = Новый Массив;
		Для каждого текСтрока Из МассивБанковскихВыписок Цикл
			Если НайденныеИдентификаторы.Найти(текСтрока.ИдентификаторДокумента)=Неопределено Тогда
				РезультирующийМассив.Добавить(текСтрока);
			КонецЕсли; 
		КонецЦикла; 
	Иначе
		РезультирующийМассив = МассивБанковскихВыписок;		
	КонецЕсли; 
	
	Возврат РезультирующийМассив;
КонецФункции

Функция БПК3_ОтменитьДокумент(Организация, Идентификатор, ТипДокумента) Экспорт
	Результат = "ОК";
	
	Если (ЗначениеЗаполнено(Идентификатор)=Ложь) 
		ИЛИ (ЗначениеЗаполнено(Организация.ИнформационнаяБазаБухгалтерии)=Ложь) 
		ИЛИ (Организация.ВыгружатьКассовыеДокументы=Ложь) Тогда
		
		Возврат Результат;
	КонецЕсли; 
	
	ИБ = ПодключитьИнформационнуюБазу(Организация.ИнформационнаяБазаБухгалтерии);
	Если ИБ=Неопределено Тогда
		Результат = "Ошибка подключения к бухгалтерской ИБ!";
		Возврат Результат;
	КонецЕсли;
	
	Если ИБ.Метаданные.Документы.Найти(СокрЛП(ТипДокумента))=Неопределено Тогда
		Результат = "Ошибочный тип документа "+СокрЛП(ТипДокумента);
		Возврат Результат;
	КонецЕсли; 
	
	ид = ИБ.NewObject("УникальныйИдентификатор", СокрЛП(Идентификатор));
	ДокументСсылка = ИБ.Документы[СокрЛП(ТипДокумента)].ПолучитьСсылку(ид);
	ДокументОбъект = ДокументСсылка.ПолучитьОбъект();
	Если ДокументОбъект=Неопределено Тогда
		Результат = "Не найден документ "+СокрЛП(ТипДокумента)+" по ид "+СокрЛП(Идентификатор);
		Возврат Результат;
	КонецЕсли; 
	
	// добавим букву У к префиксу
	СтрокаЧисел = "0123456789";
	Префикс = "";
	ЧисловаяЧасть = "";
	ЭтоПрефикс = Ложь;
	
	сч = СтрДлина(ДокументОбъект.Номер);
	Пока сч>0 Цикл
		Символ = Сред(ДокументОбъект.Номер, сч, 1);
		Если ЭтоПрефикс=Ложь И СтрНайти(СтрокаЧисел, Символ)=0 Тогда
			ЭтоПрефикс=Истина;
		КонецЕсли; 
		
		Если ЭтоПрефикс Тогда
			Префикс = Символ+Префикс;
		Иначе
			ЧисловаяЧасть = Символ+ЧисловаяЧасть;			
		КонецЕсли;
		
		сч = сч-1;
	КонецЦикла; 
	
	Префикс = "У"+Префикс;
	
	ДокументОбъект.Номер = Префикс+Сред(ЧисловаяЧасть, 2);
	Попытка
		ДокументОбъект.Записать(ИБ.РежимЗаписиДокумента.ОтменаПроведения);
		ДокументОбъект.УстановитьПометкуУдаления(Истина);
	Исключение
		Результат = "Ошибка записи документа: "+ОписаниеОшибки();
	КонецПопытки;
	
	Возврат Результат;	
КонецФункции

Функция БПК3_ЗагрузитьДанныеФинансовыйРезультат(Организация, Знач НачалоПериода, Знач ОкончаниеПериода) Экспорт
	Результат = "";
	
	Доступно = (ТипЗнч(Организация)=Тип("СправочникСсылка.Контрагенты"));
	Доступно = Доступно И (ЗначениеЗаполнено(Организация.ИнформационнаяБазаБухгалтерии)=Истина);
	Доступно = Доступно И (ЗначениеЗаполнено(НачалоПериода)=Истина);
	Доступно = Доступно И (ЗначениеЗаполнено(ОкончаниеПериода)=Истина);
	Доступно = Доступно И (НачалоПериода<=ОкончаниеПериода);
	
	Если Доступно=Ложь Тогда
		Возврат Результат;		
	КонецЕсли; 
	
	НачалоПериода = НачалоМесяца(НачалоПериода);
	ОкончаниеПериода = КонецМесяца(ОкончаниеПериода);
	
	ИБ = ПодключитьИнформационнуюБазу(Организация.ИнформационнаяБазаБухгалтерии);
	Если ИБ=Неопределено Тогда
		Результат = "Ошибка подключения к бухгалтерской ИБ!";
		Возврат Результат;
	КонецЕсли;
	
	ОтборПодразделений = ИБ.NewObject("Массив");
	ОтборСтатейДДС = ИБ.NewObject("Массив");
	
	СоответствиеПодразделений = Новый Соответствие;
	СоответствиеСтатейБюджета = Новый Соответствие;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СоответствиеПодразделений.ПодразделениеИдентификатор КАК ПодразделениеИдентификатор,
	|	СоответствиеПодразделений.ТочкаОформления КАК ТочкаОформления
	|ИЗ
	|	РегистрСведений.СоответствиеПодразделений КАК СоответствиеПодразделений
	|ГДЕ
	|	СоответствиеПодразделений.Организация = &Организация";
	Запрос.УстановитьПараметр("Организация", Организация);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		СоответствиеПодразделений.Вставить(Выборка.ПодразделениеИдентификатор, Выборка.ТочкаОформления);
		
		ид = ИБ.NewObject("УникальныйИдентификатор", СокрЛП(Выборка.ПодразделениеИдентификатор));
		Спр = ИБ.Справочники.ПодразделенияОрганизаций.ПолучитьСсылку(ид);
		СпрОбъект = Спр.ПолучитьОбъект();
		Если СпрОбъект<>Неопределено Тогда
			ОтборПодразделений.Добавить(Спр);
		КонецЕсли;
	КонецЦикла;  
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СоответствиеСтатейБюджета.СтатьяИдентификатор КАК СтатьяИдентификатор,
	|	СоответствиеСтатейБюджета.СтатьяБюджета КАК СтатьяБюджета
	|ИЗ
	|	РегистрСведений.СоответствиеСтатейБюджета КАК СоответствиеСтатейБюджета
	|ГДЕ
	|	СоответствиеСтатейБюджета.Организация = &Организация";
	Запрос.УстановитьПараметр("Организация", Организация);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		СоответствиеСтатейБюджета.Вставить(Выборка.СтатьяИдентификатор, Выборка.СтатьяБюджета);
		
		ид = ИБ.NewObject("УникальныйИдентификатор", СокрЛП(Выборка.СтатьяИдентификатор));
		Спр = ИБ.Справочники.СтатьиДвиженияДенежныхСредств.ПолучитьСсылку(ид);
		СпрОбъект = Спр.ПолучитьОбъект();
		Если СпрОбъект<>Неопределено Тогда
			ОтборСтатейДДС.Добавить(Спр);
		КонецЕсли;
	КонецЦикла;  
	
	Данные = Новый ТаблицаЗначений;
	
	Данные.Колонки.Добавить("ПериодМесяц");
	Данные.Колонки.Добавить("СтатьяБюджета");
	Данные.Колонки.Добавить("Организация");
	Данные.Колонки.Добавить("ТочкаОформления");
	
	Данные.Колонки.Добавить("ДокументИдентификатор");
	Данные.Колонки.Добавить("ДокументПредставление");
	Данные.Колонки.Добавить("ДокументНомер");
	Данные.Колонки.Добавить("ДокументДата");
	
	Данные.Колонки.Добавить("Показатель");
	
	Данные.Колонки.Добавить("ВидДвижения");
	
	// Банк	
	//====================================================================================================================== 	
	Запрос=ИБ.NewObject("Запрос");
	
	Запрос.Текст="ВЫБРАТЬ
	|		ПоступлениеНаРасчетныйСчетРасшифровкаПлатежа.Ссылка КАК Ссылка,
	|		ПоступлениеНаРасчетныйСчетРасшифровкаПлатежа.Ссылка.НомерВходящегоДокумента КАК НомерВходящегоДокумента,
	|		ПоступлениеНаРасчетныйСчетРасшифровкаПлатежа.Ссылка.ДатаВходящегоДокумента КАК ДатаВходящегоДокумента,
	|		ПоступлениеНаРасчетныйСчетРасшифровкаПлатежа.НомерСтроки КАК НомерСтроки,
	|		ПоступлениеНаРасчетныйСчетРасшифровкаПлатежа.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|		ПоступлениеНаРасчетныйСчетРасшифровкаПлатежа.СуммаПлатежа КАК СуммаПлатежа,
	|		ПоступлениеНаРасчетныйСчетРасшифровкаПлатежа.СтатьяДвиженияДенежныхСредств КАК СтатьяДвиженияДенежныхСредств,
	|		ПРЕДСТАВЛЕНИЕ(ПоступлениеНаРасчетныйСчетРасшифровкаПлатежа.Ссылка) КАК ДокументОснование,
	|		ПРЕДСТАВЛЕНИЕ(ПоступлениеНаРасчетныйСчетРасшифровкаПлатежа.СчетНаОплату) КАК СчетНаОплату,
	|		ИСТИНА КАК Приход
	|ПОМЕСТИТЬ Поступление_Строки
	|	ИЗ
	|		Документ.ПоступлениеНаРасчетныйСчет.РасшифровкаПлатежа КАК ПоступлениеНаРасчетныйСчетРасшифровкаПлатежа
	|	ГДЕ
	|		ПоступлениеНаРасчетныйСчетРасшифровкаПлатежа.Ссылка.Организация.ИНН = &ИНН
	|		И ПоступлениеНаРасчетныйСчетРасшифровкаПлатежа.Ссылка.Дата МЕЖДУ &начДата И &конДата
	|		И Ссылка.ВидОперации В (&ПоступлениеРасшифровкаПлатежа)
	|;
	|
	|ВЫБРАТЬ
	|		СписаниеСРасчетногоСчетаРасшифровкаПлатежа.Ссылка,
	|		СписаниеСРасчетногоСчетаРасшифровкаПлатежа.Ссылка.НомерВходящегоДокумента КАК НомерВходящегоДокумента,
	|		СписаниеСРасчетногоСчетаРасшифровкаПлатежа.Ссылка.ДатаВходящегоДокумента КАК ДатаВходящегоДокумента,
	|		СписаниеСРасчетногоСчетаРасшифровкаПлатежа.НомерСтроки,
	|		СписаниеСРасчетногоСчетаРасшифровкаПлатежа.ДоговорКонтрагента,
	|		СписаниеСРасчетногоСчетаРасшифровкаПлатежа.СуммаПлатежа,
	|		СписаниеСРасчетногоСчетаРасшифровкаПлатежа.СтатьяДвиженияДенежныхСредств,
	|		ПРЕДСТАВЛЕНИЕ(СписаниеСРасчетногоСчетаРасшифровкаПлатежа.Ссылка),
	|		"""",
	|		ЛОЖЬ
	|ПОМЕСТИТЬ Списание_Строки
	|	ИЗ
	|		Документ.СписаниеСРасчетногоСчета.РасшифровкаПлатежа КАК СписаниеСРасчетногоСчетаРасшифровкаПлатежа
	|	ГДЕ
	|		СписаниеСРасчетногоСчетаРасшифровкаПлатежа.Ссылка.Организация.ИНН = &ИНН
	|		И СписаниеСРасчетногоСчетаРасшифровкаПлатежа.Ссылка.Дата МЕЖДУ &начДата И &конДата
	|		И Ссылка.ВидОперации В (&СписаниеРасшифровкаПлатежа)
	|		
	|;
	|ВЫБРАТЬ
	|		ПоступлениеНаРасчетныйСчетРасшифровкаПлатежа.Ссылка КАК Ссылка,
	|		ПоступлениеНаРасчетныйСчетРасшифровкаПлатежа.НомерВходящегоДокумента КАК НомерВходящегоДокумента,
	|		ПоступлениеНаРасчетныйСчетРасшифровкаПлатежа.ДатаВходящегоДокумента КАК ДатаВходящегоДокумента,
	|		1 КАК НомерСтроки,
	|		ПоступлениеНаРасчетныйСчетРасшифровкаПлатежа.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|		ПоступлениеНаРасчетныйСчетРасшифровкаПлатежа.СуммаДокумента КАК СуммаПлатежа,
	|		ПоступлениеНаРасчетныйСчетРасшифровкаПлатежа.СтатьяДвиженияДенежныхСредств КАК СтатьяДвиженияДенежныхСредств,
	|		ПРЕДСТАВЛЕНИЕ(ПоступлениеНаРасчетныйСчетРасшифровкаПлатежа.Ссылка) КАК ДокументОснование,
	|		"""" КАК СчетНаОплату,
	|		ИСТИНА КАК Приход
	|ПОМЕСТИТЬ Поступление
	|	ИЗ
	|		Документ.ПоступлениеНаРасчетныйСчет КАК ПоступлениеНаРасчетныйСчетРасшифровкаПлатежа
	|	ГДЕ
	|		ПоступлениеНаРасчетныйСчетРасшифровкаПлатежа.Ссылка.Организация.ИНН = &ИНН
	|		И ПоступлениеНаРасчетныйСчетРасшифровкаПлатежа.Ссылка.Дата МЕЖДУ &начДата И &конДата
	|		И НЕ Ссылка В (ВЫБРАТЬ Ссылка ИЗ Поступление_Строки)
	|
	|;
	|ВЫБРАТЬ
	|		СписаниеСРасчетногоСчетаРасшифровкаПлатежа.Ссылка,
	|		СписаниеСРасчетногоСчетаРасшифровкаПлатежа.НомерВходящегоДокумента КАК НомерВходящегоДокумента,
	|		СписаниеСРасчетногоСчетаРасшифровкаПлатежа.ДатаВходящегоДокумента КАК ДатаВходящегоДокумента,
	|		1,
	|		СписаниеСРасчетногоСчетаРасшифровкаПлатежа.ДоговорКонтрагента,
	|		СписаниеСРасчетногоСчетаРасшифровкаПлатежа.СуммаДокумента,
	|		СписаниеСРасчетногоСчетаРасшифровкаПлатежа.СтатьяДвиженияДенежныхСредств,
	|		ПРЕДСТАВЛЕНИЕ(СписаниеСРасчетногоСчетаРасшифровкаПлатежа.Ссылка),
	|		"""",
	|		ЛОЖЬ
	|ПОМЕСТИТЬ Списание
	|	ИЗ
	|		Документ.СписаниеСРасчетногоСчета КАК СписаниеСРасчетногоСчетаРасшифровкаПлатежа
	|	ГДЕ
	|		СписаниеСРасчетногоСчетаРасшифровкаПлатежа.Ссылка.Организация.ИНН = &ИНН
	|		И СписаниеСРасчетногоСчетаРасшифровкаПлатежа.Ссылка.Дата МЕЖДУ &начДата И &конДата
	|		И НЕ Ссылка В (ВЫБРАТЬ Ссылка ИЗ Списание_Строки)
	|
	|;			
	|ВЫБРАТЬ
	|	Данные.Ссылка,
	|	Данные.Ссылка.Номер КАК Номер,
	|	Данные.Ссылка.Дата КАК Дата,
	|	Данные.Ссылка.ПометкаУдаления КАК ПометкаУдаления,
	|	Данные.НомерВходящегоДокумента КАК НомерВходящегоДокумента,
	|	Данные.ДатаВходящегоДокумента КАК ДатаВходящегоДокумента,
	|	Данные.НомерСтроки,
	|	Данные.ДоговорКонтрагента,
	|	Данные.СуммаПлатежа,
	|	Данные.СтатьяДвиженияДенежныхСредств,
	|	Данные.ДокументОснование,
	|	Данные.СчетНаОплату,
	|	Данные.Приход,
	|	Данные.Ссылка.ПодразделениеОрганизации КАК Подразделение
	|ИЗ
	|	(ВЫБРАТЬ * ИЗ Поступление_Строки
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ * ИЗ Списание_Строки
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ * ИЗ Поступление
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ * ИЗ Списание
	|	) КАК Данные
	|
	|ГДЕ Данные.Ссылка.Проведен=ИСТИНА
	|	И Данные.Ссылка.ПодразделениеОрганизации В (&ОтборПодразделений)
	|	И Данные.Ссылка.СтатьяДвиженияДенежныхСредств В (&ОтборСтатейДДС)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Данные.Ссылка.Дата
	|";	
	
	Запрос.УстановитьПараметр("ИНН", Организация.ИНН);
	Запрос.УстановитьПараметр("начДата", НачалоДня(НачалоПериода));
	Запрос.УстановитьПараметр("конДата", КонецДня(ОкончаниеПериода));
	
	Запрос.УстановитьПараметр("ПоступлениеРасшифровкаПлатежа", ИБ.Документы.ПоступлениеНаРасчетныйСчет.ПолучитьСписокВидовОперацийСРасшифровкойПлатежа());
	Запрос.УстановитьПараметр("СписаниеРасшифровкаПлатежа", ИБ.Документы.СписаниеСРасчетногоСчета.ПолучитьСписокВидовОперацийСРасшифровкойПлатежа());
	
	Запрос.УстановитьПараметр("ОтборПодразделений", ОтборПодразделений);
	Запрос.УстановитьПараметр("ОтборСтатейДДС", ОтборСтатейДДС);
	
	Выборка=Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ТочкаОформления = СоответствиеПодразделений.Получить(ИБ.XMLСтрока(Выборка.Подразделение));
		СтатьяБюджета = СоответствиеСтатейБюджета.Получить(ИБ.XMLСтрока(Выборка.СтатьяДвиженияДенежныхСредств));
		
		Если (ЗначениеЗаполнено(ТочкаОформления)=Ложь) ИЛИ (ЗначениеЗаполнено(СтатьяБюджета)=Ложь) Тогда
			Продолжить;			
		КонецЕсли; 
		
		НоваяСтрока = Данные.Добавить();
		
		НоваяСтрока.ПериодМесяц = НачалоМесяца(Выборка.Дата);
		НоваяСтрока.СтатьяБюджета = СтатьяБюджета;
		НоваяСтрока.Организация = Организация;
		НоваяСтрока.ТочкаОформления = ТочкаОформления;
		
		НоваяСтрока.ДокументИдентификатор = ИБ.XMLСтрока(Выборка.Ссылка)+?(Выборка.НомерСтроки=1,"","_"+ИБ.XMLСтрока(Выборка.НомерСтроки));
		НоваяСтрока.ДокументПредставление = Выборка.ДокументОснование;
		НоваяСтрока.ДокументНомер = Выборка.НомерВходящегоДокумента;
		НоваяСтрока.ДокументДата = Выборка.ДатаВходящегоДокумента;
		
		НоваяСтрока.Показатель = Выборка.СуммаПлатежа;
		
		НоваяСтрока.ВидДвижения = Выборка.Приход;
	КонецЦикла;
	
	// Касса
	//====================================================================================================================== 
	Запрос=ИБ.NewObject("Запрос");
	
	Запрос.Текст="ВЫБРАТЬ
	|		ПриходныйКассовыйОрдерРасшифровкаПлатежа.Ссылка КАК Ссылка,
	|		ПРЕДСТАВЛЕНИЕ(ПриходныйКассовыйОрдерРасшифровкаПлатежа.Ссылка) КАК СсылкаПредставление,
	|		ПриходныйКассовыйОрдерРасшифровкаПлатежа.Ссылка.Организация КАК Организация,
	|		ПриходныйКассовыйОрдерРасшифровкаПлатежа.Ссылка.ВидОперации КАК ВидОперации,
	|		ПриходныйКассовыйОрдерРасшифровкаПлатежа.Ссылка.Контрагент КАК Контрагент,
	|		ПриходныйКассовыйОрдерРасшифровкаПлатежа.Ссылка.Комментарий КАК Комментарий,
	|		ПриходныйКассовыйОрдерРасшифровкаПлатежа.Ссылка.ДокументОснование КАК ДокументОснование,
	|		ПриходныйКассовыйОрдерРасшифровкаПлатежа.Ссылка.СубконтоКт1 КАК Субконто1,
	|		ПриходныйКассовыйОрдерРасшифровкаПлатежа.Ссылка.СубконтоКт2 КАК Субконто2,
	|		ПриходныйКассовыйОрдерРасшифровкаПлатежа.Ссылка.СубконтоКт3 КАК Субконто3,
	|		ПриходныйКассовыйОрдерРасшифровкаПлатежа.НомерСтроки КАК НомерСтроки,
	|		ПриходныйКассовыйОрдерРасшифровкаПлатежа.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|		ПриходныйКассовыйОрдерРасшифровкаПлатежа.СуммаПлатежа КАК СуммаПлатежа,
	|		ПриходныйКассовыйОрдерРасшифровкаПлатежа.СтатьяДвиженияДенежныхСредств КАК СтатьяДвиженияДенежныхСредств,
	|		ПриходныйКассовыйОрдерРасшифровкаПлатежа.СчетНаОплату КАК СчетНаОплату,
	|		ИСТИНА КАК Приход
	|ПОМЕСТИТЬ ПКО_Строки
	|	ИЗ
	|		Документ.ПриходныйКассовыйОрдер.РасшифровкаПлатежа КАК ПриходныйКассовыйОрдерРасшифровкаПлатежа
	|	ГДЕ
	|		ПриходныйКассовыйОрдерРасшифровкаПлатежа.Ссылка.Проведен = ИСТИНА
	|		И ПриходныйКассовыйОрдерРасшифровкаПлатежа.Ссылка.Организация.ИНН = &ИНН
	|		И ПриходныйКассовыйОрдерРасшифровкаПлатежа.Ссылка.Дата МЕЖДУ &начДата И &конДата
	|		И Ссылка.ВидОперации В (&ПоступлениеРасшифровкаПлатежа)
	|;
	|
	|ВЫБРАТЬ
	|		РасходныйКассовыйОрдерРасшифровкаПлатежа.Ссылка,
	|		ПРЕДСТАВЛЕНИЕ(РасходныйКассовыйОрдерРасшифровкаПлатежа.Ссылка) КАК СсылкаПредставление,
	|		РасходныйКассовыйОрдерРасшифровкаПлатежа.Ссылка.Организация,
	|		РасходныйКассовыйОрдерРасшифровкаПлатежа.Ссылка.ВидОперации,
	|		РасходныйКассовыйОрдерРасшифровкаПлатежа.Ссылка.Контрагент,
	|		РасходныйКассовыйОрдерРасшифровкаПлатежа.Ссылка.Комментарий,
	|		РасходныйКассовыйОрдерРасшифровкаПлатежа.Ссылка.ДокументОснование,
	|		РасходныйКассовыйОрдерРасшифровкаПлатежа.Ссылка.СубконтоДт1,
	|		РасходныйКассовыйОрдерРасшифровкаПлатежа.Ссылка.СубконтоДт2,
	|		РасходныйКассовыйОрдерРасшифровкаПлатежа.Ссылка.СубконтоДт3,
	|		РасходныйКассовыйОрдерРасшифровкаПлатежа.НомерСтроки,
	|		РасходныйКассовыйОрдерРасшифровкаПлатежа.ДоговорКонтрагента,
	|		РасходныйКассовыйОрдерРасшифровкаПлатежа.СуммаПлатежа,
	|		РасходныйКассовыйОрдерРасшифровкаПлатежа.СтатьяДвиженияДенежныхСредств,
	|		"""" ,
	|		ЛОЖЬ КАК Приход
	|ПОМЕСТИТЬ РКО_Строки
	|	ИЗ
	|		Документ.РасходныйКассовыйОрдер.РасшифровкаПлатежа КАК РасходныйКассовыйОрдерРасшифровкаПлатежа
	|	ГДЕ
	|		РасходныйКассовыйОрдерРасшифровкаПлатежа.Ссылка.Проведен = ИСТИНА
	|		И РасходныйКассовыйОрдерРасшифровкаПлатежа.Ссылка.Организация.ИНН = &ИНН
	|		И РасходныйКассовыйОрдерРасшифровкаПлатежа.Ссылка.Дата МЕЖДУ &начДата И &конДата
	|		И Ссылка.ВидОперации В (&СписаниеРасшифровкаПлатежа)
	|		
	|;
	|ВЫБРАТЬ
	|		РасходныйКассовыйОрдерРасшифровкаПлатежа.Ссылка,
	|		ПРЕДСТАВЛЕНИЕ(РасходныйКассовыйОрдерРасшифровкаПлатежа.Ссылка) КАК СсылкаПредставление,
	|		РасходныйКассовыйОрдерРасшифровкаПлатежа.Организация,
	|		РасходныйКассовыйОрдерРасшифровкаПлатежа.ВидОперации,
	|		РасходныйКассовыйОрдерРасшифровкаПлатежа.Контрагент,
	|		РасходныйКассовыйОрдерРасшифровкаПлатежа.Комментарий,
	|		РасходныйКассовыйОрдерРасшифровкаПлатежа.ДокументОснование,
	|		РасходныйКассовыйОрдерРасшифровкаПлатежа.СубконтоДт1,
	|		РасходныйКассовыйОрдерРасшифровкаПлатежа.СубконтоДт2,
	|		РасходныйКассовыйОрдерРасшифровкаПлатежа.СубконтоДт3,
	|		1 КАК НомерСтроки,
	|		РасходныйКассовыйОрдерРасшифровкаПлатежа.ДоговорКонтрагента,
	|		РасходныйКассовыйОрдерРасшифровкаПлатежа.СуммаДокумента,
	|		РасходныйКассовыйОрдерРасшифровкаПлатежа.СтатьяДвиженияДенежныхСредств,
	|		"""" ,
	|		ЛОЖЬ КАК Приход
	|ПОМЕСТИТЬ РКО
	|	ИЗ
	|		Документ.РасходныйКассовыйОрдер КАК РасходныйКассовыйОрдерРасшифровкаПлатежа
	|	ГДЕ
	|		РасходныйКассовыйОрдерРасшифровкаПлатежа.Проведен = ИСТИНА
	|		И РасходныйКассовыйОрдерРасшифровкаПлатежа.Организация.ИНН = &ИНН
	|		И РасходныйКассовыйОрдерРасшифровкаПлатежа.Дата МЕЖДУ &начДата И &конДата
	|		И НЕ Ссылка В (ВЫБРАТЬ Ссылка ИЗ РКО_Строки)
	|
	|;
	|ВЫБРАТЬ
	|		ПриходныйКассовыйОрдерРасшифровкаПлатежа.Ссылка КАК Ссылка,
	|		ПРЕДСТАВЛЕНИЕ(ПриходныйКассовыйОрдерРасшифровкаПлатежа.Ссылка) КАК СсылкаПредставление,
	|		ПриходныйКассовыйОрдерРасшифровкаПлатежа.Организация КАК Организация,
	|		ПриходныйКассовыйОрдерРасшифровкаПлатежа.ВидОперации КАК ВидОперации,
	|		ПриходныйКассовыйОрдерРасшифровкаПлатежа.Контрагент КАК Контрагент,
	|		ПриходныйКассовыйОрдерРасшифровкаПлатежа.Комментарий КАК Комментарий,
	|		ПриходныйКассовыйОрдерРасшифровкаПлатежа.ДокументОснование КАК ДокументОснование,
	|		ПриходныйКассовыйОрдерРасшифровкаПлатежа.СубконтоКт1 КАК Субконто1,
	|		ПриходныйКассовыйОрдерРасшифровкаПлатежа.СубконтоКт2 КАК Субконто2,
	|		ПриходныйКассовыйОрдерРасшифровкаПлатежа.СубконтоКт3 КАК Субконто3,
	|		1 КАК НомерСтроки,
	|		ПриходныйКассовыйОрдерРасшифровкаПлатежа.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|		ПриходныйКассовыйОрдерРасшифровкаПлатежа.СуммаДокумента КАК СуммаПлатежа,
	|		ПриходныйКассовыйОрдерРасшифровкаПлатежа.СтатьяДвиженияДенежныхСредств КАК СтатьяДвиженияДенежныхСредств,
	|		"""" КАК СчетНаОплату,
	|		ИСТИНА КАК Приход
	|ПОМЕСТИТЬ ПКО
	|	ИЗ
	|		Документ.ПриходныйКассовыйОрдер КАК ПриходныйКассовыйОрдерРасшифровкаПлатежа
	|	ГДЕ
	|		ПриходныйКассовыйОрдерРасшифровкаПлатежа.Проведен = ИСТИНА
	|		И ПриходныйКассовыйОрдерРасшифровкаПлатежа.Организация.ИНН = &ИНН
	|		И ПриходныйКассовыйОрдерРасшифровкаПлатежа.Дата МЕЖДУ &начДата И &конДата
	|		И НЕ Ссылка В (ВЫБРАТЬ Ссылка ИЗ ПКО_Строки)
	|
	|;			
	|ВЫБРАТЬ
	|	Данные.Ссылка,
	|	Данные.Ссылка.Номер КАК Номер,
	|	Данные.Ссылка.Дата КАК Дата,
	|	Данные.Ссылка.ПометкаУдаления КАК ПометкаУдаления,
	|	Данные.Организация,
	|	Данные.ВидОперации,
	|	Данные.Контрагент,
	|	Данные.Комментарий,
	|	Данные.ДокументОснование,
	|	Данные.Субконто1,
	|	Данные.Субконто2,
	|	Данные.Субконто3,
	|	Данные.СтатьяДвиженияДенежныхСредств,
	|	Данные.НомерСтроки,
	|	Данные.ДоговорКонтрагента,
	|	Данные.СуммаПлатежа,
	|	Данные.СчетНаОплату,
	|	Данные.Приход,
	|	Данные.СсылкаПредставление,
	|	Данные.Ссылка.ПодразделениеОрганизации КАК Подразделение
	|ИЗ
	|	(ВЫБРАТЬ * ИЗ ПКО_Строки
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ * ИЗ РКО_Строки
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ * ИЗ РКО
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ * ИЗ ПКО
	|	) КАК Данные
	|
	|ГДЕ Данные.Ссылка.Проведен=ИСТИНА
	|	И Данные.Ссылка.ПодразделениеОрганизации В (&ОтборПодразделений)
	|	И Данные.Ссылка.СтатьяДвиженияДенежныхСредств В (&ОтборСтатейДДС)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Данные.Ссылка.Дата
	|";	
	
	Запрос.УстановитьПараметр("ИНН", Организация.ИНН);
	Запрос.УстановитьПараметр("начДата", НачалоДня(НачалоПериода));
	Запрос.УстановитьПараметр("конДата", КонецДня(ОкончаниеПериода));
	
	Запрос.УстановитьПараметр("ПоступлениеРасшифровкаПлатежа", ИБ.Документы.ПриходныйКассовыйОрдер.ПолучитьСписокВидовОперацийСРасшифровкойПлатежа());
	Запрос.УстановитьПараметр("СписаниеРасшифровкаПлатежа", ИБ.Документы.РасходныйКассовыйОрдер.ПолучитьСписокВидовОперацийСРасшифровкойПлатежа());
	
	Запрос.УстановитьПараметр("ОтборПодразделений", ОтборПодразделений);
	Запрос.УстановитьПараметр("ОтборСтатейДДС", ОтборСтатейДДС);
	
	Выборка=Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ТочкаОформления = СоответствиеПодразделений.Получить(ИБ.XMLСтрока(Выборка.Подразделение));
		СтатьяБюджета = СоответствиеСтатейБюджета.Получить(ИБ.XMLСтрока(Выборка.СтатьяДвиженияДенежныхСредств));
		
		Если (ЗначениеЗаполнено(ТочкаОформления)=Ложь) ИЛИ (ЗначениеЗаполнено(СтатьяБюджета)=Ложь) Тогда
			Продолжить;			
		КонецЕсли; 
		
		НоваяСтрока = Данные.Добавить();
		
		НоваяСтрока.ПериодМесяц = НачалоМесяца(Выборка.Дата);
		НоваяСтрока.СтатьяБюджета = СтатьяБюджета;
		НоваяСтрока.Организация = Организация;
		НоваяСтрока.ТочкаОформления = ТочкаОформления;
		
		НоваяСтрока.ДокументИдентификатор = ИБ.XMLСтрока(Выборка.Ссылка)+?(Выборка.НомерСтроки=1,"","_"+ИБ.XMLСтрока(Выборка.НомерСтроки));
		НоваяСтрока.ДокументПредставление = Выборка.СсылкаПредставление;
		НоваяСтрока.ДокументНомер = Выборка.Номер;
		НоваяСтрока.ДокументДата = Выборка.Дата;
		
		НоваяСтрока.Показатель = Выборка.СуммаПлатежа;
		
		НоваяСтрока.ВидДвижения = Выборка.Приход;
	КонецЦикла;
	
	// Сохранение результатов
	//======================================================================================================================
	ПериодМесяц = НачалоМесяца(НачалоПериода);
	Пока КонецМесяца(ПериодМесяц)<=КонецМесяца(ОкончаниеПериода) Цикл
		НайденныеСтроки = Данные.НайтиСтроки(Новый Структура("ПериодМесяц", ПериодМесяц));
		
		НаборЗаписей = РегистрыСведений.ФинансовыйРезультатИмпорт.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Организация.Установить(Организация);
		НаборЗаписей.Отбор.ПериодМесяц.Установить(ПериодМесяц);
		
		Для каждого текСтрока Из НайденныеСтроки Цикл
			НоваяЗапись = НаборЗаписей.Добавить();
			
			ЗаполнитьЗначенияСвойств(НоваяЗапись, текСтрока);			
		КонецЦикла; 
		
		Попытка
			НаборЗаписей.Записать(Истина);
		Исключение
			Результат = Результат+Символы.ПС+ОписаниеОшибки();
		КонецПопытки;
		
		ПериодМесяц = НачалоМесяца(ДобавитьМесяц(ПериодМесяц, 1));			
	КонецЦикла; 
	
	Возврат Результат;
КонецФункции

//=================================================================================================
// API для выгрузки во внешние системы 
//=================================================================================================

Функция ДоступныеДляВыгрузкиДокументы() Экспорт
	// Сведения о доступных для выгрузки документах 
	//------------------------------------------------------------------------------------------------- 
	ВидыДеятельностиТехцентры = Новый Массив;
	ВидыДеятельностиТехцентры.Добавить(Справочники.ВидыДеятельности.Техцентры);
	ВидыДеятельностиТехцентры.Добавить(Справочники.ВидыДеятельности.Товары);
	
	ВидыДеятельностиРеализацияАвтомобилей = Новый Массив;
	ВидыДеятельностиРеализацияАвтомобилей.Добавить(Справочники.ВидыДеятельности.ПродажаНовые);
	ВидыДеятельностиРеализацияАвтомобилей.Добавить(Справочники.ВидыДеятельности.Вторичные);
	
	ДоступныеДокументы = Новый Массив;
	
	ДоступныеДокументы.Добавить(Новый Структура("Имя, Представление, ВидДвижения, ВидыДеятельности", Метаданные.Документы.ПоступлениеТоваров.Имя, Метаданные.Документы.ПоступлениеТоваров.Представление(), "ПРИХОД", ВидыДеятельностиТехцентры));
	ДоступныеДокументы.Добавить(Новый Структура("Имя, Представление, ВидДвижения, ВидыДеятельности", Метаданные.Документы.ПоступлениеУслуг.Имя, Метаданные.Документы.ПоступлениеУслуг.Представление(), "ПРИХОД", ВидыДеятельностиТехцентры));
	ДоступныеДокументы.Добавить(Новый Структура("Имя, Представление, ВидДвижения, ВидыДеятельности", Метаданные.Документы.АвансовыйОтчет.Имя, Метаданные.Документы.АвансовыйОтчет.Представление(), "ПРИХОД", ВидыДеятельностиТехцентры));
	ДоступныеДокументы.Добавить(Новый Структура("Имя, Представление, ВидДвижения, ВидыДеятельности", Метаданные.Документы.ВозвратПокупателя.Имя, Метаданные.Документы.ВозвратПокупателя.Представление(), "ПРИХОД", ВидыДеятельностиТехцентры));
	ДоступныеДокументы.Добавить(Новый Структура("Имя, Представление, ВидДвижения, ВидыДеятельности", Метаданные.Документы.ОприходованиеТоваров.Имя, Метаданные.Документы.ОприходованиеТоваров.Представление(), "ПРИХОД", ВидыДеятельностиТехцентры));
	
	ДоступныеДокументы.Добавить(Новый Структура("Имя, Представление, ВидДвижения, ВидыДеятельности", Метаданные.Документы.ГАЗНЭЗакупка.Имя, Метаданные.Документы.ГАЗНЭЗакупка.Представление(), "ПРИХОД", ВидыДеятельностиРеализацияАвтомобилей));
	ДоступныеДокументы.Добавить(Новый Структура("Имя, Представление, ВидДвижения, ВидыДеятельности", Метаданные.Документы.НЭЗакупка.Имя, Метаданные.Документы.НЭЗакупка.Представление(), "ПРИХОД", ВидыДеятельностиРеализацияАвтомобилей));
	
	ДоступныеДокументы.Добавить(Новый Структура("Имя, Представление, ВидДвижения, ВидыДеятельности", Метаданные.Документы.ЗаказНаряд.Имя, Метаданные.Документы.ЗаказНаряд.Представление(), "РАСХОД", ВидыДеятельностиТехцентры));
	ДоступныеДокументы.Добавить(Новый Структура("Имя, Представление, ВидДвижения, ВидыДеятельности", Метаданные.Документы.УслугаПроизводства.Имя, Метаданные.Документы.УслугаПроизводства.Представление(), "РАСХОД", ВидыДеятельностиТехцентры));
	ДоступныеДокументы.Добавить(Новый Структура("Имя, Представление, ВидДвижения, ВидыДеятельности", Метаданные.Документы.РеализацияТоваров.Имя, Метаданные.Документы.РеализацияТоваров.Представление(), "РАСХОД", ВидыДеятельностиТехцентры));
	ДоступныеДокументы.Добавить(Новый Структура("Имя, Представление, ВидДвижения, ВидыДеятельности", Метаданные.Документы.ВозвратПоставщику.Имя, Метаданные.Документы.ВозвратПоставщику.Представление(), "РАСХОД", ВидыДеятельностиТехцентры));
	ДоступныеДокументы.Добавить(Новый Структура("Имя, Представление, ВидДвижения, ВидыДеятельности", Метаданные.Документы.СписаниеТоваров.Имя, Метаданные.Документы.СписаниеТоваров.Представление(), "РАСХОД", ВидыДеятельностиТехцентры));
	ДоступныеДокументы.Добавить(Новый Структура("Имя, Представление, ВидДвижения, ВидыДеятельности", Метаданные.Документы.ОтчетКомиссионера.Имя, Метаданные.Документы.ОтчетКомиссионера.Представление(), "РАСХОД", ВидыДеятельностиТехцентры));
	ДоступныеДокументы.Добавить(Новый Структура("Имя, Представление, ВидДвижения, ВидыДеятельности", Метаданные.Документы.ОтчетКомитенту.Имя, Метаданные.Документы.ОтчетКомитенту.Представление(), "РАСХОД", ВидыДеятельностиТехцентры));
	ДоступныеДокументы.Добавить(Новый Структура("Имя, Представление, ВидДвижения, ВидыДеятельности", Метаданные.Документы.ВводИнструментовВЭксплуатацию.Имя, Метаданные.Документы.ВводИнструментовВЭксплуатацию.Представление(), "РАСХОД", ВидыДеятельностиТехцентры));
	ДоступныеДокументы.Добавить(Новый Структура("Имя, Представление, ВидДвижения, ВидыДеятельности", Метаданные.Документы.АктВыполненныхРаботСводный.Имя, Метаданные.Документы.АктВыполненныхРаботСводный.Представление(), "РАСХОД", ВидыДеятельностиТехцентры));
//	ДоступныеДокументы.Добавить(Новый Структура("Имя, Представление, ВидДвижения, ВидыДеятельности", Метаданные.Документы.АктВыполненныхРаботСводныйКорректировочный.Имя, Метаданные.Документы.ЗаказНаряд.Представление(), "РАСХОД", ВидыДеятельностиТехцентры));
    ДоступныеДокументы.Добавить(Новый Структура("Имя, Представление, ВидДвижения, ВидыДеятельности", Метаданные.Документы.ЗаявлениеОВвозеТоваровПолученное.Имя, Метаданные.Документы.ЗаявлениеОВвозеТоваровПолученное.Представление(), "Приход", ВидыДеятельностиТехцентры));

	ДоступныеДокументы.Добавить(Новый Структура("Имя, Представление, ВидДвижения, ВидыДеятельности", Метаданные.Документы.НЭРеализация.Имя, Метаданные.Документы.НЭРеализация.Представление(), "РАСХОД", ВидыДеятельностиРеализацияАвтомобилей));
	ДоступныеДокументы.Добавить(Новый Структура("Имя, Представление, ВидДвижения, ВидыДеятельности", Метаданные.Документы.КСОСделкаСтрахование.Имя, Метаданные.Документы.КСОСделкаСтрахование.Представление(), "РАСХОД", ВидыДеятельностиРеализацияАвтомобилей));
	
	ДоступныеДокументы.Добавить(Новый Структура("Имя, Представление, ВидДвижения, ВидыДеятельности", Метаданные.Документы.ПеремещениеТоваров.Имя, Метаданные.Документы.ПеремещениеТоваров.Представление(), "ПЕРЕМЕЩЕНИЕ", ВидыДеятельностиТехцентры));
	ДоступныеДокументы.Добавить(Новый Структура("Имя, Представление, ВидДвижения, ВидыДеятельности", Метаданные.Документы.НЭПеремещение.Имя, Метаданные.Документы.НЭПеремещение.Представление(), "ПЕРЕМЕЩЕНИЕ", ВидыДеятельностиРеализацияАвтомобилей));
	
	ДоступныеДокументы.Добавить(Новый Структура("Имя, Представление, ВидДвижения, ВидыДеятельности", Метаданные.Документы.НЭДоработка.Имя, Метаданные.Документы.НЭДоработка.Представление(), "ДОРАБОТКА", ВидыДеятельностиРеализацияАвтомобилей));	
	ДоступныеДокументы.Добавить(Новый Структура("Имя, Представление, ВидДвижения, ВидыДеятельности", Метаданные.Документы.НЭДоукомплектация.Имя, Метаданные.Документы.НЭДоукомплектация.Представление(), "ДОУКОМПЛЕКТАЦИЯ", ВидыДеятельностиРеализацияАвтомобилей));	
	
	ДоступныеДокументы.Добавить(Новый Структура("Имя, Представление, ВидДвижения, ВидыДеятельности", Метаданные.Документы.НЭПередачаНаПереработку.Имя, Метаданные.Документы.НЭПередачаНаПереработку.Представление(), "ПЕРЕРАБОТКА", ВидыДеятельностиРеализацияАвтомобилей));	
	ДоступныеДокументы.Добавить(Новый Структура("Имя, Представление, ВидДвижения, ВидыДеятельности", Метаданные.Документы.НЭПриемИзПереработки.Имя, Метаданные.Документы.НЭПриемИзПереработки.Представление(), "ПЕРЕРАБОТКА", ВидыДеятельностиРеализацияАвтомобилей));	
	
	ДоступныеДокументы.Добавить(Новый Структура("Имя, Представление, ВидДвижения, ВидыДеятельности", Метаданные.Документы.РеализацияУслуг.Имя, Метаданные.Документы.РеализацияУслуг.Представление(), "РАСХОД", ВидыДеятельностиРеализацияАвтомобилей));
	ДоступныеДокументы.Добавить(Новый Структура("Имя, Представление, ВидДвижения, ВидыДеятельности", Метаданные.Документы.НЭПереоценкаВтор.Имя, Метаданные.Документы.НЭПереоценкаВтор.Представление(), "АГЕНТ", ВидыДеятельностиРеализацияАвтомобилей));	
	
	ДоступныеДокументы.Добавить(Новый Структура("Имя, Представление, ВидДвижения, ВидыДеятельности", Метаданные.Документы.КомплектацияТоваров.Имя, Метаданные.Документы.КомплектацияТоваров.Представление(), "КОМПЛЕКТАЦИЯ", ВидыДеятельностиТехцентры));
	
	ДоступныеДокументы.Добавить(Новый Структура("Имя, Представление, ВидДвижения, ВидыДеятельности", Метаданные.Документы.ДоговорТЭФЛ.Имя, Метаданные.Документы.ДоговорТЭФЛ.Представление(), "ДОГОВОР", ВидыДеятельностиРеализацияАвтомобилей));
	ДоступныеДокументы.Добавить(Новый Структура("Имя, Представление, ВидДвижения, ВидыДеятельности", Метаданные.Документы.НЭВодителиНаряды.Имя, Метаданные.Документы.НЭВодителиНаряды.Представление(), "ДОГОВОР", ВидыДеятельностиРеализацияАвтомобилей));
	ДоступныеДокументы.Добавить(Новый Структура("Имя, Представление, ВидДвижения, ВидыДеятельности", Метаданные.Документы.НЭВодителиДоговоры.Имя, Метаданные.Документы.НЭВодителиДоговоры.Представление(), "ДОГОВОР", ВидыДеятельностиРеализацияАвтомобилей));
	
	ДоступныеДокументы.Добавить(Новый Структура("Имя, Представление, ВидДвижения, ВидыДеятельности", Метаданные.Документы.МТЗакупка.Имя, Метаданные.Документы.МТЗакупка.Представление(), "ПРИХОД", ВидыДеятельностиРеализацияАвтомобилей));
	ДоступныеДокументы.Добавить(Новый Структура("Имя, Представление, ВидДвижения, ВидыДеятельности", Метаданные.Документы.МТРеализация.Имя, Метаданные.Документы.МТРеализация.Представление(), "РАСХОД", ВидыДеятельностиРеализацияАвтомобилей));
	
	ДоступныеДокументы.Добавить(Новый Структура("Имя, Представление, ВидДвижения, ВидыДеятельности", Метаданные.Документы.ПриемОтветХранениеШин.Имя, Метаданные.Документы.ПриемОтветХранениеШин.Представление(), "РАСХОД", ВидыДеятельностиТехцентры));
	ДоступныеДокументы.Добавить(Новый Структура("Имя, Представление, ВидДвижения, ВидыДеятельности", Метаданные.Документы.ВыдачаОтветХранениеШин.Имя, Метаданные.Документы.ПриемОтветХранениеШин.Представление(), "РАСХОД", ВидыДеятельностиТехцентры));
	
	ДоступныеДокументы.Добавить(Новый Структура("Имя, Представление, ВидДвижения, ВидыДеятельности", Метаданные.Документы.НЭПередачаНаХранение.Имя, Метаданные.Документы.НЭПередачаНаХранение.Представление(), "РАСХОД", ВидыДеятельностиРеализацияАвтомобилей));
	ДоступныеДокументы.Добавить(Новый Структура("Имя, Представление, ВидДвижения, ВидыДеятельности", Метаданные.Документы.НЭПриемНаХранение.Имя, Метаданные.Документы.НЭПриемНаХранение.Представление(), "ПРИХОД", ВидыДеятельностиРеализацияАвтомобилей));
	ДоступныеДокументы.Добавить(Новый Структура("Имя, Представление, ВидДвижения, ВидыДеятельности", Метаданные.Документы.НЭСнятиеИзХранения.Имя, Метаданные.Документы.НЭСнятиеИзХранения.Представление(), "РАСХОД", ВидыДеятельностиРеализацияАвтомобилей));
	ДоступныеДокументы.Добавить(Новый Структура("Имя, Представление, ВидДвижения, ВидыДеятельности", Метаданные.Документы.НЭОтчетАгента.Имя, Метаданные.Документы.НЭОтчетАгента.Представление(), "АГЕНТ", ВидыДеятельностиРеализацияАвтомобилей));	
	
	
	Возврат ДоступныеДокументы;	
КонецФункции

Функция ПолучитьКодОбмена(Номенклатура, КлючКодаОбмена, КодОбменаУИД)
	КодОбмена = "";
	
	Если ЗначениеЗаполнено(КлючКодаОбмена)=Ложь Тогда
		Возврат КодОбмена;		
	КонецЕсли; 
	Если ТипЗнч(Номенклатура) = Тип("СправочникСсылка.Номенклатура") тогда
		нСтрока = Номенклатура.КодыПоставщиков.Найти(КлючКодаОбмена, "Поставщик");
		Если нСтрока<>Неопределено Тогда
			КодОбмена = нСтрока.Код;		
		КонецЕсли; 
	КонецЕсли;
	
	Если ЗначениеЗаполнено(КодОбмена)=Ложь Тогда
		Если КодОбменаУИД=Ложь Тогда
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ ПЕРВЫЕ 1
			|	СоответствиеИдентификаторов.Идентификатор КАК Идентификатор
			|ИЗ
			|	РегистрСведений.СоответствиеИдентификаторов КАК СоответствиеИдентификаторов
			|ГДЕ
			|	СоответствиеИдентификаторов.Проект = &Проект
			|	И СоответствиеИдентификаторов.СсылкаНаОбъектОУ = &СсылкаНаОбъектОУ
			|	И ПОДСТРОКА(СоответствиеИдентификаторов.Идентификатор, 20, 1) = """"";
			
			Запрос.УстановитьПараметр("Проект", КлючКодаОбмена);
			Запрос.УстановитьПараметр("СсылкаНаОбъектОУ", Номенклатура);
			
			Выборка = Запрос.Выполнить().Выбрать();
			Пока Выборка.Следующий() Цикл
				КодОбмена = СокрЛП(Выборка.Идентификатор);
			КонецЦикла;  
		КонецЕсли;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(КодОбмена)=Ложь Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	СоответствиеИдентификаторов.Идентификатор КАК Идентификатор
		|ИЗ
		|	РегистрСведений.СоответствиеИдентификаторов КАК СоответствиеИдентификаторов
		|ГДЕ
		|	СоответствиеИдентификаторов.Проект = &Проект
		|	И СоответствиеИдентификаторов.СсылкаНаОбъектОУ = &СсылкаНаОбъектОУ
		|	И ПОДСТРОКА(СоответствиеИдентификаторов.Идентификатор, 20, 1) <> """"";
		
		Запрос.УстановитьПараметр("Проект", КлючКодаОбмена);
		Запрос.УстановитьПараметр("СсылкаНаОбъектОУ", Номенклатура);
		
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			КодОбмена = СокрЛП(Выборка.Идентификатор);
			КодОбменаУИД = Истина;
		КонецЦикла;  
	КонецЕсли; 
	
	Возврат КодОбмена;		
КонецФункции

Функция ПолучитьДокументыРНПТ(ДатаНачала, ДатаОкончания)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ПрослеживаемыеТовары.Регистратор КАК Регистратор
	|ИЗ
	|	РегистрНакопления.ПрослеживаемыеТовары КАК ПрослеживаемыеТовары
	|ГДЕ
	|	ПрослеживаемыеТовары.Период >= &ДатаНачала
	|	И ПрослеживаемыеТовары.Период <= &ДатаОкончания";
	
	Запрос.УстановитьПараметр("ДатаНачала", ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания", ДатаОкончания);
	
	Результат = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Регистратор"); 
	Возврат Результат;
	
КонецФункции	   


Функция ПолучитьСводныеАкты(ДатаНачала, ДатаОкончания)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	АктВыполненныхРаботСводныйРеестр.Док КАК Док,
	|	АктВыполненныхРаботСводныйРеестр.Ссылка КАК Ссылка,
	|	АктВыполненныхРаботСводныйРеестр.Ссылка.НомерСчф КАК Номер,
	|	АктВыполненныхРаботСводныйРеестр.Ссылка.Дата КАК Дата
	|ИЗ
	|	Документ.АктВыполненныхРаботСводный.Реестр КАК АктВыполненныхРаботСводныйРеестр
	|ГДЕ
	|	АктВыполненныхРаботСводныйРеестр.Ссылка.Состояние = ЗНАЧЕНИЕ(Справочник.СтатусыДокументов.Закрыт)";
	
//	Запрос.УстановитьПараметр("ДатаНачала", ДатаНачала);
//	Запрос.УстановитьПараметр("ДатаОкончания", ДатаОкончания);
	
	Результат = Запрос.Выполнить().Выгрузить(); 
	Возврат Результат;
	
КонецФункции	


Функция ПолучитьРНПТ(док)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПрослеживаемыеТовары.Партия КАК Партия,
	|	ПрослеживаемыеТовары.Номенклатура КАК Номенклатура,
	|	ПрослеживаемыеТовары.РНПТ КАК РНПТ,
	|	ПрослеживаемыеТовары.Количество КАК Количество,
	|	ПрослеживаемыеТовары.Сумма КАК Сумма,
	|	ПрослеживаемыеТовары.КоличествоПрослеживаемости КАК КоличествоПрослеживаемости,
	|	ПрослеживаемыеТовары.СтранаПроисхождения КАК СтранаПроисхождения,
	|	ПрослеживаемыеТовары.ИдентификаторСтроки КАК ИдентификаторСтроки
	|ИЗ
	|	РегистрНакопления.ПрослеживаемыеТовары КАК ПрослеживаемыеТовары
	|ГДЕ
	|	ПрослеживаемыеТовары.Регистратор = &Регистратор";
	
	Запрос.УстановитьПараметр("Регистратор", док);
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	Возврат РезультатЗапроса;
	
КонецФункции	

Функция ВыгрузитьДокументы_Партии(НачалоПериода, ОкончаниеПериода, ОрганизацияИНН="", МассивВидовДокументов=Неопределено, КлючКодаОбмена=Неопределено, ПокупательИНН="") Экспорт
	// Выгрузка документов за период
	// Дерево в разрезе видов документов
	// МассивВидовДокументов - массив имен метаданных выгружаемых документов
	// КлючКодаОбмена - разделитель для получения кода обмена, доступны "БУХ_КЗН" и "БУХ_УФА"
	//
	// ПокупательИНН - отбор по покупателю
	//
	// В свойстве "Номенклатура" находятся сведения обо всех выгруженных товарах
	// В свойстве "МежхолдерныеДвижения" находятся сведения обо всех межхолдерных движениях
	//-------------------------------------------------------------------------------------------------
	ДеревоДокументов = Новый Соответствие;
	ДокументыРНПТ = Новый Массив;
	ЕстьДокументыРНПТ = ПолучитьДокументыРНПТ(НачалоПериода, ОкончаниеПериода);
	Если ЗначениеЗаполнено(ЕстьДокументыРНПТ) тогда 
		ДокументыРНПТ = ЕстьДокументыРНПТ;       
	КонецЕсли;
	ДоступныеДокументы = Новый Массив;
	Массив = ДоступныеДляВыгрузкиДокументы();
	Для каждого текЭлемент Из Массив Цикл
		ДоступныеДокументы.Добавить(текЭлемент.Имя);		
	КонецЦикла; 
	
	ДокументыДляВыгрузки = Новый Массив;
	Если МассивВидовДокументов=Неопределено Тогда
		ДокументыДляВыгрузки = ДоступныеДокументы;
	Иначе
		Для каждого текЭлемент Из МассивВидовДокументов Цикл
			Если ДоступныеДокументы.Найти(текЭлемент)<>Неопределено Тогда
				ДокументыДляВыгрузки.Добавить(текЭлемент);
			КонецЕсли; 			
		КонецЦикла; 		
	КонецЕсли;
	
	ТЗСводныеАкты =  ПолучитьСводныеАкты(НачалоПериода, ОкончаниеПериода);

	
	
	
	
	НоменклатураДляВыгрузки=Новый СписокЗначений;
	КонтрагентыДляВыгрузки = Новый СписокЗначений;
	
	МассивДокументовСписанияТоваров = Новый Массив;
	МассивДокументовПередачиНаКомиссию = Новый Массив;
	ДокументыКонтурПродажиАвтомобилей = Новый Массив;
	ДокументыКонтурПродажиАвтомобилей.Добавить("ГАЗНЭЗакупка");
	ДокументыКонтурПродажиАвтомобилей.Добавить("НЭЗакупка");
	ДокументыКонтурПродажиАвтомобилей.Добавить("НЭРеализация");
	ДокументыКонтурПродажиАвтомобилей.Добавить("НЭПеремещение");
	ДокументыКонтурПродажиАвтомобилей.Добавить("НЭДоработка");
	ДокументыКонтурПродажиАвтомобилей.Добавить("НЭДоукомплектация");
	ДокументыКонтурПродажиАвтомобилей.Добавить("КСОСделкаСтрахование");
	ДокументыКонтурПродажиАвтомобилей.Добавить("НЭПередачаНаПереработку");
	ДокументыКонтурПродажиАвтомобилей.Добавить("НЭПриемИзПереработки");
	ДокументыКонтурПродажиАвтомобилей.Добавить("ДоговорТЭФЛ");
	ДокументыКонтурПродажиАвтомобилей.Добавить("НЭВодителиНаряды"); 
	ДокументыКонтурПродажиАвтомобилей.Добавить("НЭВодителиДоговоры"); 
	
	ДокументыКонтурПродажиАвтомобилей.Добавить("МТЗакупка");
	ДокументыКонтурПродажиАвтомобилей.Добавить("МТРеализация");
	
	ДокументыКонтурПродажиАвтомобилей.Добавить("НЭПередачаНаХранение");
	ДокументыКонтурПродажиАвтомобилей.Добавить("НЭПриемНаХранение");  
	ДокументыКонтурПродажиАвтомобилей.Добавить("НЭСнятиеИзХранения");
	ДокументыКонтурПродажиАвтомобилей.Добавить("НЭОтчетАгента"); 
	ДокументыКонтурПродажиАвтомобилей.Добавить("НЭПереоценкаВтор"); 
	
	// Документы
	//-------------------------------------------------------------------------------------------------
	Для каждого текЭлемент Из ДокументыДляВыгрузки Цикл
		МассивДокументов = Новый Массив;
		
		Если текЭлемент="НЭРеализация" Тогда
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	Док.Ссылка КАК Ссылка,
			|	ЕСТЬNULL(НЭОтчетАгента.Ссылка, """") КАК ОтчетАгента
			|ИЗ
			|	Документ.НЭРеализация КАК Док
			|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.НЭОтчетАгента КАК НЭОтчетАгента
			|		ПО (НЭОтчетАгента.ДокРасход = Док.Ссылка)
			|ГДЕ
			|	Док.Дата МЕЖДУ &НачалоПериода И &ОкончаниеПериода
			|	И Док.Проведен = ИСТИНА";
			
			Если ЗначениеЗаполнено(ОрганизацияИНН) Тогда
				Запрос.Текст = Запрос.Текст+"
				|	И Док.Холдер.ИНН=&ОрганизацияИНН";
				
				Запрос.УстановитьПараметр("ОрганизацияИНН", ОрганизацияИНН);
			КонецЕсли;
		ИначеЕсли текЭлемент="ДоговорТЭФЛ" Тогда
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	Док.Ссылка КАК Ссылка
			|ИЗ
			|	Документ.ДоговорТЭФЛ КАК Док
			|ГДЕ
			|	Док.ДатаЗакрытия МЕЖДУ &НачалоПериода И &ОкончаниеПериода
			|	И Док.Проведен = ИСТИНА";
			
			Если ЗначениеЗаполнено(ОрганизацияИНН) Тогда
				Запрос.Текст = Запрос.Текст+"
				|	И Док.Холдер.ИНН=&ОрганизацияИНН";
				
				Запрос.УстановитьПараметр("ОрганизацияИНН", ОрганизацияИНН);
			КонецЕсли;  
		ИначеЕсли текЭлемент="НЭВодителиНаряды" Тогда
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	Док.Ссылка КАК Ссылка
			|ИЗ
			|	Документ.НЭВодителиНаряды КАК Док
			|ГДЕ
			|	Док.Договор.Дата МЕЖДУ &НачалоПериода И &ОкончаниеПериода
			|	И Док.Проведен = ИСТИНА";
			
			Если ЗначениеЗаполнено(ОрганизацияИНН) Тогда
				Запрос.Текст = Запрос.Текст+"
				|	И Док.Договор.Холдер.ИНН=&ОрганизацияИНН";
				
				Запрос.УстановитьПараметр("ОрганизацияИНН", ОрганизацияИНН);
			КонецЕсли;  
		ИначеЕсли текЭлемент="НЭВодителиДоговоры" Тогда
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	Док.Ссылка КАК Ссылка
			|ИЗ
			|	Документ.НЭВодителиДоговоры КАК Док
			|ГДЕ
			|	Док.Дата МЕЖДУ &НачалоПериода И &ОкончаниеПериода
			|	И Док.Проведен = ИСТИНА";
			
			Если ЗначениеЗаполнено(ОрганизацияИНН) Тогда
				Запрос.Текст = Запрос.Текст+"
				|	И Док.Холдер.ИНН=&ОрганизацияИНН";
				
				Запрос.УстановитьПараметр("ОрганизацияИНН", ОрганизацияИНН);
			КонецЕсли;  
		ИначеЕсли текЭлемент="КСОСделкаСтрахование" Тогда
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	Док.Ссылка КАК Ссылка
			|ИЗ
			|	Документ.КСОСделкаСтрахование.Услуги КАК Док
			|ГДЕ
			|	Док.Ссылка.Дата МЕЖДУ &НачалоПериода И &ОкончаниеПериода
			|	И Док.Ссылка.Проведен = ИСТИНА";
			
			Если ЗначениеЗаполнено(ОрганизацияИНН) Тогда
				Запрос.Текст = Запрос.Текст+"
				|	И Док.Холдер.ИНН=&ОрганизацияИНН";
				
				Запрос.УстановитьПараметр("ОрганизацияИНН", ОрганизацияИНН);
			КонецЕсли;
		ИначеЕсли текЭлемент="НЭДоработка" Тогда   
			
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	Док.Ссылка
			|ИЗ
			|	Документ."+текЭлемент+" КАК Док   
			|ГДЕ
			|	Док.ДокДата МЕЖДУ &НачалоПериода И &ОкончаниеПериода
			//	|   И (Док.ЗаказНаряд = ЗНАЧЕНИЕ(Документ.ЗаказНаряд.ПустаяСсылка) или Док.ЗаказНаряд = """" )
			|   И (Док.ЗаказНаряд = НЕОПРЕДЕЛЕНО )
			|	И Док.Проведен = ИСТИНА
			|";
			
			Если ЗначениеЗаполнено(ОрганизацияИНН) Тогда
				Запрос.Текст = Запрос.Текст+"
				|	И Док.Холдер.ИНН=&ОрганизацияИНН";
				
				Запрос.УстановитьПараметр("ОрганизацияИНН", ОрганизацияИНН);
			КонецЕсли;    
			
			//Переопредели запрос для Экспертов
			ЭтоЭксперты = Ложь;
			Если ЗначениеЗаполнено(ОрганизацияИНН) Тогда 
				ИндексОргЭкспертов = АвтоСпробегом.ОрганизацииЭксперт().Найти(Справочники.Контрагенты.НайтиПоРеквизиту("ИНН",ОрганизацияИНН));
				Если ТипЗнч(ИндексОргЭкспертов) = Тип("Число") Тогда
					ЭтоЭксперты =Истина;	
				КонецЕсли;
			КонецЕсли;
			Если ЭтоЭксперты Тогда
				Запрос.Текст = 	
				"ВЫБРАТЬ	Док.Ссылка
				|ИЗ			Документ.НЭДоработка КАК Док   
				|ГДЕ		Док.ДокДата МЕЖДУ &НачалоПериода И &ОкончаниеПериода
				|			И Док.Проведен = ИСТИНА
				|			И Док.Холдер.ИНН=&ОрганизацияИНН";
			КонецЕсли;
		ИначеЕсли текЭлемент="РеализацияУслуг" Тогда
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	Док.Ссылка
			|ИЗ
			|	Документ."+текЭлемент+" КАК Док
			|ГДЕ
			|	Док.Дата МЕЖДУ &НачалоПериода И &ОкончаниеПериода
			|	И Док.Проведен = ИСТИНА
			|";
			
			Если ЗначениеЗаполнено(ОрганизацияИНН) Тогда
				Запрос.Текст = Запрос.Текст+"
				|	И Док.Поставщик.ИНН=&ОрганизацияИНН";
				
				Запрос.УстановитьПараметр("ОрганизацияИНН", ОрганизацияИНН);
			КонецЕсли; 
		ИначеЕсли текЭлемент="НЭПереоценкаВтор" Тогда
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	Док.Ссылка
			|ИЗ
			|	Документ."+текЭлемент+" КАК Док
			|ГДЕ
			|	Док.Дата МЕЖДУ &НачалоПериода И &ОкончаниеПериода
			|	И Док.Проведен = ИСТИНА
			|";
			
			Если ЗначениеЗаполнено(ОрганизацияИНН) Тогда
				Запрос.Текст = Запрос.Текст+"
				|	И Док.Основание.Холдер.ИНН=&ОрганизацияИНН";
				
				Запрос.УстановитьПараметр("ОрганизацияИНН", ОрганизацияИНН);
			КонецЕсли; 
			
		ИначеЕсли ДокументыКонтурПродажиАвтомобилей.Найти(текЭлемент)<>Неопределено Тогда
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	Док.Ссылка
			|ИЗ
			|	Документ."+текЭлемент+" КАК Док
			|ГДЕ
			|	Док.Дата МЕЖДУ &НачалоПериода И &ОкончаниеПериода
			|	И Док.Проведен = ИСТИНА
			|";
			
			Если ЗначениеЗаполнено(ОрганизацияИНН) Тогда
				Запрос.Текст = Запрос.Текст+"
				|	И Док.Холдер.ИНН=&ОрганизацияИНН";
				
				Запрос.УстановитьПараметр("ОрганизацияИНН", ОрганизацияИНН);
			КонецЕсли;
			
			Если (текЭлемент="НЭОтчетАгента") Тогда
				Если ЗначениеЗаполнено(ПокупательИНН) Тогда
					Запрос.Текст = Запрос.Текст+"
					|	И Док.Контрагент.ИНН=&ПокупательИНН";
					
					Запрос.УстановитьПараметр("ПокупательИНН", ПокупательИНН);
				КонецЕсли;
			КонецЕсли; 
		ИначеЕсли текЭлемент="КомплектацияТоваров" Тогда
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	Док.Ссылка
			|ИЗ
			|	Документ.КомплектацияТоваров КАК Док
			|ГДЕ
			|	Док.Дата МЕЖДУ &НачалоПериода И &ОкончаниеПериода
			|	И Док.Проведен = ИСТИНА
			|";
			
			Если ЗначениеЗаполнено(ОрганизацияИНН) Тогда
				Запрос.Текст = Запрос.Текст+"
				|	И Док.Организация.ИНН=&ОрганизацияИНН";
				
				Запрос.УстановитьПараметр("ОрганизацияИНН", ОрганизацияИНН);
			КонецЕсли; 
		ИначеЕсли текЭлемент="ВводИнструментовВЭксплуатацию" Тогда
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	Док.Ссылка КАК Ссылка
			|ИЗ
			|	Документ.ВводИнструментовВЭксплуатацию КАК Док
			|ГДЕ
			|	Док.Дата МЕЖДУ &НачалоПериода И &ОкончаниеПериода
			|	И Док.Проведен";
			
			Если ЗначениеЗаполнено(ОрганизацияИНН) Тогда
				Запрос.Текст = Запрос.Текст+"
				|	И Док.Организация.ИНН=&ОрганизацияИНН";
				
				Запрос.УстановитьПараметр("ОрганизацияИНН", ОрганизацияИНН);
			КонецЕсли;
		ИначеЕсли текЭлемент="АктВыполненныхРаботСводный" Тогда
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	Док.Ссылка КАК Ссылка
			|ИЗ
			|	Документ.АктВыполненныхРаботСводный КАК Док
			|ГДЕ
			|	Док.Дата МЕЖДУ &НачалоПериода И &ОкончаниеПериода 
			|	И Док.Состояние = ЗНАЧЕНИЕ(Справочник.СтатусыДокументов.Закрыт)";
			
			Если ЗначениеЗаполнено(ОрганизацияИНН) Тогда
				Запрос.Текст = Запрос.Текст+"
				|	И Док.Организация.ИНН=&ОрганизацияИНН";
				
				Запрос.УстановитьПараметр("ОрганизацияИНН", ОрганизацияИНН);
			КонецЕсли;	
		ИначеЕсли текЭлемент="АктВыполненныхРаботСводныйКорректировочный" Тогда
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	Док.Ссылка КАК Ссылка
			|ИЗ
			|	Документ.АктВыполненныхРаботСводныйКорректировочный КАК Док
			|ГДЕ
			|	Док.Дата МЕЖДУ &НачалоПериода И &ОкончаниеПериода 
			|	И Док.Состояние = ЗНАЧЕНИЕ(Справочник.СтатусыДокументов.Закрыт)
			|	И Док.Проведен";
			
			Если ЗначениеЗаполнено(ОрганизацияИНН) Тогда
				Запрос.Текст = Запрос.Текст+"
				|	И Док.Организация.ИНН=&ОрганизацияИНН";
				
				Запрос.УстановитьПараметр("ОрганизацияИНН", ОрганизацияИНН);
			КонецЕсли;		
			
		Иначе
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	Док.Ссылка
			|ИЗ
			|	Документ."+текЭлемент+" КАК Док
			|ГДЕ
			|	"+?(текЭлемент="ЗаказНаряд", "Док.ДатаЗакрытия", "Док.Дата")+" МЕЖДУ &НачалоПериода И &ОкончаниеПериода
			|	И Док.Состояние = ЗНАЧЕНИЕ(Справочник.СтатусыДокументов.Закрыт)
			|	И Док.Проведен = ИСТИНА
			|";
			
			Если текЭлемент="ПоступлениеТоваров" Тогда
				Запрос.Текст = Запрос.Текст+"
				|	И Док.ВозвратПокупателя = ЛОЖЬ";
			КонецЕсли; 
			
			Если текЭлемент="ПеремещениеТоваров" Тогда
				Запрос.Текст = Запрос.Текст+"
				|	И НЕ Док.СкладОтправитель.ТочкаОформления=Док.СкладПолучатель.ТочкаОформления";
			Иначе
				Если ЗначениеЗаполнено(ОрганизацияИНН) Тогда
					Запрос.Текст = Запрос.Текст+"
					|	И Док.Организация.ИНН=&ОрганизацияИНН";
					
					Запрос.УстановитьПараметр("ОрганизацияИНН", ОрганизацияИНН);
				КонецЕсли;
			КонецЕсли;
			
			Если (текЭлемент="ЗаказНаряд") ИЛИ (текЭлемент="РеализацияТоваров") Тогда
				Если ЗначениеЗаполнено(ПокупательИНН) Тогда
					Запрос.Текст = Запрос.Текст+"
					|	И Док.Контрагент.ИНН=&ПокупательИНН";
					
					Запрос.УстановитьПараметр("ПокупательИНН", ПокупательИНН);
				КонецЕсли;
			КонецЕсли; 
		КонецЕсли;
		
		Запрос.Текст = Запрос.Текст+"
		|УПОРЯДОЧИТЬ ПО "+?(текЭлемент="ЗаказНаряд", "Док.ДатаЗакрытия", "Док.Ссылка.Дата");
		
		Запрос.УстановитьПараметр("НачалоПериода", НачалоПериода);
		Запрос.УстановитьПараметр("ОкончаниеПериода", ОкончаниеПериода);
		
		РезультатЗапроса = Запрос.Выполнить();
		Если РезультатЗапроса.Пустой()=Ложь Тогда
			Выборка = РезультатЗапроса.Выбрать();
			Пока Выборка.Следующий() Цикл
				УзелДокумент = Новый Структура("ВидДокумента, Дата, Номер, УИД, Товары, ДокументыОтгрузки, ДополнительныеРеквизиты,РНПТ ");
				
				ДокументСсылка = Выборка.Ссылка;
				
				УзелДокумент.ВидДокумента = текЭлемент;
				УзелДокумент.Дата = ДокументСсылка.Дата;
				УзелДокумент.Номер = СокрЛП(ДокументСсылка.Номер);
				УзелДокумент.УИД = СокрЛП(ДокументСсылка.УникальныйИдентификатор());
				
				УзелДокумент.Товары = Новый Массив;
				УзелДокумент.РНПТ = Новый Массив; 
				УзелДокумент.ДокументыОтгрузки = Новый Массив;
				УзелДокумент.ДополнительныеРеквизиты = Новый Структура;
				
				Если текЭлемент="МТЗакупка" Тогда
					УзелДокумент.ДополнительныеРеквизиты.Вставить("ТочкаОформления", СокрЛП(ДокументСсылка.ТочкаОформления));
					УзелДокумент.ДополнительныеРеквизиты.Вставить("ТочкаОформленияУИД", СокрЛП(ДокументСсылка.ТочкаОформления.УникальныйИдентификатор()));
					
					УзелДокумент.ДополнительныеРеквизиты.Вставить("Организация", СокрЛП(ДокументСсылка.Холдер));
					УзелДокумент.ДополнительныеРеквизиты.Вставить("ОрганизацияИНН", ДокументСсылка.Холдер.ИНН);
					УзелДокумент.ДополнительныеРеквизиты.Вставить("ОрганизацияКПП", ДокументСсылка.Холдер.КПП);
					
					УзелДокумент.ДополнительныеРеквизиты.Вставить("Контрагент", СокрЛП(ДокументСсылка.Поставщик));
					УзелДокумент.ДополнительныеРеквизиты.Вставить("КонтрагентИНН", ДокументСсылка.Поставщик.ИНН);
					УзелДокумент.ДополнительныеРеквизиты.Вставить("КонтрагентКПП", ДокументСсылка.Поставщик.КПП);
					УзелДокумент.ДополнительныеРеквизиты.Вставить("КонтрагентУИД", СокрЛП(ДокументСсылка.Поставщик.УникальныйИдентификатор()));
					УзелДокумент.ДополнительныеРеквизиты.Вставить("КонтрагентФормаСобственности", СокрЛП(ДокументСсылка.Поставщик.ТипКонтрагента));
					
					УзелДокумент.ДополнительныеРеквизиты.Вставить("КонтрагентСтранаНаименование", ВРег(СокрЛП(ДокументСсылка.Поставщик.Страна.Наименование)));
					УзелДокумент.ДополнительныеРеквизиты.Вставить("КонтрагентСтранаКодОКСМ", СокрЛП(ДокументСсылка.Поставщик.Страна.КодОКСМ));
					УзелДокумент.ДополнительныеРеквизиты.Вставить("КонтрагентЭтоРезидент", ДокументСсылка.Поставщик.ПолучитьОбъект().ЭтоРезидент()); 
					
					УзелДокумент.ДополнительныеРеквизиты.Вставить("НомерВходящегоДокумента", СокрЛП(ДокументСсылка.Номер));
					УзелДокумент.ДополнительныеРеквизиты.Вставить("ДатаВходящегоДокумента", ДокументСсылка.Дата);
					
					УзелДокумент.ДополнительныеРеквизиты.Вставить("СчетФактураНомер", СокрЛП(ДокументСсылка.СчфНомер));
					УзелДокумент.ДополнительныеРеквизиты.Вставить("СчетФактураДата", ДокументСсылка.СчфДата);
					
					УзелДокумент.ДополнительныеРеквизиты.Вставить("СуммаДокумента", ДокументСсылка.СуммаВсего);
					
					Для каждого текСтрока Из ДокументСсылка.Материалы Цикл
						СтрокаТовары = Новый Структура("Номенклатура, НоменклатураКод, НоменклатураУИД, Цена, Количество, Сумма, СтавкаНДС, СуммаНДС, ПредставлениеНДС, БезНДС");
						
						СтрокаТовары.Номенклатура = СокрЛП(текСтрока.Материал);
						СтрокаТовары.НоменклатураКод = СокрЛП(текСтрока.Материал.Код);
						СтрокаТовары.НоменклатураУИД = СокрЛП(текСтрока.Материал.УникальныйИдентификатор());
						СтрокаТовары.Цена = текСтрока.ЦенаСНДС;
						СтрокаТовары.Количество = текСтрока.Количество;
						СтрокаТовары.Сумма = текСтрока.ВсегоСНДС;
						
						СтрокаТовары.СтавкаНДС = текСтрока.СтавкаНДС.Ставка;
						СтрокаТовары.ПредставлениеНДС = СокрЛП(текСтрока.СтавкаНДС);
						СтрокаТовары.БезНДС = (текСтрока.СтавкаНДС=Справочники.СтавкиНДС.БезНДС);
						
						СтрокаТовары.СуммаНДС = Конвертация.НдсОтСуммыПолучить(ТекСтрока.ВсегоСНДС,текСтрока.СтавкаНДС);
						
						УзелДокумент.Товары.Добавить(СтрокаТовары);
					КонецЦикла; 
					
				ИначеЕсли текЭлемент="МТРеализация" Тогда
					УзелДокумент.ДополнительныеРеквизиты.Вставить("ТочкаОформления", СокрЛП(ДокументСсылка.ТочкаОформления));
					УзелДокумент.ДополнительныеРеквизиты.Вставить("ТочкаОформленияУИД", СокрЛП(ДокументСсылка.ТочкаОформления.УникальныйИдентификатор()));
					
					УзелДокумент.ДополнительныеРеквизиты.Вставить("Организация", СокрЛП(ДокументСсылка.Холдер));
					УзелДокумент.ДополнительныеРеквизиты.Вставить("ОрганизацияИНН", ДокументСсылка.Холдер.ИНН);
					УзелДокумент.ДополнительныеРеквизиты.Вставить("ОрганизацияКПП", ДокументСсылка.Холдер.КПП);
					
					УзелДокумент.ДополнительныеРеквизиты.Вставить("Контрагент", СокрЛП(ДокументСсылка.Покупатель));
					УзелДокумент.ДополнительныеРеквизиты.Вставить("КонтрагентИНН", ДокументСсылка.Покупатель.ИНН);
					УзелДокумент.ДополнительныеРеквизиты.Вставить("КонтрагентКПП", ДокументСсылка.Покупатель.КПП);
					УзелДокумент.ДополнительныеРеквизиты.Вставить("КонтрагентУИД", СокрЛП(ДокументСсылка.Покупатель.УникальныйИдентификатор()));
					УзелДокумент.ДополнительныеРеквизиты.Вставить("КонтрагентФормаСобственности", СокрЛП(ДокументСсылка.Покупатель.ТипКонтрагента));
					
					УзелДокумент.ДополнительныеРеквизиты.Вставить("КонтрагентСтранаНаименование", ВРег(СокрЛП(ДокументСсылка.Покупатель.Страна.Наименование)));
					УзелДокумент.ДополнительныеРеквизиты.Вставить("КонтрагентСтранаКодОКСМ", СокрЛП(ДокументСсылка.Покупатель.Страна.КодОКСМ));
					УзелДокумент.ДополнительныеРеквизиты.Вставить("КонтрагентЭтоРезидент", ДокументСсылка.Покупатель.ПолучитьОбъект().ЭтоРезидент()); 
					
					Если ЗначениеЗаполнено(ДокументСсылка.Основание) Тогда
						УзелДокумент.ДополнительныеРеквизиты.Вставить("Договор", СокрЛП(ДокументСсылка.Основание));
						УзелДокумент.ДополнительныеРеквизиты.Вставить("ДоговорУИД", СокрЛП(ДокументСсылка.Основание.УникальныйИдентификатор()));
						УзелДокумент.ДополнительныеРеквизиты.Вставить("ДоговорНомер", СокрЛП(ДокументСсылка.Основание.НомерДоговора));
						УзелДокумент.ДополнительныеРеквизиты.Вставить("ДоговорДата", ДокументСсылка.Основание.ДатаДоговора);
						УзелДокумент.ДополнительныеРеквизиты.Вставить("ДоговорВид", СокрЛП(ДокументСсылка.Основание.ВидДоговора));
					Иначе
						УзелДокумент.ДополнительныеРеквизиты.Вставить("Договор", "");
						УзелДокумент.ДополнительныеРеквизиты.Вставить("ДоговорУИД", "");
						УзелДокумент.ДополнительныеРеквизиты.Вставить("ДоговорНомер", "");
						УзелДокумент.ДополнительныеРеквизиты.Вставить("ДоговорДата", "");
						УзелДокумент.ДополнительныеРеквизиты.Вставить("ДоговорВид", "");
					КонецЕсли; 
					
					УзелДокумент.ДополнительныеРеквизиты.Вставить("СчетФактураНомер", СокрЛП(ДокументСсылка.СчфНомер));
					УзелДокумент.ДополнительныеРеквизиты.Вставить("СчетФактураДата", ДокументСсылка.Дата);
					
					УзелДокумент.ДополнительныеРеквизиты.Вставить("СуммаДокумента", ДокументСсылка.СуммаВсего);
					
					Для каждого текСтрока Из ДокументСсылка.Материалы Цикл
						СтрокаТовары = Новый Структура("Номенклатура, НоменклатураКод, НоменклатураУИД, Цена, Количество, Сумма, СтавкаНДС, СуммаНДС, ПредставлениеНДС, БезНДС");
						
						СтрокаТовары.Номенклатура = СокрЛП(текСтрока.Материал);
						СтрокаТовары.НоменклатураКод = СокрЛП(текСтрока.Материал.Код);
						СтрокаТовары.НоменклатураУИД = СокрЛП(текСтрока.Материал.УникальныйИдентификатор());
						СтрокаТовары.Цена = текСтрока.ЦенаСНДС;
						СтрокаТовары.Количество = текСтрока.Количество;
						СтрокаТовары.Сумма = текСтрока.ВсегоСНДС;
						
						СтрокаТовары.СтавкаНДС = текСтрока.Материал.СтавкаНДС.Ставка;
						СтрокаТовары.ПредставлениеНДС = СокрЛП(текСтрока.Материал.СтавкаНДС);
						СтрокаТовары.БезНДС = (текСтрока.Материал.СтавкаНДС=Справочники.СтавкиНДС.БезНДС);
						
						СтрокаТовары.СуммаНДС = Конвертация.НдсОтСуммыПолучить(ТекСтрока.ВсегоСНДС,текСтрока.Материал.СтавкаНДС);
						
						УзелДокумент.Товары.Добавить(СтрокаТовары);
					КонецЦикла; 
				ИначеЕсли текЭлемент="ДоговорТЭФЛ" Тогда
					УзелДокумент.ДополнительныеРеквизиты.Вставить("ДатаЗакрытия", ДокументСсылка.ДатаЗакрытия);
					
					УзелДокумент.ДополнительныеРеквизиты.Вставить("ТочкаОформления", СокрЛП(ДокументСсылка.ТочкаОформления));
					УзелДокумент.ДополнительныеРеквизиты.Вставить("ТочкаОформленияУИД", СокрЛП(ДокументСсылка.ТочкаОформления.УникальныйИдентификатор()));
					
					УзелДокумент.ДополнительныеРеквизиты.Вставить("Организация", СокрЛП(ДокументСсылка.Холдер));
					УзелДокумент.ДополнительныеРеквизиты.Вставить("ОрганизацияИНН", ДокументСсылка.Холдер.ИНН);
					УзелДокумент.ДополнительныеРеквизиты.Вставить("ОрганизацияКПП", ДокументСсылка.Холдер.КПП);
					
					УзелДокумент.ДополнительныеРеквизиты.Вставить("ИНН", СокрЛП(ДокументСсылка.ИНН));
					УзелДокумент.ДополнительныеРеквизиты.Вставить("ПФР", СокрЛП(ДокументСсылка.ПФР));
					
					УзелДокумент.ДополнительныеРеквизиты.Вставить("СуммаАванс", ДокументСсылка.СуммаАванс);
					УзелДокумент.ДополнительныеРеквизиты.Вставить("СуммаВсего", ДокументСсылка.СуммаВсего);
					УзелДокумент.ДополнительныеРеквизиты.Вставить("СуммаЗатрат", ДокументСсылка.СуммаЗатрат);
					
					УзелДокумент.ДополнительныеРеквизиты.Вставить("Автомобиль",  СокрЛП(ДокументСсылка.Автомобиль));
					УзелДокумент.ДополнительныеРеквизиты.Вставить("АвтомобильУИД", СокрЛП(ДокументСсылка.Автомобиль.УникальныйИдентификатор()));
					УзелДокумент.ДополнительныеРеквизиты.Вставить("АвтомобильВИН", СокрЛП(ДокументСсылка.Автомобиль.НомерАгрегата));
					УзелДокумент.ДополнительныеРеквизиты.Вставить("АвтомобильМодельнаяГруппа",  СокрЛП(ДокументСсылка.Автомобиль.Модель.МодельнаяГруппа));
					УзелДокумент.ДополнительныеРеквизиты.Вставить("АвтомобильМарка",  СокрЛП(ДокументСсылка.Автомобиль.Модель.Марка));
					
					УзелДокумент.ДополнительныеРеквизиты.Вставить("Контрагент", СокрЛП(ДокументСсылка.Контрагент));
					УзелДокумент.ДополнительныеРеквизиты.Вставить("КонтрагентИНН", ДокументСсылка.Контрагент.ИНН);
					УзелДокумент.ДополнительныеРеквизиты.Вставить("КонтрагентКПП", ДокументСсылка.Контрагент.КПП);
					УзелДокумент.ДополнительныеРеквизиты.Вставить("КонтрагентУИД", СокрЛП(ДокументСсылка.Контрагент.УникальныйИдентификатор()));
					УзелДокумент.ДополнительныеРеквизиты.Вставить("КонтрагентФормаСобственности", СокрЛП(ДокументСсылка.Контрагент.ТипКонтрагента));
					
					УзелДокумент.ДополнительныеРеквизиты.Вставить("КонтрагентСтранаНаименование", ВРег(СокрЛП(ДокументСсылка.Контрагент.Страна.Наименование)));
					УзелДокумент.ДополнительныеРеквизиты.Вставить("КонтрагентСтранаКодОКСМ", СокрЛП(ДокументСсылка.Контрагент.Страна.КодОКСМ));
					УзелДокумент.ДополнительныеРеквизиты.Вставить("КонтрагентЭтоРезидент", ДокументСсылка.Контрагент.ПолучитьОбъект().ЭтоРезидент()); 
					
					Если УзелДокумент.Свойство("Товары")=Истина Тогда
						УзелДокумент.Удалить("Товары");
					КонецЕсли;
				ИначеЕсли текЭлемент="НЭВодителиНаряды" Тогда
					УзелДокумент.ДополнительныеРеквизиты.Вставить("ТочкаОформления", СокрЛП(ДокументСсылка.Договор.ТочкаОформления));
					УзелДокумент.ДополнительныеРеквизиты.Вставить("ТочкаОформленияУИД", СокрЛП(ДокументСсылка.Договор.ТочкаОформления.УникальныйИдентификатор()));
					
					УзелДокумент.ДополнительныеРеквизиты.Вставить("Организация", СокрЛП(ДокументСсылка.Договор.Холдер));
					УзелДокумент.ДополнительныеРеквизиты.Вставить("ОрганизацияИНН", ДокументСсылка.Договор.Холдер.ИНН);
					УзелДокумент.ДополнительныеРеквизиты.Вставить("ОрганизацияКПП", ДокументСсылка.Договор.Холдер.КПП);
					
					УзелДокумент.ДополнительныеРеквизиты.Вставить("ИНН", СокрЛП(ДокументСсылка.Договор.ВодительИНН));
					УзелДокумент.ДополнительныеРеквизиты.Вставить("ПФР", СокрЛП(ДокументСсылка.Договор.ВодительСНИЛС));
					
					УзелДокумент.ДополнительныеРеквизиты.Вставить("СуммаВсего", ДокументСсылка.СуммаВсего);
					УзелДокумент.ДополнительныеРеквизиты.Вставить("СуммаЗатрат", ДокументСсылка.Договор.СуммаЗатрат);
					УзелДокумент.ДополнительныеРеквизиты.Вставить("НаСебестоимость", ДокументСсылка.НаСебестоимость);
					
					Если ТипЗнч(ДокументСсылка.Автомобиль)=Тип("СправочникСписок.НомерныеЭлементы") Тогда
						УзелДокумент.ДополнительныеРеквизиты.Вставить("Автомобиль",  СокрЛП(ДокументСсылка.Автомобиль));
						УзелДокумент.ДополнительныеРеквизиты.Вставить("АвтомобильУИД", СокрЛП(ДокументСсылка.Автомобиль.УникальныйИдентификатор()));
						УзелДокумент.ДополнительныеРеквизиты.Вставить("АвтомобильВИН", СокрЛП(ДокументСсылка.Автомобиль.НомерАгрегата));
						УзелДокумент.ДополнительныеРеквизиты.Вставить("АвтомобильМодельнаяГруппа",  СокрЛП(ДокументСсылка.Автомобиль.Модель.МодельнаяГруппа));
						УзелДокумент.ДополнительныеРеквизиты.Вставить("АвтомобильМарка",  СокрЛП(ДокументСсылка.Автомобиль.Модель.Марка));
					Иначе
						УзелДокумент.ДополнительныеРеквизиты.Вставить("Автомобиль",  СокрЛП(ДокументСсылка.Автомобиль));
						УзелДокумент.ДополнительныеРеквизиты.Вставить("АвтомобильУИД", "");
						УзелДокумент.ДополнительныеРеквизиты.Вставить("АвтомобильВИН", "");
						УзелДокумент.ДополнительныеРеквизиты.Вставить("АвтомобильМодельнаяГруппа",  "");
						УзелДокумент.ДополнительныеРеквизиты.Вставить("АвтомобильМарка",  "");
					КонецЕсли;
					
					УзелДокумент.ДополнительныеРеквизиты.Вставить("Контрагент", СокрЛП(ДокументСсылка.Плательщик));
					УзелДокумент.ДополнительныеРеквизиты.Вставить("КонтрагентИНН", ДокументСсылка.Плательщик.ИНН);
					УзелДокумент.ДополнительныеРеквизиты.Вставить("КонтрагентКПП", ДокументСсылка.Плательщик.КПП);
					УзелДокумент.ДополнительныеРеквизиты.Вставить("КонтрагентУИД", СокрЛП(ДокументСсылка.Плательщик.УникальныйИдентификатор()));
					УзелДокумент.ДополнительныеРеквизиты.Вставить("КонтрагентФормаСобственности", СокрЛП(ДокументСсылка.Плательщик.ТипКонтрагента));
					
					УзелДокумент.ДополнительныеРеквизиты.Вставить("КонтрагентСтранаНаименование", ВРег(СокрЛП(ДокументСсылка.Плательщик.Страна.Наименование)));
					УзелДокумент.ДополнительныеРеквизиты.Вставить("КонтрагентСтранаКодОКСМ", СокрЛП(ДокументСсылка.Плательщик.Страна.КодОКСМ));
					УзелДокумент.ДополнительныеРеквизиты.Вставить("КонтрагентЭтоРезидент", ДокументСсылка.Плательщик.ПолучитьОбъект().ЭтоРезидент());   
					
					УзелДокумент.ДополнительныеРеквизиты.Вставить("Основание", СокрЛП(ДокументСсылка.Договор));
					УзелДокумент.ДополнительныеРеквизиты.Вставить("ОснованиеТип", СокрЛП(ТипЗнч(ДокументСсылка.Договор)));
					УзелДокумент.ДополнительныеРеквизиты.Вставить("ОснованиеНомер", СокрЛП(ДокументСсылка.Договор.Номер));
					УзелДокумент.ДополнительныеРеквизиты.Вставить("ОснованиеДата", ДокументСсылка.Договор.Дата);
					УзелДокумент.ДополнительныеРеквизиты.Вставить("ОснованиеУИД", СокрЛП(ДокументСсылка.Договор.УникальныйИдентификатор()));
					
					Если УзелДокумент.Свойство("Товары")=Истина Тогда
						УзелДокумент.Удалить("Товары");
					КонецЕсли;
				ИначеЕсли текЭлемент="НЭВодителиДоговоры" Тогда
					УзелДокумент.ДополнительныеРеквизиты.Вставить("ТочкаОформления", СокрЛП(ДокументСсылка.ТочкаОформления));
					УзелДокумент.ДополнительныеРеквизиты.Вставить("ТочкаОформленияУИД", СокрЛП(ДокументСсылка.ТочкаОформления.УникальныйИдентификатор()));
					
					УзелДокумент.ДополнительныеРеквизиты.Вставить("Организация", СокрЛП(ДокументСсылка.Холдер));
					УзелДокумент.ДополнительныеРеквизиты.Вставить("ОрганизацияИНН", ДокументСсылка.Холдер.ИНН);
					УзелДокумент.ДополнительныеРеквизиты.Вставить("ОрганизацияКПП", ДокументСсылка.Холдер.КПП);
					
					УзелДокумент.ДополнительныеРеквизиты.Вставить("ИНН", СокрЛП(ДокументСсылка.ВодительИНН));
					УзелДокумент.ДополнительныеРеквизиты.Вставить("ПФР", СокрЛП(ДокументСсылка.ВодительСНИЛС));
					
					УзелДокумент.ДополнительныеРеквизиты.Вставить("СуммаЗатрат", ДокументСсылка.СуммаЗатрат);
					
					Если УзелДокумент.Свойство("Товары")=Истина Тогда
						УзелДокумент.Удалить("Товары");
					КонецЕсли;
				ИначеЕсли текЭлемент="КомплектацияТоваров" Тогда
					УзелДокумент.ДополнительныеРеквизиты.Вставить("ТочкаОформления", СокрЛП(ДокументСсылка.ТочкаОформления));
					УзелДокумент.ДополнительныеРеквизиты.Вставить("ТочкаОформленияУИД", СокрЛП(ДокументСсылка.ТочкаОформления.УникальныйИдентификатор()));
					
					УзелДокумент.ДополнительныеРеквизиты.Вставить("Организация", СокрЛП(ДокументСсылка.Организация));
					УзелДокумент.ДополнительныеРеквизиты.Вставить("ОрганизацияИНН", ДокументСсылка.Организация.ИНН);
					УзелДокумент.ДополнительныеРеквизиты.Вставить("ОрганизацияКПП", ДокументСсылка.Организация.КПП);
					
					УзелДокумент.ДополнительныеРеквизиты.Вставить("ЭтоКомплектация", ДокументСсылка.Комплектация);
					
					Если УзелДокумент.Свойство("Товары")=Истина Тогда
						УзелДокумент.Удалить("Товары");
					КонецЕсли; 
					
					УзелДокумент.Вставить("ТоварыСписание", Новый Массив);
					Для каждого текСтрока Из ДокументСсылка.ТоварыНаСписание Цикл
						СтрокаТовары = Новый Структура("Номенклатура, НоменклатураУИД, Количество");
						
						СтрокаТовары.Номенклатура = СокрЛП(текСтрока.Номенклатура);
						СтрокаТовары.НоменклатураУИД = СокрЛП(текСтрока.Номенклатура.УникальныйИдентификатор());
						СтрокаТовары.Количество = текСтрока.Количество;
						
						УзелДокумент.ТоварыСписание.Добавить(СтрокаТовары);
						
						Если НоменклатураДляВыгрузки.НайтиПоЗначению(текСтрока.Номенклатура)=Неопределено Тогда
							НоменклатураДляВыгрузки.Добавить(текСтрока.Номенклатура);						
						КонецЕсли; 
					КонецЦикла;
					
					УзелДокумент.Вставить("ТоварыОприходование", Новый Массив);
					Для каждого текСтрока Из ДокументСсылка.ТоварыНаОприходование Цикл
						СтрокаТовары = Новый Структура("Номенклатура, НоменклатураУИД, Количество, Цена, Сумма");
						
						СтрокаТовары.Номенклатура = СокрЛП(текСтрока.Номенклатура);
						СтрокаТовары.НоменклатураУИД = СокрЛП(текСтрока.Номенклатура.УникальныйИдентификатор());
						СтрокаТовары.Количество = текСтрока.Количество;
						СтрокаТовары.Цена = текСтрока.Цена;
						СтрокаТовары.Сумма = текСтрока.Сумма;
						
						УзелДокумент.ТоварыОприходование.Добавить(СтрокаТовары);
						
						Если НоменклатураДляВыгрузки.НайтиПоЗначению(текСтрока.Номенклатура)=Неопределено Тогда
							НоменклатураДляВыгрузки.Добавить(текСтрока.Номенклатура);						
						КонецЕсли; 
					КонецЦикла; 
					
					МассивДокументовСписанияТоваров.Добавить(ДокументСсылка);					
				ИначеЕсли текЭлемент="РеализацияУслуг" Тогда
					УзелДокумент.ДополнительныеРеквизиты.Вставить("ТочкаОформления", СокрЛП(ДокументСсылка.ТочкаОформления));
					УзелДокумент.ДополнительныеРеквизиты.Вставить("ТочкаОформленияУИД", СокрЛП(ДокументСсылка.ТочкаОформления.УникальныйИдентификатор()));
					
					УзелДокумент.ДополнительныеРеквизиты.Вставить("Организация", СокрЛП(ДокументСсылка.Поставщик));
					УзелДокумент.ДополнительныеРеквизиты.Вставить("ОрганизацияИНН", ДокументСсылка.Поставщик.ИНН);
					УзелДокумент.ДополнительныеРеквизиты.Вставить("ОрганизацияКПП", ДокументСсылка.Поставщик.КПП);
					
					УзелДокумент.ДополнительныеРеквизиты.Вставить("Контрагент", СокрЛП(ДокументСсылка.Покупатель));
					УзелДокумент.ДополнительныеРеквизиты.Вставить("КонтрагентИНН", ДокументСсылка.Покупатель.ИНН);
					УзелДокумент.ДополнительныеРеквизиты.Вставить("КонтрагентКПП", ДокументСсылка.Покупатель.КПП);
					УзелДокумент.ДополнительныеРеквизиты.Вставить("КонтрагентУИД", СокрЛП(ДокументСсылка.Покупатель.УникальныйИдентификатор()));
					УзелДокумент.ДополнительныеРеквизиты.Вставить("КонтрагентФормаСобственности", СокрЛП(ДокументСсылка.Покупатель.ТипКонтрагента));
					
					УзелДокумент.ДополнительныеРеквизиты.Вставить("КонтрагентСтранаНаименование", ВРег(СокрЛП(ДокументСсылка.Покупатель.Страна.Наименование)));
					УзелДокумент.ДополнительныеРеквизиты.Вставить("КонтрагентСтранаКодОКСМ", СокрЛП(ДокументСсылка.Покупатель.Страна.КодОКСМ));
					УзелДокумент.ДополнительныеРеквизиты.Вставить("КонтрагентЭтоРезидент", ДокументСсылка.Покупатель.ПолучитьОбъект().ЭтоРезидент()); 
					
					Если ЗначениеЗаполнено(ДокументСсылка.Договор)=Истина Тогда
						УзелДокумент.ДополнительныеРеквизиты.Вставить("Основание", СокрЛП(ДокументСсылка.Договор));
						УзелДокумент.ДополнительныеРеквизиты.Вставить("ОснованиеТип", СокрЛП(ТипЗнч(ДокументСсылка.Договор)));
						УзелДокумент.ДополнительныеРеквизиты.Вставить("ОснованиеНомер", СокрЛП(ДокументСсылка.Договор.Номер));
						УзелДокумент.ДополнительныеРеквизиты.Вставить("ОснованиеДата", ДокументСсылка.Договор.Дата);
						УзелДокумент.ДополнительныеРеквизиты.Вставить("ОснованиеУИД", СокрЛП(ДокументСсылка.Договор.УникальныйИдентификатор()));
					Иначе
						УзелДокумент.ДополнительныеРеквизиты.Вставить("Основание", "");
						УзелДокумент.ДополнительныеРеквизиты.Вставить("ОснованиеТип", "");
						УзелДокумент.ДополнительныеРеквизиты.Вставить("ОснованиеНомер", "");
						УзелДокумент.ДополнительныеРеквизиты.Вставить("ОснованиеДата", "");
						УзелДокумент.ДополнительныеРеквизиты.Вставить("ОснованиеУИД", "");
					КонецЕсли; 
					
					Если ЗначениеЗаполнено(ДокументСсылка.НЭРеализация)=Истина Тогда
						УзелДокумент.ДополнительныеРеквизиты.Вставить("СвязаннаяРеализация", СокрЛП(ДокументСсылка.НЭРеализация));
						УзелДокумент.ДополнительныеРеквизиты.Вставить("СвязаннаяРеализацияТип", СокрЛП(ТипЗнч(ДокументСсылка.НЭРеализация)));
						УзелДокумент.ДополнительныеРеквизиты.Вставить("СвязаннаяРеализацияНомер", СокрЛП(ДокументСсылка.НЭРеализация.Номер));
						УзелДокумент.ДополнительныеРеквизиты.Вставить("СвязаннаяРеализацияДата", ДокументСсылка.НЭРеализация.Дата);
						УзелДокумент.ДополнительныеРеквизиты.Вставить("СвязаннаяРеализацияУИД", СокрЛП(ДокументСсылка.НЭРеализация.УникальныйИдентификатор()));
					Иначе
						УзелДокумент.ДополнительныеРеквизиты.Вставить("СвязаннаяРеализация", "");
						УзелДокумент.ДополнительныеРеквизиты.Вставить("СвязаннаяРеализацияТип", "");
						УзелДокумент.ДополнительныеРеквизиты.Вставить("СвязаннаяРеализацияНомер", "");
						УзелДокумент.ДополнительныеРеквизиты.Вставить("СвязаннаяРеализацияДата", "");
						УзелДокумент.ДополнительныеРеквизиты.Вставить("СвязаннаяРеализацияУИД", "");
					КонецЕсли; 
					
					Для каждого текСтрока Из ДокументСсылка.Услуги Цикл
						СтрокаТовары = Новый Структура("Номенклатура, Сумма,СтавкаНДС,СуммаНДС,ПредставлениеНДС,БезНДС");
						
						СтрокаТовары.Номенклатура = СокрЛП(текСтрока.Услуга);  
						СтрокаТовары.Сумма = текСтрока.Сумма;  
						СтрокаТовары.СтавкаНДС = текСтрока.СтавкаНДС.Ставка;
						СтрокаТовары.СуммаНДС = текСтрока.СуммаНДС;
						СтрокаТовары.ПредставлениеНДС = ?(текСтрока.СтавкаНДС.Предопределенный=Истина, Справочники.СтавкиНДС.ПолучитьИмяПредопределенного(текСтрока.СтавкаНДС), СокрЛП(текСтрока.СтавкаНДС));
						СтрокаТовары.БезНДС = (текСтрока.СтавкаНДС=Справочники.СтавкиНДС.БезНДС);
	
						УзелДокумент.Товары.Добавить(СтрокаТовары);
					КонецЦикла;    
								
				ИначеЕсли текЭлемент = "НЭПереоценкаВтор" Тогда
					УзелДокумент.ДополнительныеРеквизиты.Вставить("ТочкаОформления", 	СокрЛП(ДокументСсылка.Основание.ТочкаОформления));
					УзелДокумент.ДополнительныеРеквизиты.Вставить("ТочкаОформленияУИД", СокрЛП(ДокументСсылка.Основание.ТочкаОформления.УникальныйИдентификатор()));				
					УзелДокумент.ДополнительныеРеквизиты.Вставить("Организация", 		СокрЛП(ДокументСсылка.Основание.Холдер));
					УзелДокумент.ДополнительныеРеквизиты.Вставить("ОрганизацияИНН", 	ДокументСсылка.Основание.Холдер.ИНН);
					УзелДокумент.ДополнительныеРеквизиты.Вставить("ОрганизацияКПП", 	ДокументСсылка.Основание.Холдер.КПП);		
					УзелДокумент.ДополнительныеРеквизиты.Вставить("Основание", 			СокрЛП(ДокументСсылка.Основание));
					УзелДокумент.ДополнительныеРеквизиты.Вставить("ОснованиеУИД", 		СокрЛП(ДокументСсылка.Основание.УникальныйИдентификатор()));
					УзелДокумент.ДополнительныеРеквизиты.Вставить("Сумма", 	   			ДокументСсылка.Сумма);
				ИначеЕсли текЭлемент="НЭРеализация" Тогда
					УзелДокумент.ДополнительныеРеквизиты.Вставить("ТочкаОформления", СокрЛП(ДокументСсылка.ТочкаОформления));
					УзелДокумент.ДополнительныеРеквизиты.Вставить("ТочкаОформленияУИД", СокрЛП(ДокументСсылка.ТочкаОформления.УникальныйИдентификатор()));
					
					УзелДокумент.ДополнительныеРеквизиты.Вставить("Организация", СокрЛП(ДокументСсылка.Холдер));
					УзелДокумент.ДополнительныеРеквизиты.Вставить("ОрганизацияИНН", ДокументСсылка.Холдер.ИНН);
					УзелДокумент.ДополнительныеРеквизиты.Вставить("ОрганизацияКПП", ДокументСсылка.Холдер.КПП);
					
					УзелДокумент.ДополнительныеРеквизиты.Вставить("Контрагент", СокрЛП(ДокументСсылка.Покупатель));
					УзелДокумент.ДополнительныеРеквизиты.Вставить("КонтрагентИНН", ДокументСсылка.Покупатель.ИНН);
					УзелДокумент.ДополнительныеРеквизиты.Вставить("КонтрагентКПП", ДокументСсылка.Покупатель.КПП);
					УзелДокумент.ДополнительныеРеквизиты.Вставить("КонтрагентУИД", СокрЛП(ДокументСсылка.Покупатель.УникальныйИдентификатор()));
					УзелДокумент.ДополнительныеРеквизиты.Вставить("КонтрагентФормаСобственности", СокрЛП(ДокументСсылка.Покупатель.ТипКонтрагента));
					
					УзелДокумент.ДополнительныеРеквизиты.Вставить("КонтрагентСтранаНаименование", ВРег(СокрЛП(ДокументСсылка.Покупатель.Страна.Наименование)));
					УзелДокумент.ДополнительныеРеквизиты.Вставить("КонтрагентСтранаКодОКСМ", СокрЛП(ДокументСсылка.Покупатель.Страна.КодОКСМ));
					УзелДокумент.ДополнительныеРеквизиты.Вставить("КонтрагентЭтоРезидент", ДокументСсылка.Покупатель.ПолучитьОбъект().ЭтоРезидент()); 
					
					Если ТипЗнч(ДокументСсылка.Получатель)=Тип("СправочникСсылка.Контрагенты") Тогда
						УзелДокумент.ДополнительныеРеквизиты.Вставить("Получатель", СокрЛП(ДокументСсылка.Получатель));
						УзелДокумент.ДополнительныеРеквизиты.Вставить("ПолучательИНН", ДокументСсылка.Получатель.ИНН);
						УзелДокумент.ДополнительныеРеквизиты.Вставить("ПолучательКПП", ДокументСсылка.Получатель.КПП);
						УзелДокумент.ДополнительныеРеквизиты.Вставить("ПолучательУИД", СокрЛП(ДокументСсылка.Получатель.УникальныйИдентификатор()));
						УзелДокумент.ДополнительныеРеквизиты.Вставить("ПолучательФормаСобственности", СокрЛП(ДокументСсылка.Получатель.ТипКонтрагента));
						
						УзелДокумент.ДополнительныеРеквизиты.Вставить("ПолучательСтранаНаименование", ВРег(СокрЛП(ДокументСсылка.Получатель.Страна.Наименование)));
						УзелДокумент.ДополнительныеРеквизиты.Вставить("ПолучательСтранаКодОКСМ", СокрЛП(ДокументСсылка.Получатель.Страна.КодОКСМ));
						УзелДокумент.ДополнительныеРеквизиты.Вставить("ПолучательЭтоРезидент", ДокументСсылка.Получатель.ПолучитьОбъект().ЭтоРезидент()); 
						
						УзелДокумент.ДополнительныеРеквизиты.Вставить("МежхолдернаяРеализация", Ложь);
					Иначе
						УзелДокумент.ДополнительныеРеквизиты.Вставить("Получатель", СокрЛП(ДокументСсылка.Получатель));
						УзелДокумент.ДополнительныеРеквизиты.Вставить("ПолучательИНН", "");
						УзелДокумент.ДополнительныеРеквизиты.Вставить("ПолучательКПП", "");
						УзелДокумент.ДополнительныеРеквизиты.Вставить("ПолучательУИД", СокрЛП(ДокументСсылка.Получатель.УникальныйИдентификатор()));
						УзелДокумент.ДополнительныеРеквизиты.Вставить("ПолучательФормаСобственности", "");
						
						УзелДокумент.ДополнительныеРеквизиты.Вставить("ПолучательСтранаНаименование", "");
						УзелДокумент.ДополнительныеРеквизиты.Вставить("ПолучательСтранаКодОКСМ", "");
						УзелДокумент.ДополнительныеРеквизиты.Вставить("ПолучательЭтоРезидент", Ложь); 
						
						УзелДокумент.ДополнительныеРеквизиты.Вставить("МежхолдернаяРеализация", Истина);
					КонецЕсли; 
					
					Если ЗначениеЗаполнено(ДокументСсылка.Основание)=Истина Тогда
						УзелДокумент.ДополнительныеРеквизиты.Вставить("Основание", СокрЛП(ДокументСсылка.Основание));
						УзелДокумент.ДополнительныеРеквизиты.Вставить("ОснованиеТип", СокрЛП(ТипЗнч(ДокументСсылка.Основание)));
						УзелДокумент.ДополнительныеРеквизиты.Вставить("ОснованиеНомер", СокрЛП(ДокументСсылка.Основание.Номер));
						УзелДокумент.ДополнительныеРеквизиты.Вставить("ОснованиеДата", ДокументСсылка.Основание.Дата);
						
						Если (ТипЗнч(ДокументСсылка.Основание)=Тип("ДокументСсылка.СделкаРеализации")) ИЛИ (ТипЗнч(ДокументСсылка.Основание)=Тип("ДокументСсылка.КонтрактРеализации")) Тогда
							УзелДокумент.ДополнительныеРеквизиты.ОснованиеНомер = СокрЛП(ДокументСсылка.Основание.НомерДоговора);
							УзелДокумент.ДополнительныеРеквизиты.ОснованиеДата = ДокументСсылка.Основание.ДатаДоговора;
						КонецЕсли; 
						
						УзелДокумент.ДополнительныеРеквизиты.Вставить("ОснованиеУИД", СокрЛП(ДокументСсылка.Основание.УникальныйИдентификатор()));
					Иначе
						УзелДокумент.ДополнительныеРеквизиты.Вставить("Основание", "");
						УзелДокумент.ДополнительныеРеквизиты.Вставить("ОснованиеТип", "");
						УзелДокумент.ДополнительныеРеквизиты.Вставить("ОснованиеНомер", "");
						УзелДокумент.ДополнительныеРеквизиты.Вставить("ОснованиеДата", "");
						УзелДокумент.ДополнительныеРеквизиты.Вставить("ОснованиеУИД", "");
					КонецЕсли; 
					
					Если ЗначениеЗаполнено(ДокументСсылка.Договор)=Истина Тогда
						УзелДокумент.ДополнительныеРеквизиты.Вставить("Договор", СокрЛП(ДокументСсылка.Договор));
						УзелДокумент.ДополнительныеРеквизиты.Вставить("ДоговорТип", СокрЛП(ТипЗнч(ДокументСсылка.Договор)));
						УзелДокумент.ДополнительныеРеквизиты.Вставить("ДоговорНомер", СокрЛП(ДокументСсылка.Договор.Номер));
						УзелДокумент.ДополнительныеРеквизиты.Вставить("ДоговорДата", ДокументСсылка.Договор.Дата);
						
						Если (ТипЗнч(ДокументСсылка.Договор)=Тип("ДокументСсылка.СделкаРеализации")) ИЛИ (ТипЗнч(ДокументСсылка.Договор)=Тип("ДокументСсылка.КонтрактРеализации")) Тогда
							УзелДокумент.ДополнительныеРеквизиты.ДоговорНомер = СокрЛП(ДокументСсылка.Договор.НомерДоговора);
							УзелДокумент.ДополнительныеРеквизиты.ДоговорДата = ДокументСсылка.Договор.ДатаДоговора;
						КонецЕсли; 
						
						УзелДокумент.ДополнительныеРеквизиты.Вставить("ДоговорУИД", СокрЛП(ДокументСсылка.Договор.УникальныйИдентификатор()));
					Иначе
						УзелДокумент.ДополнительныеРеквизиты.Вставить("Договор", "");
						УзелДокумент.ДополнительныеРеквизиты.Вставить("ДоговорТип", "");
						УзелДокумент.ДополнительныеРеквизиты.Вставить("ДоговорНомер", "");
						УзелДокумент.ДополнительныеРеквизиты.Вставить("ДоговорДата", "");
						УзелДокумент.ДополнительныеРеквизиты.Вставить("ДоговорУИД", "");
					КонецЕсли; 
					
					УзелДокумент.ДополнительныеРеквизиты.Вставить("СчетФактураНомер", СокрЛП(ДокументСсылка.СчфНомер));
					УзелДокумент.ДополнительныеРеквизиты.Вставить("СчетФактураДата", ДокументСсылка.Дата);
					
					Если ЗначениеЗаполнено(Выборка.ОтчетАгента)=Истина Тогда
						УзелДокумент.ДополнительныеРеквизиты.Вставить("ОтчетАгента", СокрЛП(Выборка.ОтчетАгента));
						УзелДокумент.ДополнительныеРеквизиты.Вставить("ОтчетАгентаТип", СокрЛП(ТипЗнч(Выборка.ОтчетАгента)));
						УзелДокумент.ДополнительныеРеквизиты.Вставить("ОтчетАгентаНомер", СокрЛП(Выборка.ОтчетАгента.Номер));
						УзелДокумент.ДополнительныеРеквизиты.Вставить("ОтчетАгентаДата", Выборка.ОтчетАгента.Дата);
						УзелДокумент.ДополнительныеРеквизиты.Вставить("ОтчетАгентаУИД", СокрЛП(Выборка.ОтчетАгента.УникальныйИдентификатор()));
					Иначе
						УзелДокумент.ДополнительныеРеквизиты.Вставить("ОтчетАгента", "");
						УзелДокумент.ДополнительныеРеквизиты.Вставить("ОтчетАгентаТип", "");
						УзелДокумент.ДополнительныеРеквизиты.Вставить("ОтчетАгентаНомер", "");
						УзелДокумент.ДополнительныеРеквизиты.Вставить("ОтчетАгентаДата", "");
						УзелДокумент.ДополнительныеРеквизиты.Вставить("ОтчетАгентаУИД", "");
					КонецЕсли; 
					
					Для каждого текСтрока Из ДокументСсылка.НомерныеЭлементы Цикл
						СтрокаТовары = Новый Структура("Номенклатура, НоменклатураУИД, НоменклатураВИН, НоменклатураБазовыйУИД, НоменклатураБазовыйВИН, НоменклатураПредставление, Цена, Количество, Сумма, СтавкаНДС, СуммаНДС, СуммаБезНДС, ПредставлениеНДС, БезНДС, БазаНДС");
						
						СтрокаТовары.Номенклатура = СокрЛП(текСтрока.НомернойЭлемент);
						СтрокаТовары.НоменклатураУИД = XMLСтрока(текСтрока.НомернойЭлемент);
						СтрокаТовары.НоменклатураВИН = СокрЛП(текСтрока.НомернойЭлемент.НомерАгрегата);  
						
						СтрокаТовары.Вставить("НоменклатураМодельнаяГруппа", СокрЛП(текСтрока.НомернойЭлемент.Модель.МодельнаяГруппа));
						СтрокаТовары.Вставить("НоменклатураМарка", СокрЛП(текСтрока.НомернойЭлемент.Модель.Марка));
						
						СтрокаТовары.НоменклатураБазовыйУИД = XMLСтрока(текСтрока.НомернойЭлемент);
						СтрокаТовары.НоменклатураБазовыйВИН = СокрЛП(текСтрока.НомернойЭлемент.НомерАгрегата);
						Если (ЗначениеЗаполнено(текСтрока.НомернойЭлемент.Спецификация)) Тогда
							Если ЗначениеЗаполнено(текСтрока.НомернойЭлемент.Родитель)=Истина Тогда
								СтрокаТовары.НоменклатураБазовыйУИД = XMLСтрока(текСтрока.НомернойЭлемент.Родитель);
								СтрокаТовары.НоменклатураБазовыйВИН = текСтрока.НомернойЭлемент.Родитель.НомерАгрегата;
							КонецЕсли;
						КонецЕсли;
						
						СтрокаТовары.НоменклатураПредставление = СокрЛП(текСтрока.НомернойЭлемент.ПолучитьОбъект().ПредставлениеПолное());
						
						СтрокаТовары.Цена = текСтрока.ВсегоСНДС;
						СтрокаТовары.Количество = 1;
						СтрокаТовары.Сумма = текСтрока.ВсегоСНДС;
						
						СтрПараметры = Новый Структура;
						СтрПараметры.Вставить("Дата",ДокументСсылка.Дата);
						СтрПараметры.Вставить("Цена",ТекСтрока.ВсегоСНДС);
						СтрПараметры.Вставить("Холдер",ДокументСсылка.Холдер);
						СтрПараметры.Вставить("Автомобиль",ТекСтрока.НомернойЭлемент);
						СтрПродажи = ДвижениеНЭ.СтруктураЦеныПродажиПолучить(СтрПараметры);
						
						СтавкаНДС = ?(ЗначениеЗаполнено(СтрПродажи.СтавкаНДС)=Истина, СтрПродажи.СтавкаНДС, текСтрока.СтавкаНДС); 
						
						Если СтавкаНДС = Справочники.СтавкиНДС.МЦР20 ИЛИ СтавкаНДС = Справочники.СтавкиНДС.МЦР22 Тогда 
							СтрокаТовары.СтавкаНДС = СтавкаНДС.Ставка;
							СтрокаТовары.СуммаНДС = СтрПродажи.СуммаНДС;
							СтрокаТовары.СуммаБезНДС = СтрПродажи.СуммаБезНДС;
							СтрокаТовары.ПредставлениеНДС = СокрЛП(СтавкаНДС);
							СтрокаТовары.БезНДС = (СтавкаНДС=Справочники.СтавкиНДС.БезНДС);
							СтрокаТовары.БазаНДС = СтрПродажи.БазаНДС ;
						Иначе
							СтрокаТовары.СтавкаНДС = СтавкаНДС.Ставка;
							СтрокаТовары.СуммаНДС = Окр(Конвертация.НдсОтСуммыПолучить(ТекСтрока.ВсегоСНДС,СтавкаНДС),2);
							СтрокаТовары.СуммаБезНДС = (ТекСтрока.ВсегоСНДС - СтрокаТовары.СуммаНДС);
							СтрокаТовары.ПредставлениеНДС = СокрЛП(СтавкаНДС);
							СтрокаТовары.БезНДС = (СтавкаНДС=Справочники.СтавкиНДС.БезНДС);
							СтрокаТовары.БазаНДС = ТекСтрока.ВсегоСНДС ;
						КонецЕсли;
						
						ТекСтатус = ДвижениеНЭ.ДвижениеПолучить(ТекСтрока.НомернойЭлемент,ДокументСсылка.Дата);
						Если (ТипЗнч(ТекСтатус) = Тип("Структура")) Тогда
							СтрокаТовары.Вставить("МестоХранения", СокрЛП(ТекСтатус.МестоХранения));
							СтрокаТовары.Вставить("МестоХраненияУИД", СокрЛП(ТекСтатус.МестоХранения.УникальныйИдентификатор()));
						КонецЕсли;
						
						УзелДокумент.Товары.Добавить(СтрокаТовары);
					КонецЦикла; 
				ИначеЕсли (текЭлемент="КСОСделкаСтрахование") Тогда
					УзелДокумент.ДополнительныеРеквизиты.Вставить("ТочкаОформления", СокрЛП(ДокументСсылка.ТочкаОформления));
					УзелДокумент.ДополнительныеРеквизиты.Вставить("ТочкаОформленияУИД", СокрЛП(ДокументСсылка.ТочкаОформления.УникальныйИдентификатор()));
					
					УзелДокумент.ДополнительныеРеквизиты.Вставить("КонтрагентНаименование", СокрЛП(ДокументСсылка.Контрагент));
					
					Для каждого текСтрока Из ДокументСсылка.Услуги Цикл
						Если (ЗначениеЗаполнено(ОрганизацияИНН)=Истина) И (текСтрока.Холдер.ИНН<>ОрганизацияИНН) Тогда
							Продолжить;							
						КонецЕсли; 
						
						СтрокаТовары = Новый Структура;
						
						СтрокаТовары.Вставить("Организация", СокрЛП(текСтрока.Холдер));
						СтрокаТовары.Вставить("ОрганизацияИНН", текСтрока.Холдер.ИНН);
						СтрокаТовары.Вставить("ОрганизацияКПП", текСтрока.Холдер.КПП);
						
						СтрокаТовары.Вставить("СтраховаяКомпания", СокрЛП(текСтрока.СтраховаяКомпания));
						СтрокаТовары.Вставить("СтраховаяКомпанияУИД", СокрЛП(текСтрока.СтраховаяКомпания.УникальныйИдентификатор()));
						
						Если ЗначениеЗаполнено(текСтрока.Договор.Поставщик)=Истина Тогда
							СтрокаТовары.Вставить("Контрагент", СокрЛП(текСтрока.Договор.Поставщик));
							СтрокаТовары.Вставить("КонтрагентИНН", текСтрока.Договор.Поставщик.ИНН);
							СтрокаТовары.Вставить("КонтрагентКПП", текСтрока.Договор.Поставщик.КПП);
							СтрокаТовары.Вставить("КонтрагентУИД", СокрЛП(текСтрока.Договор.Поставщик.УникальныйИдентификатор()));
							СтрокаТовары.Вставить("КонтрагентФормаСобственности", СокрЛП(текСтрока.Договор.Поставщик.ТипКонтрагента));
							
							СтрокаТовары.Вставить("КонтрагентСтранаНаименование", ВРег(СокрЛП(текСтрока.Договор.Поставщик.Страна.Наименование)));
							СтрокаТовары.Вставить("КонтрагентСтранаКодОКСМ", СокрЛП(текСтрока.Договор.Поставщик.Страна.КодОКСМ));
							СтрокаТовары.Вставить("КонтрагентЭтоРезидент", текСтрока.Договор.Поставщик.ПолучитьОбъект().ЭтоРезидент()); 
						Иначе
							СтрокаТовары.Вставить("Контрагент", "");
							СтрокаТовары.Вставить("КонтрагентИНН", "");
							СтрокаТовары.Вставить("КонтрагентКПП", "");
							СтрокаТовары.Вставить("КонтрагентУИД", "");
							СтрокаТовары.Вставить("КонтрагентФормаСобственности", "");
							
							СтрокаТовары.Вставить("КонтрагентСтранаНаименование", "");
							СтрокаТовары.Вставить("КонтрагентСтранаКодОКСМ", "");
							СтрокаТовары.Вставить("КонтрагентЭтоРезидент", ЛОЖЬ); 
						КонецЕсли; 
						
						СтрокаТовары.Вставить("Договор", СокрЛП(текСтрока.Договор));
						СтрокаТовары.Вставить("ДоговорНомер", СокрЛП(текСтрока.Договор.Номер));
						СтрокаТовары.Вставить("ДоговорДата", текСтрока.Договор.Дата);
						СтрокаТовары.Вставить("ДоговорУИД", СокрЛП(текСтрока.Договор.УникальныйИдентификатор()));
						СтрокаТовары.Вставить("ДоговорПрямаяОплата", текСтрока.Договор.ПрямаяОплата);
						
						СтрокаТовары.Вставить("Бланк", СокрЛП(текСтрока.Бланк));
						СтрокаТовары.Вставить("ТипБланка", СокрЛП(текСтрока.Тип));
						
						СтрокаТовары.Вставить("Сумма", текСтрока.ВсегоСНДС);
						СтрокаТовары.Вставить("СуммаКомиссии", текСтрока.СуммаКомиссии);
						
						СтрокаТовары.Вставить("ФормаОплаты", ?(ЗначениеЗаполнено(текСтрока.ФормаОплаты)=Истина, XMLСтрока(текСтрока.ФормаОплаты), XMLСтрока(Перечисления.ФормаОплатыКСО.Наличные)));
						
						УзелДокумент.Товары.Добавить(СтрокаТовары);
					КонецЦикла; 
				ИначеЕсли (текЭлемент="НЭДоработка") Тогда
					УзелДокумент.ДополнительныеРеквизиты.Вставить("ТочкаОформления", СокрЛП(ДокументСсылка.ТочкаОформления));
					УзелДокумент.ДополнительныеРеквизиты.Вставить("ТочкаОформленияУИД", СокрЛП(ДокументСсылка.ТочкаОформления.УникальныйИдентификатор()));
					
					УзелДокумент.ДополнительныеРеквизиты.Вставить("Организация", СокрЛП(ДокументСсылка.Холдер));
					УзелДокумент.ДополнительныеРеквизиты.Вставить("ОрганизацияИНН", ДокументСсылка.Холдер.ИНН);
					УзелДокумент.ДополнительныеРеквизиты.Вставить("ОрганизацияКПП", ДокументСсылка.Холдер.КПП);
					
					УзелДокумент.ДополнительныеРеквизиты.Вставить("Контрагент", СокрЛП(ДокументСсылка.Подрядчик));
					УзелДокумент.ДополнительныеРеквизиты.Вставить("КонтрагентИНН", ДокументСсылка.Подрядчик.ИНН);
					УзелДокумент.ДополнительныеРеквизиты.Вставить("КонтрагентКПП", ДокументСсылка.Подрядчик.КПП);
					УзелДокумент.ДополнительныеРеквизиты.Вставить("КонтрагентУИД", СокрЛП(ДокументСсылка.Подрядчик.УникальныйИдентификатор()));
					УзелДокумент.ДополнительныеРеквизиты.Вставить("КонтрагентФормаСобственности", СокрЛП(ДокументСсылка.Подрядчик.ТипКонтрагента));
					
					УзелДокумент.ДополнительныеРеквизиты.Вставить("КонтрагентСтранаНаименование", ВРег(СокрЛП(ДокументСсылка.Подрядчик.Страна.Наименование)));
					УзелДокумент.ДополнительныеРеквизиты.Вставить("КонтрагентСтранаКодОКСМ", СокрЛП(ДокументСсылка.Подрядчик.Страна.КодОКСМ));
					УзелДокумент.ДополнительныеРеквизиты.Вставить("КонтрагентЭтоРезидент", ДокументСсылка.Подрядчик.ПолучитьОбъект().ЭтоРезидент()); 
					
					УзелДокумент.ДополнительныеРеквизиты.Вставить("АктНомер", СокрЛП(ДокументСсылка.ДокНомер));
					УзелДокумент.ДополнительныеРеквизиты.Вставить("АктДата", ДокументСсылка.ДокДата);
					
					УзелДокумент.ДополнительныеРеквизиты.Вставить("СчетФактураНомер", СокрЛП(ДокументСсылка.СчфНомер));
					УзелДокумент.ДополнительныеРеквизиты.Вставить("СчетФактураДата", ДокументСсылка.СчфДата);
					
					СтрокаТовары = Новый Структура("Номенклатура, НоменклатураУИД, НоменклатураВИН, Сумма, СуммаНДС, СтавкаНДС, ПредставлениеНДС, БезНДС");
					
					СтрокаТовары.Номенклатура = СокрЛП(ДокументСсылка.НомернойЭлемент);
					СтрокаТовары.НоменклатураУИД = СокрЛП(ДокументСсылка.НомернойЭлемент.УникальныйИдентификатор());
					СтрокаТовары.НоменклатураВИН = СокрЛП(ДокументСсылка.НомернойЭлемент.НомерАгрегата);
					
					СтрокаТовары.Вставить("НоменклатураМодельнаяГруппа", СокрЛП(ДокументСсылка.НомернойЭлемент.Модель.МодельнаяГруппа));
					СтрокаТовары.Вставить("НоменклатураМарка", СокрЛП(ДокументСсылка.НомернойЭлемент.Модель.Марка));
					
					СтрокаТовары.Сумма = ДокументСсылка.СуммаВсего;
					СтрокаТовары.СуммаНДС = Окр(Конвертация.НдсОтСуммыПолучить(ДокументСсылка.СуммаВсего, ДокументСсылка.СтавкаНДС),2); 
					
					СтрокаТовары.СтавкаНДС = ДокументСсылка.СтавкаНДС.Ставка;
					СтрокаТовары.ПредставлениеНДС = СокрЛП(ДокументСсылка.СтавкаНДС);
					СтрокаТовары.БезНДС = (ДокументСсылка.СтавкаНДС=Справочники.СтавкиНДС.БезНДС);
					
					УзелДокумент.Товары.Добавить(СтрокаТовары);
				ИначеЕсли (текЭлемент="НЭПередачаНаПереработку") Тогда
					УзелДокумент.ДополнительныеРеквизиты.Вставить("ТочкаОформления", СокрЛП(ДокументСсылка.ТочкаОформления));
					УзелДокумент.ДополнительныеРеквизиты.Вставить("ТочкаОформленияУИД", СокрЛП(ДокументСсылка.ТочкаОформления.УникальныйИдентификатор()));
					
					УзелДокумент.ДополнительныеРеквизиты.Вставить("Организация", СокрЛП(ДокументСсылка.Холдер));
					УзелДокумент.ДополнительныеРеквизиты.Вставить("ОрганизацияИНН", ДокументСсылка.Холдер.ИНН);
					УзелДокумент.ДополнительныеРеквизиты.Вставить("ОрганизацияКПП", ДокументСсылка.Холдер.КПП);
					
					УзелДокумент.ДополнительныеРеквизиты.Вставить("Контрагент", СокрЛП(ДокументСсылка.Подрядчик));
					УзелДокумент.ДополнительныеРеквизиты.Вставить("КонтрагентИНН", ДокументСсылка.Подрядчик.ИНН);
					УзелДокумент.ДополнительныеРеквизиты.Вставить("КонтрагентКПП", ДокументСсылка.Подрядчик.КПП);
					УзелДокумент.ДополнительныеРеквизиты.Вставить("КонтрагентУИД", СокрЛП(ДокументСсылка.Подрядчик.УникальныйИдентификатор()));
					УзелДокумент.ДополнительныеРеквизиты.Вставить("КонтрагентФормаСобственности", СокрЛП(ДокументСсылка.Подрядчик.ТипКонтрагента));
					
					УзелДокумент.ДополнительныеРеквизиты.Вставить("КонтрагентСтранаНаименование", ВРег(СокрЛП(ДокументСсылка.Подрядчик.Страна.Наименование)));
					УзелДокумент.ДополнительныеРеквизиты.Вставить("КонтрагентСтранаКодОКСМ", СокрЛП(ДокументСсылка.Подрядчик.Страна.КодОКСМ));
					УзелДокумент.ДополнительныеРеквизиты.Вставить("КонтрагентЭтоРезидент", ДокументСсылка.Подрядчик.ПолучитьОбъект().ЭтоРезидент()); 
					
					Если ЗначениеЗаполнено(ДокументСсылка.Основание.Договор)=Истина Тогда
						УзелДокумент.ДополнительныеРеквизиты.Вставить("Договор", СокрЛП(ДокументСсылка.Основание.Договор));
						УзелДокумент.ДополнительныеРеквизиты.Вставить("ДоговорТип", СокрЛП(ТипЗнч(ДокументСсылка.Основание.Договор)));
						УзелДокумент.ДополнительныеРеквизиты.Вставить("ДоговорНомер", СокрЛП(ДокументСсылка.Основание.Договор.Номер));
						УзелДокумент.ДополнительныеРеквизиты.Вставить("ДоговорДата", ДокументСсылка.Основание.Договор.Дата);
						УзелДокумент.ДополнительныеРеквизиты.Вставить("ДоговорУИД", СокрЛП(ДокументСсылка.Основание.Договор.УникальныйИдентификатор()));
					Иначе
						УзелДокумент.ДополнительныеРеквизиты.Вставить("Договор", "");
						УзелДокумент.ДополнительныеРеквизиты.Вставить("ДоговорТип", "");
						УзелДокумент.ДополнительныеРеквизиты.Вставить("ДоговорНомер", "");
						УзелДокумент.ДополнительныеРеквизиты.Вставить("ДоговорДата", "");
						УзелДокумент.ДополнительныеРеквизиты.Вставить("ДоговорУИД", "");
					КонецЕсли; 
					
					Для каждого текСтрока Из ДокументСсылка.НомерныеЭлементы Цикл
						СтрокаТовары = Новый Структура;
						
						СтрокаТовары.Вставить("Автомобиль", СокрЛП(текСтрока.НомернойЭлемент));
						СтрокаТовары.Вставить("АвтомобильУИД", СокрЛП(текСтрока.НомернойЭлемент.УникальныйИдентификатор()));
						СтрокаТовары.Вставить("АвтомобильВИН", СокрЛП(текСтрока.НомернойЭлемент.НомерАгрегата));
						СтрокаТовары.Вставить("АвтомобильМодельнаяГруппа",  СокрЛП(текСтрока.НомернойЭлемент.Модель.МодельнаяГруппа));
						СтрокаТовары.Вставить("АвтомобильМарка",  СокрЛП(текСтрока.НомернойЭлемент.Модель.Марка));
						
						СтрокаТовары.Вставить("СтоимостьДоставки", текСтрока.СтоимостьДоставки);
						
						УзелДокумент.Товары.Добавить(СтрокаТовары);
					КонецЦикла; 
				ИначеЕсли (текЭлемент="НЭПриемИзПереработки") Тогда
					УзелДокумент.ДополнительныеРеквизиты.Вставить("ТочкаОформления", СокрЛП(ДокументСсылка.ТочкаОформления));
					УзелДокумент.ДополнительныеРеквизиты.Вставить("ТочкаОформленияУИД", СокрЛП(ДокументСсылка.ТочкаОформления.УникальныйИдентификатор()));
					
					УзелДокумент.ДополнительныеРеквизиты.Вставить("Организация", СокрЛП(ДокументСсылка.Холдер));
					УзелДокумент.ДополнительныеРеквизиты.Вставить("ОрганизацияИНН", ДокументСсылка.Холдер.ИНН);
					УзелДокумент.ДополнительныеРеквизиты.Вставить("ОрганизацияКПП", ДокументСсылка.Холдер.КПП);
					
					УзелДокумент.ДополнительныеРеквизиты.Вставить("Контрагент", СокрЛП(ДокументСсылка.Подрядчик));
					УзелДокумент.ДополнительныеРеквизиты.Вставить("КонтрагентИНН", ДокументСсылка.Подрядчик.ИНН);
					УзелДокумент.ДополнительныеРеквизиты.Вставить("КонтрагентКПП", ДокументСсылка.Подрядчик.КПП);
					УзелДокумент.ДополнительныеРеквизиты.Вставить("КонтрагентУИД", СокрЛП(ДокументСсылка.Подрядчик.УникальныйИдентификатор()));
					УзелДокумент.ДополнительныеРеквизиты.Вставить("КонтрагентФормаСобственности", СокрЛП(ДокументСсылка.Подрядчик.ТипКонтрагента));
					
					УзелДокумент.ДополнительныеРеквизиты.Вставить("КонтрагентСтранаНаименование", ВРег(СокрЛП(ДокументСсылка.Подрядчик.Страна.Наименование)));
					УзелДокумент.ДополнительныеРеквизиты.Вставить("КонтрагентСтранаКодОКСМ", СокрЛП(ДокументСсылка.Подрядчик.Страна.КодОКСМ));
					УзелДокумент.ДополнительныеРеквизиты.Вставить("КонтрагентЭтоРезидент", ДокументСсылка.Подрядчик.ПолучитьОбъект().ЭтоРезидент()); 
					
					УзелДокумент.ДополнительныеРеквизиты.Вставить("НомерВходящегоДокумента", СокрЛП(ДокументСсылка.Номер));
					УзелДокумент.ДополнительныеРеквизиты.Вставить("ДатаВходящегоДокумента", ДокументСсылка.ВхДата);
					
					УзелДокумент.ДополнительныеРеквизиты.Вставить("СчетФактураНомер", СокрЛП(ДокументСсылка.СчфНомер));
					УзелДокумент.ДополнительныеРеквизиты.Вставить("СчетФактураДата", ДокументСсылка.СчфДата);
					
					Для каждого текСтрока Из ДокументСсылка.НомерныеЭлементы Цикл
						СтрокаТовары = Новый Структура;
						
						СтрокаТовары.Вставить("БазовыйАвтомобиль", СокрЛП(текСтрока.НЭБазовый));
						СтрокаТовары.Вставить("БазовыйАвтомобильУИД", СокрЛП(текСтрока.НЭБазовый.УникальныйИдентификатор()));
						СтрокаТовары.Вставить("БазовыйАвтомобильВИН", СокрЛП(текСтрока.НЭБазовый.НомерАгрегата));
						СтрокаТовары.Вставить("БазовыйАвтомобильМодельнаяГруппа",  СокрЛП(текСтрока.НЭБазовый.Модель.МодельнаяГруппа));
						СтрокаТовары.Вставить("БазовыйАвтомобильМарка",  СокрЛП(текСтрока.НЭБазовый.Модель.Марка));
						
						СтрокаТовары.Вставить("Автомобиль", СокрЛП(текСтрока.НЭНовый));
						СтрокаТовары.Вставить("АвтомобильУИД", СокрЛП(текСтрока.НЭНовый.УникальныйИдентификатор()));
						СтрокаТовары.Вставить("АвтомобильВИН", СокрЛП(текСтрока.НЭНовый.НомерАгрегата));
						СтрокаТовары.Вставить("АвтомобильМодельнаяГруппа",  СокрЛП(текСтрока.НЭНовый.Модель.МодельнаяГруппа));
						СтрокаТовары.Вставить("АвтомобильМарка",  СокрЛП(текСтрока.НЭНовый.Модель.Марка));
						
						СтрокаТовары.Вставить("ВсегоСНДС", текСтрока.ВсегоСНДС);
						
						Если ЗначениеЗаполнено(текСтрока.Основание.Договор)=Истина Тогда
							СтрокаТовары.Вставить("Договор", СокрЛП(текСтрока.Основание.Договор));
							СтрокаТовары.Вставить("ДоговорТип", СокрЛП(ТипЗнч(текСтрока.Основание.Договор)));
							СтрокаТовары.Вставить("ДоговорНомер", СокрЛП(текСтрока.Основание.Договор.Номер));
							СтрокаТовары.Вставить("ДоговорДата", текСтрока.Основание.Договор.Дата);
							СтрокаТовары.Вставить("ДоговорУИД", СокрЛП(текСтрока.Основание.Договор.УникальныйИдентификатор()));
						Иначе
							СтрокаТовары.Вставить("Договор", "");
							СтрокаТовары.Вставить("ДоговорТип", "");
							СтрокаТовары.Вставить("ДоговорНомер", "");
							СтрокаТовары.Вставить("ДоговорДата", "");
							СтрокаТовары.Вставить("ДоговорУИД", "");
						КонецЕсли; 
						
						Если ЗначениеЗаполнено(текСтрока.Основание)=Истина Тогда
							СтрокаТовары.Вставить("ЗаявкаНомер", СокрЛП(текСтрока.Основание.Номер));
							СтрокаТовары.Вставить("ЗаявкаДата", СокрЛП(текСтрока.Основание.Дата));
							СтрокаТовары.Вставить("ЗаявкаУИД", СокрЛП(текСтрока.Основание.УникальныйИдентификатор()));
						Иначе
							СтрокаТовары.Вставить("ЗаявкаНомер", "");
							СтрокаТовары.Вставить("ЗаявкаДата", "");
							СтрокаТовары.Вставить("ЗаявкаУИД", "");
						КонецЕсли; 
						
						УзелДокумент.Товары.Добавить(СтрокаТовары);
					КонецЦикла; 
				ИначеЕсли (текЭлемент="НЭДоукомплектация") Тогда
					УзелДокумент.ДополнительныеРеквизиты.Вставить("ТочкаОформления", СокрЛП(ДокументСсылка.ТочкаОформления));
					УзелДокумент.ДополнительныеРеквизиты.Вставить("ТочкаОформленияУИД", СокрЛП(ДокументСсылка.ТочкаОформления.УникальныйИдентификатор()));
					
					УзелДокумент.ДополнительныеРеквизиты.Вставить("Организация", СокрЛП(ДокументСсылка.Холдер));
					УзелДокумент.ДополнительныеРеквизиты.Вставить("ОрганизацияИНН", ДокументСсылка.Холдер.ИНН);
					УзелДокумент.ДополнительныеРеквизиты.Вставить("ОрганизацияКПП", ДокументСсылка.Холдер.КПП);
					
					УзелДокумент.ДополнительныеРеквизиты.Вставить("Автомобиль", СокрЛП(ДокументСсылка.НомернойЭлемент));
					УзелДокумент.ДополнительныеРеквизиты.Вставить("АвтомобильУИД", СокрЛП(ДокументСсылка.НомернойЭлемент.УникальныйИдентификатор()));
					УзелДокумент.ДополнительныеРеквизиты.Вставить("АвтомобильВИН", СокрЛП(ДокументСсылка.НомернойЭлемент.НомерАгрегата));
					УзелДокумент.ДополнительныеРеквизиты.Вставить("АвтомобильМодельнаяГруппа",  СокрЛП(ДокументСсылка.НомернойЭлемент.Модель.МодельнаяГруппа));
					УзелДокумент.ДополнительныеРеквизиты.Вставить("АвтомобильМарка",  СокрЛП(ДокументСсылка.НомернойЭлемент.Модель.Марка));
					
					Для каждого текСтрока Из ДокументСсылка.Материалы Цикл
						СтрокаТовары = Новый Структура("Номенклатура, НоменклатураУИД, Количество, Цена, Сумма");
						
						СтрокаТовары.Номенклатура = СокрЛП(текСтрока.Материал);
						СтрокаТовары.НоменклатураУИД = СокрЛП(текСтрока.Материал.УникальныйИдентификатор());
						
						СтрокаТовары.Количество = текСтрока.Количество;
						СтрокаТовары.Цена = текСтрока.ЦенаСНДС;
						СтрокаТовары.Сумма = текСтрока.ВсегоСНДС;
						
						УзелДокумент.Товары.Добавить(СтрокаТовары);
					КонецЦикла; 
				ИначеЕсли (текЭлемент="ГАЗНЭЗакупка") ИЛИ (текЭлемент="НЭЗакупка") Тогда
					УзелДокумент.ДополнительныеРеквизиты.Вставить("ТочкаОформления", СокрЛП(ДокументСсылка.ТочкаОформления));
					УзелДокумент.ДополнительныеРеквизиты.Вставить("ТочкаОформленияУИД", СокрЛП(ДокументСсылка.ТочкаОформления.УникальныйИдентификатор()));
					
					УзелДокумент.ДополнительныеРеквизиты.Вставить("Организация", СокрЛП(ДокументСсылка.Холдер));
					УзелДокумент.ДополнительныеРеквизиты.Вставить("ОрганизацияИНН", ДокументСсылка.Холдер.ИНН);
					УзелДокумент.ДополнительныеРеквизиты.Вставить("ОрганизацияКПП", ДокументСсылка.Холдер.КПП);
					
					УзелДокумент.ДополнительныеРеквизиты.Вставить("МестоХранения", СокрЛП(ДокументСсылка.МестоХранения));
					УзелДокумент.ДополнительныеРеквизиты.Вставить("МестоХраненияУИД", СокрЛП(ДокументСсылка.МестоХранения.УникальныйИдентификатор()));
					
					УзелДокумент.ДополнительныеРеквизиты.Вставить("Контрагент", СокрЛП(ДокументСсылка.Поставщик));
					УзелДокумент.ДополнительныеРеквизиты.Вставить("КонтрагентИНН", ДокументСсылка.Поставщик.ИНН);
					УзелДокумент.ДополнительныеРеквизиты.Вставить("КонтрагентКПП", ДокументСсылка.Поставщик.КПП);
					УзелДокумент.ДополнительныеРеквизиты.Вставить("КонтрагентУИД", СокрЛП(ДокументСсылка.Поставщик.УникальныйИдентификатор()));
					УзелДокумент.ДополнительныеРеквизиты.Вставить("КонтрагентФормаСобственности", СокрЛП(ДокументСсылка.Поставщик.ТипКонтрагента));
					
					УзелДокумент.ДополнительныеРеквизиты.Вставить("КонтрагентСтранаНаименование", ВРег(СокрЛП(ДокументСсылка.Поставщик.Страна.Наименование)));
					УзелДокумент.ДополнительныеРеквизиты.Вставить("КонтрагентСтранаКодОКСМ", СокрЛП(ДокументСсылка.Поставщик.Страна.КодОКСМ));
					УзелДокумент.ДополнительныеРеквизиты.Вставить("КонтрагентЭтоРезидент", ДокументСсылка.Поставщик.ПолучитьОбъект().ЭтоРезидент()); 
					
					Если  ЗначениеЗаполнено(ДокументСсылка.Договор)=Истина Тогда
						УзелДокумент.ДополнительныеРеквизиты.Вставить("Договор", СокрЛП(ДокументСсылка.Договор));
						УзелДокумент.ДополнительныеРеквизиты.Вставить("ДоговорТип", СокрЛП(ТипЗнч(ДокументСсылка.Договор)));   
						Доступно = ТипЗнч(ДокументСсылка.Договор) = Тип("ДокументСсылка.НЭДоговорЗакупки");
						Если Доступно Тогда
							УзелДокумент.ДополнительныеРеквизиты.Вставить("ДоговорНомер", СокрЛП(ДокументСсылка.Договор.ВхНомер));
						Иначе     
							УзелДокумент.ДополнительныеРеквизиты.Вставить("ДоговорНомер", СокрЛП(ДокументСсылка.Договор.Номер));	
						КонецЕсли;
						УзелДокумент.ДополнительныеРеквизиты.Вставить("ДоговорДата", ДокументСсылка.Договор.Дата);
						УзелДокумент.ДополнительныеРеквизиты.Вставить("ДоговорУИД", СокрЛП(ДокументСсылка.Договор.УникальныйИдентификатор()));
					Иначе
						УзелДокумент.ДополнительныеРеквизиты.Вставить("Договор", "");
						УзелДокумент.ДополнительныеРеквизиты.Вставить("ДоговорТип", "");
						УзелДокумент.ДополнительныеРеквизиты.Вставить("ДоговорНомер", "");
						УзелДокумент.ДополнительныеРеквизиты.Вставить("ДоговорДата", "");
						УзелДокумент.ДополнительныеРеквизиты.Вставить("ДоговорУИД", "");
					КонецЕсли; 
					
					Если ЗначениеЗаполнено(ДокументСсылка.Основание)=Истина Тогда
						УзелДокумент.ДополнительныеРеквизиты.Вставить("Основание", СокрЛП(ДокументСсылка.Основание));
						УзелДокумент.ДополнительныеРеквизиты.Вставить("ОснованиеТип", СокрЛП(ТипЗнч(ДокументСсылка.Основание)));
						УзелДокумент.ДополнительныеРеквизиты.Вставить("ОснованиеНомер", СокрЛП(ДокументСсылка.Основание.Номер));
						УзелДокумент.ДополнительныеРеквизиты.Вставить("ОснованиеДата", ДокументСсылка.Основание.Дата);
						УзелДокумент.ДополнительныеРеквизиты.Вставить("ОснованиеУИД", СокрЛП(ДокументСсылка.Основание.УникальныйИдентификатор()));
					Иначе
						УзелДокумент.ДополнительныеРеквизиты.Вставить("Основание", "");
						УзелДокумент.ДополнительныеРеквизиты.Вставить("ОснованиеТип", "");
						УзелДокумент.ДополнительныеРеквизиты.Вставить("ОснованиеНомер", "");
						УзелДокумент.ДополнительныеРеквизиты.Вставить("ОснованиеДата", "");
						УзелДокумент.ДополнительныеРеквизиты.Вставить("ОснованиеУИД", "");
					КонецЕсли;
					
					Если (текЭлемент="ГАЗНЭЗакупка") Тогда 
						УзелДокумент.ДополнительныеРеквизиты.Вставить("НомерВходящегоДокумента", СокрЛП(ДокументСсылка.Номер));
						УзелДокумент.ДополнительныеРеквизиты.Вставить("ДатаВходящегоДокумента", ДокументСсылка.Дата);
					Иначе
						УзелДокумент.ДополнительныеРеквизиты.Вставить("НомерВходящегоДокумента", СокрЛП(ДокументСсылка.ВхНомер));
						УзелДокумент.ДополнительныеРеквизиты.Вставить("ДатаВходящегоДокумента", ДокументСсылка.ВхДата);
					КонецЕсли;
					
					УзелДокумент.ДополнительныеРеквизиты.Вставить("СчетФактураНомер", СокрЛП(ДокументСсылка.СчфНомер));
					УзелДокумент.ДополнительныеРеквизиты.Вставить("СчетФактураДата", ДокументСсылка.СчфДата);
					
					Для каждого текСтрока Из ДокументСсылка.НомерныеЭлементы Цикл
						СтрокаТовары = Новый Структура("Номенклатура, НоменклатураУИД, НоменклатураВИН, Цена, Количество, Сумма, СтавкаНДС, СуммаНДС, ПредставлениеНДС, БезНДС");
						
						СтрокаТовары.Номенклатура = СокрЛП(текСтрока.НомернойЭлемент);
						СтрокаТовары.НоменклатураУИД = СокрЛП(текСтрока.НомернойЭлемент.УникальныйИдентификатор());
						СтрокаТовары.НоменклатураВИН = СокрЛП(текСтрока.НомернойЭлемент.НомерАгрегата);
						
						СтрокаТовары.Вставить("НоменклатураМодельнаяГруппа", СокрЛП(текСтрока.НомернойЭлемент.Модель.МодельнаяГруппа));
						СтрокаТовары.Вставить("НоменклатураМарка", СокрЛП(текСтрока.НомернойЭлемент.Модель.Марка));
						
						СтрокаТовары.Цена = текСтрока.ВсегоСНДС;
						СтрокаТовары.Количество = 1;
						СтрокаТовары.Сумма = текСтрока.ВсегоСНДС;
						
						Если (текЭлемент="ГАЗНЭЗакупка") Тогда
							СтавкаНДС = ЗначенияСервера.ПолучитьОсновнуюСтавкуНДС(ДокументСсылка.Дата);		
						Иначе
							СтавкаНДС = текСтрока.СтавкаНДС;
						КонецЕсли;
						
						СтрокаТовары.СтавкаНДС = СтавкаНДС.Ставка;
						СтрокаТовары.СуммаНДС = Окр(Конвертация.НдсОтСуммыПолучить(текСтрока.ВсегоСНДС,СтавкаНДС),2);
						СтрокаТовары.ПредставлениеНДС = СокрЛП(СтавкаНДС);
						СтрокаТовары.БезНДС = (СтавкаНДС=Справочники.СтавкиНДС.БезНДС);
						
						УзелДокумент.Товары.Добавить(СтрокаТовары);
					КонецЦикла; 
				ИначеЕсли текЭлемент="НЭОтчетАгента" Тогда
					УзелДокумент.ДополнительныеРеквизиты.Вставить("Состояние", ?(ЗначениеЗаполнено(ДокументСсылка.ДокРасход)=Ложь, "АГЕНТИРОВАНИЕ", ?(ТипЗнч(ДокументСсылка.ДокРасход)=Тип("ДокументСсылка.НЭРеализация"), "РЕАЛИЗАЦИЯ", "ВОЗВРАТ")));
					
					Если ЗначениеЗаполнено(ДокументСсылка.ДокПриход)=Истина Тогда
						УзелДокумент.ДополнительныеРеквизиты.Вставить("ТочкаОформленияПриход", СокрЛП(ДокументСсылка.ДокПриход.ТочкаОформления));
						УзелДокумент.ДополнительныеРеквизиты.Вставить("ТочкаОформленияПриходУИД", СокрЛП(ДокументСсылка.ДокПриход.ТочкаОформления.УникальныйИдентификатор()));
					Иначе
						УзелДокумент.ДополнительныеРеквизиты.Вставить("ТочкаОформленияПриход", "");
						УзелДокумент.ДополнительныеРеквизиты.Вставить("ТочкаОформленияПриходУИД", "");
					КонецЕсли; 
					Если ЗначениеЗаполнено(ДокументСсылка.ДокРасход)=Истина Тогда
						УзелДокумент.ДополнительныеРеквизиты.Вставить("ТочкаОформленияРасход", СокрЛП(ДокументСсылка.ДокРасход.ТочкаОформления));
						УзелДокумент.ДополнительныеРеквизиты.Вставить("ТочкаОформленияРасходУИД", СокрЛП(ДокументСсылка.ДокРасход.ТочкаОформления.УникальныйИдентификатор()));
					Иначе
						УзелДокумент.ДополнительныеРеквизиты.Вставить("ТочкаОформленияРасход", "");
						УзелДокумент.ДополнительныеРеквизиты.Вставить("ТочкаОформленияРасходУИД", "");
					КонецЕсли; 
					
					УзелДокумент.ДополнительныеРеквизиты.Вставить("Организация", СокрЛП(ДокументСсылка.Холдер));
					УзелДокумент.ДополнительныеРеквизиты.Вставить("ОрганизацияИНН", ДокументСсылка.Холдер.ИНН);
					УзелДокумент.ДополнительныеРеквизиты.Вставить("ОрганизацияКПП", ДокументСсылка.Холдер.КПП);
					
					УзелДокумент.ДополнительныеРеквизиты.Вставить("Контрагент", СокрЛП(ДокументСсылка.Контрагент));
					УзелДокумент.ДополнительныеРеквизиты.Вставить("КонтрагентИНН", ДокументСсылка.Контрагент.ИНН);
					УзелДокумент.ДополнительныеРеквизиты.Вставить("КонтрагентКПП", ДокументСсылка.Контрагент.КПП);
					УзелДокумент.ДополнительныеРеквизиты.Вставить("КонтрагентУИД", СокрЛП(ДокументСсылка.Контрагент.УникальныйИдентификатор()));
					УзелДокумент.ДополнительныеРеквизиты.Вставить("КонтрагентФормаСобственности", СокрЛП(ДокументСсылка.Контрагент.ТипКонтрагента));
					
					УзелДокумент.ДополнительныеРеквизиты.Вставить("КонтрагентСтранаНаименование", ВРег(СокрЛП(ДокументСсылка.Контрагент.Страна.Наименование)));
					УзелДокумент.ДополнительныеРеквизиты.Вставить("КонтрагентСтранаКодОКСМ", СокрЛП(ДокументСсылка.Контрагент.Страна.КодОКСМ));
					УзелДокумент.ДополнительныеРеквизиты.Вставить("КонтрагентЭтоРезидент", ДокументСсылка.Контрагент.ПолучитьОбъект().ЭтоРезидент()); 
					
					УзелДокумент.ДополнительныеРеквизиты.Вставить("Договор", СокрЛП(ДокументСсылка.Договор));
					УзелДокумент.ДополнительныеРеквизиты.Вставить("ДоговорТип", СокрЛП(ТипЗнч(ДокументСсылка.Договор)));
					УзелДокумент.ДополнительныеРеквизиты.Вставить("ДоговорНомер", СокрЛП(ДокументСсылка.Договор.Номер));
					УзелДокумент.ДополнительныеРеквизиты.Вставить("ДоговорДата", ДокументСсылка.Договор.Дата);
					УзелДокумент.ДополнительныеРеквизиты.Вставить("ДоговорУИД", СокрЛП(ДокументСсылка.Договор.УникальныйИдентификатор()));
					
					Если (ЗначениеЗаполнено(ДокументСсылка.ДокРасход)=Истина) И (ТипЗнч(ДокументСсылка.ДокРасход)=Тип("ДокументСсылка.НЭРеализация")) Тогда
						УзелДокумент.ДополнительныеРеквизиты.Вставить("Покупатель", СокрЛП(ДокументСсылка.ДокРасход.Покупатель));
						УзелДокумент.ДополнительныеРеквизиты.Вставить("ПокупательИНН", ДокументСсылка.ДокРасход.Покупатель.ИНН);
						УзелДокумент.ДополнительныеРеквизиты.Вставить("ПокупательКПП", ДокументСсылка.ДокРасход.Покупатель.КПП);
						УзелДокумент.ДополнительныеРеквизиты.Вставить("ПокупательУИД", СокрЛП(ДокументСсылка.ДокРасход.Покупатель.УникальныйИдентификатор()));
						УзелДокумент.ДополнительныеРеквизиты.Вставить("ПокупательФормаСобственности", СокрЛП(ДокументСсылка.ДокРасход.Покупатель.ТипКонтрагента));
						
						УзелДокумент.ДополнительныеРеквизиты.Вставить("ПокупательСтранаНаименование", ВРег(СокрЛП(ДокументСсылка.ДокРасход.Покупатель.Страна.Наименование)));
						УзелДокумент.ДополнительныеРеквизиты.Вставить("ПокупательСтранаКодОКСМ", СокрЛП(ДокументСсылка.ДокРасход.Покупатель.Страна.КодОКСМ));
						УзелДокумент.ДополнительныеРеквизиты.Вставить("ПокупательЭтоРезидент", ДокументСсылка.ДокРасход.Покупатель.ПолучитьОбъект().ЭтоРезидент()); 
						
						УзелДокумент.ДополнительныеРеквизиты.Вставить("РеализацияНомер", СокрЛП(ДокументСсылка.ДокРасход.Номер));
						УзелДокумент.ДополнительныеРеквизиты.Вставить("РеализацияДата", ДокументСсылка.ДокРасход.Дата);
						
						Если (ЗначениеЗаполнено(ДокументСсылка.ДокРасход.Основание)=Истина) Тогда
							УзелДокумент.ДополнительныеРеквизиты.Вставить("ПокупательДоговор", СокрЛП(ДокументСсылка.ДокРасход.Основание));
							УзелДокумент.ДополнительныеРеквизиты.Вставить("ПокупательДоговорНомер", ДокументСсылка.ДокРасход.Основание.Номер);
							УзелДокумент.ДополнительныеРеквизиты.Вставить("ПокупательДоговорДата", ДокументСсылка.ДокРасход.Основание.Дата);
							УзелДокумент.ДополнительныеРеквизиты.Вставить("ПокупательДоговорУИД", СокрЛП(ДокументСсылка.ДокРасход.Основание.УникальныйИдентификатор()));
							УзелДокумент.ДополнительныеРеквизиты.Вставить("ПокупательДоговорТип", ?(ТипЗнч(ДокументСсылка.ДокРасход.Основание)=Тип("ДокументСсылка.КонтрактРеализации"), "Контракт", "Договор"));
						Иначе
							УзелДокумент.ДополнительныеРеквизиты.Вставить("ПокупательДоговор", "");
							УзелДокумент.ДополнительныеРеквизиты.Вставить("ПокупательДоговорНомер", "");
							УзелДокумент.ДополнительныеРеквизиты.Вставить("ПокупательДоговорДата", "");
							УзелДокумент.ДополнительныеРеквизиты.Вставить("ПокупательДоговорУИД", "");
							УзелДокумент.ДополнительныеРеквизиты.Вставить("ПокупательДоговорТип", "");
						КонецЕсли; 
					Иначе
						УзелДокумент.ДополнительныеРеквизиты.Вставить("Покупатель", "");
						УзелДокумент.ДополнительныеРеквизиты.Вставить("ПокупательИНН", "");
						УзелДокумент.ДополнительныеРеквизиты.Вставить("ПокупательКПП", "");
						УзелДокумент.ДополнительныеРеквизиты.Вставить("ПокупательУИД", "");
						УзелДокумент.ДополнительныеРеквизиты.Вставить("ПокупательФормаСобственности", "");
						
						УзелДокумент.ДополнительныеРеквизиты.Вставить("ПокупательСтранаНаименование", "");
						УзелДокумент.ДополнительныеРеквизиты.Вставить("ПокупательСтранаКодОКСМ", "");
						УзелДокумент.ДополнительныеРеквизиты.Вставить("ПокупательЭтоРезидент", Ложь);  
						
						УзелДокумент.ДополнительныеРеквизиты.Вставить("РеализацияНомер", "");
						УзелДокумент.ДополнительныеРеквизиты.Вставить("РеализацияДата", "");
						
						УзелДокумент.ДополнительныеРеквизиты.Вставить("ПокупательДоговор", "");
						УзелДокумент.ДополнительныеРеквизиты.Вставить("ПокупательДоговорНомер", "");
						УзелДокумент.ДополнительныеРеквизиты.Вставить("ПокупательДоговорДата", "");
						УзелДокумент.ДополнительныеРеквизиты.Вставить("ПокупательДоговорУИД", "");
						УзелДокумент.ДополнительныеРеквизиты.Вставить("ПокупательДоговорТип", "");
					КонецЕсли; 
					
					Если (ЗначениеЗаполнено(ДокументСсылка.ДокПриход)=Истина) Тогда
						УзелДокумент.ДополнительныеРеквизиты.Вставить("ДокПриход", СокрЛП(ДокументСсылка.ДокПриход));
						УзелДокумент.ДополнительныеРеквизиты.Вставить("ДокПриходТип", СокрЛП(ТипЗнч(ДокументСсылка.ДокПриход)));
						УзелДокумент.ДополнительныеРеквизиты.Вставить("ДокПриходНомер", СокрЛП(ДокументСсылка.ДокПриход.Номер));
						УзелДокумент.ДополнительныеРеквизиты.Вставить("ДокПриходДата", ДокументСсылка.ДокПриход.Дата);
						УзелДокумент.ДополнительныеРеквизиты.Вставить("ДокПриходУИД", СокрЛП(ДокументСсылка.ДокПриход.УникальныйИдентификатор()));
					Иначе
						УзелДокумент.ДополнительныеРеквизиты.Вставить("ДокПриход", "");
						УзелДокумент.ДополнительныеРеквизиты.Вставить("ДокПриходТип", "");
						УзелДокумент.ДополнительныеРеквизиты.Вставить("ДокПриходНомер", "");
						УзелДокумент.ДополнительныеРеквизиты.Вставить("ДокПриходДата", "");
						УзелДокумент.ДополнительныеРеквизиты.Вставить("ДокПриходУИД", "");
					КонецЕсли;
					
					Если (ЗначениеЗаполнено(ДокументСсылка.ДокРасход)=Истина) Тогда
						УзелДокумент.ДополнительныеРеквизиты.Вставить("ДокРасход", СокрЛП(ДокументСсылка.ДокРасход));
						УзелДокумент.ДополнительныеРеквизиты.Вставить("ДокРасходТип", СокрЛП(ТипЗнч(ДокументСсылка.ДокРасход)));
						УзелДокумент.ДополнительныеРеквизиты.Вставить("ДокРасходНомер", СокрЛП(ДокументСсылка.ДокРасход.Номер));
						УзелДокумент.ДополнительныеРеквизиты.Вставить("ДокРасходДата", ДокументСсылка.ДокРасход.Дата);
						УзелДокумент.ДополнительныеРеквизиты.Вставить("ДокРасходУИД", СокрЛП(ДокументСсылка.ДокРасход.УникальныйИдентификатор()));
					Иначе
						УзелДокумент.ДополнительныеРеквизиты.Вставить("ДокРасход", "");
						УзелДокумент.ДополнительныеРеквизиты.Вставить("ДокРасходТип", "");
						УзелДокумент.ДополнительныеРеквизиты.Вставить("ДокРасходНомер", "");
						УзелДокумент.ДополнительныеРеквизиты.Вставить("ДокРасходДата", "");
						УзелДокумент.ДополнительныеРеквизиты.Вставить("ДокРасходУИД", "");
					КонецЕсли;
					
					СтрокаТовары = Новый Структура("Номенклатура, НоменклатураУИД, НоменклатураВИН, МинимальнаяЦенаПродажи, ЦенаРеализации, СтоимостьПосредника, СтавкаНДС, СуммаНДС, СуммаБезНДС, ПредставлениеНДС, БезНДС, БазаНДС");
					
					СтрокаТовары.Номенклатура = СокрЛП(ДокументСсылка.НомернойЭлемент);
					СтрокаТовары.НоменклатураУИД = СокрЛП(ДокументСсылка.НомернойЭлемент.УникальныйИдентификатор());
					СтрокаТовары.НоменклатураВИН = СокрЛП(ДокументСсылка.НомернойЭлемент.НомерАгрегата);
					
					СтрокаТовары.Вставить("НоменклатураМодельнаяГруппа", СокрЛП(ДокументСсылка.НомернойЭлемент.Модель.МодельнаяГруппа));
					СтрокаТовары.Вставить("НоменклатураМарка", СокрЛП(ДокументСсылка.НомернойЭлемент.Модель.Марка)); 
					
					СтрокаТовары.МинимальнаяЦенаПродажи = ДокументСсылка.ЦенаБазовая;
					
					СтрокаТовары.ЦенаРеализации = 0;
					СтрокаТовары.СтоимостьПосредника = 0;
					СтрокаТовары.СтавкаНДС = 0;
					СтрокаТовары.ПредставлениеНДС = СокрЛП(Справочники.СтавкиНДС.БезНДС);
					СтрокаТовары.БезНДС = Истина;
					СтрокаТовары.СуммаНДС = 0;  
					
					ДокПередачаНаХранение = ДокументСсылка.ДокПриход.Основание;					
					Если ТипЗнч(ДокПередачаНаХранение)=Тип("ДокументСсылка.НЭПередачаНаХранение") Тогда
						Доступно = (ТипЗнч(ДокПередачаНаХранение.Договор) = Тип("ДокументСсылка.ДоговорХолдерный"));
						Доступно = Доступно И (ДокПередачаНаХранение.Договор.ЭтоАгентский = Истина);  
						Доступно = Доступно И (ДокПередачаНаХранение.НомерныеЭлементы.Количество()>0);
						Если Доступно=Истина Тогда
							СтрокаТовары.Вставить("ОценкаСтоимостиПередачаНаХранение", ДокПередачаНаХранение.НомерныеЭлементы[0].ОценкаСтоимости);
						Иначе
							СтрокаТовары.Вставить("ОценкаСтоимостиПередачаНаХранение", 0);						
						КонецЕсли;
					Иначе
						СтрокаТовары.Вставить("ОценкаСтоимостиПередачаНаХранение", 0);						
					КонецЕсли;
					
					Если (ЗначениеЗаполнено(ДокументСсылка.ДокРасход)=Истина) И (ТипЗнч(ДокументСсылка.ДокРасход)=Тип("ДокументСсылка.НЭРеализация")) Тогда
						НайденныеСтроки = ДокументСсылка.ДокРасход.НомерныеЭлементы.НайтиСтроки(Новый Структура("НомернойЭлемент", ДокументСсылка.НомернойЭлемент)); 
						Для каждого текСтрока Из НайденныеСтроки Цикл
							СтрокаТовары.ЦенаРеализации = текСтрока.ВсегоСНДС;
							СтрокаТовары.СтоимостьПосредника = текСтрока.СтоимостьПосредника;
							
							СтрПараметры = Новый Структура;
							СтрПараметры.Вставить("Дата",ДокументСсылка.ДокРасход.Дата);
							СтрПараметры.Вставить("Цена",ТекСтрока.ВсегоСНДС);
							СтрПараметры.Вставить("Холдер",ДокументСсылка.Холдер);
							СтрПараметры.Вставить("Автомобиль",ТекСтрока.НомернойЭлемент);
							СтрПродажи = ДвижениеНЭ.СтруктураЦеныПродажиПолучить(СтрПараметры);
							
							СтавкаНДС = ?(ЗначениеЗаполнено(СтрПродажи.СтавкаНДС)=Истина, СтрПродажи.СтавкаНДС, текСтрока.СтавкаНДС); 
							
							СтрокаТовары.СтавкаНДС = СтавкаНДС.Ставка;
							СтрокаТовары.СуммаНДС = СтрПродажи.СуммаНДС;
							СтрокаТовары.СуммаБезНДС = СтрПродажи.СуммаБезНДС;
							СтрокаТовары.ПредставлениеНДС = СокрЛП(СтавкаНДС);
							СтрокаТовары.БезНДС = (СтавкаНДС=Справочники.СтавкиНДС.БезНДС);
							СтрокаТовары.БазаНДС = СтрПродажи.БазаНДС ;
						КонецЦикла; 
					КонецЕсли; 
					
					ТекСтатус = ДвижениеНЭ.ДвижениеПолучить(ДокументСсылка.НомернойЭлемент,ДокументСсылка.Дата);
					Если (ТипЗнч(ТекСтатус) = Тип("Структура")) Тогда
						СтрокаТовары.Вставить("МестоХранения", СокрЛП(ТекСтатус.МестоХранения));
						СтрокаТовары.Вставить("МестоХраненияУИД", СокрЛП(ТекСтатус.МестоХранения.УникальныйИдентификатор()));
					КонецЕсли;
					
					УзелДокумент.Товары.Добавить(СтрокаТовары);
				ИначеЕсли текЭлемент="НЭПередачаНаХранение" Тогда
					УзелДокумент.ДополнительныеРеквизиты.Вставить("ТочкаОформления", СокрЛП(ДокументСсылка.ТочкаОформления));
					УзелДокумент.ДополнительныеРеквизиты.Вставить("ТочкаОформленияУИД", СокрЛП(ДокументСсылка.ТочкаОформления.УникальныйИдентификатор()));
					
					УзелДокумент.ДополнительныеРеквизиты.Вставить("Организация", СокрЛП(ДокументСсылка.Холдер));
					УзелДокумент.ДополнительныеРеквизиты.Вставить("ОрганизацияИНН", ДокументСсылка.Холдер.ИНН);
					УзелДокумент.ДополнительныеРеквизиты.Вставить("ОрганизацияКПП", ДокументСсылка.Холдер.КПП);
					
					УзелДокумент.ДополнительныеРеквизиты.Вставить("Контрагент", СокрЛП(ДокументСсылка.Хранитель));
					УзелДокумент.ДополнительныеРеквизиты.Вставить("КонтрагентИНН", ДокументСсылка.Хранитель.ИНН);
					УзелДокумент.ДополнительныеРеквизиты.Вставить("КонтрагентКПП", ДокументСсылка.Хранитель.КПП);
					УзелДокумент.ДополнительныеРеквизиты.Вставить("КонтрагентУИД", СокрЛП(ДокументСсылка.Хранитель.УникальныйИдентификатор()));
					УзелДокумент.ДополнительныеРеквизиты.Вставить("КонтрагентФормаСобственности", СокрЛП(ДокументСсылка.Хранитель.ТипКонтрагента));
					
					УзелДокумент.ДополнительныеРеквизиты.Вставить("КонтрагентСтранаНаименование", ВРег(СокрЛП(ДокументСсылка.Хранитель.Страна.Наименование)));
					УзелДокумент.ДополнительныеРеквизиты.Вставить("КонтрагентСтранаКодОКСМ", СокрЛП(ДокументСсылка.Хранитель.Страна.КодОКСМ));
					УзелДокумент.ДополнительныеРеквизиты.Вставить("КонтрагентЭтоРезидент", ДокументСсылка.Хранитель.ПолучитьОбъект().ЭтоРезидент()); 
					
					УзелДокумент.ДополнительныеРеквизиты.Вставить("Договор", СокрЛП(ДокументСсылка.Договор));
					УзелДокумент.ДополнительныеРеквизиты.Вставить("ДоговорТип", СокрЛП(ТипЗнч(ДокументСсылка.Договор)));
					УзелДокумент.ДополнительныеРеквизиты.Вставить("ДоговорНомер", СокрЛП(ДокументСсылка.Договор.Номер));
					УзелДокумент.ДополнительныеРеквизиты.Вставить("ДоговорДата", ДокументСсылка.Договор.Дата);
					УзелДокумент.ДополнительныеРеквизиты.Вставить("ДоговорУИД", СокрЛП(ДокументСсылка.Договор.УникальныйИдентификатор()));
					
					УзелДокумент.ДополнительныеРеквизиты.Вставить("Основание", СокрЛП(ДокументСсылка.Основание));
					УзелДокумент.ДополнительныеРеквизиты.Вставить("ОснованиеТип", СокрЛП(ТипЗнч(ДокументСсылка.Основание)));
					УзелДокумент.ДополнительныеРеквизиты.Вставить("ОснованиеНомер", СокрЛП(ДокументСсылка.Основание.Номер));
					УзелДокумент.ДополнительныеРеквизиты.Вставить("ОснованиеДата", ДокументСсылка.Основание.Дата);
					УзелДокумент.ДополнительныеРеквизиты.Вставить("ОснованиеУИД", СокрЛП(ДокументСсылка.Основание.УникальныйИдентификатор()));
					
					ДокОбъект = ДокументСсылка.ПолучитьОбъект();
					ДокОбъект.Движения.ДвижениеНЭ.Прочитать();
					
					СоответствиеАвтомобильМестоХранения = Новый Соответствие;
					
					ДокОбъект = ДокументСсылка.ПолучитьОбъект();
					ДокОбъект.Движения.ДвижениеНЭ.Прочитать();
					Для каждого текСтрока Из ДокОбъект.Движения.ДвижениеНЭ Цикл
						Если (НЕ текСтрока.ВидДвижения=ВидДвиженияНакопления.Расход) Тогда
							Продолжить;
						КонецЕсли;
						
						СоответствиеАвтомобильМестоХранения.Вставить(текСтрока.НомернойЭлемент, текСтрока.МестоХранения);
					КонецЦикла;
					
					Для каждого текСтрока Из ДокументСсылка.НомерныеЭлементы Цикл
						СтрокаТовары = Новый Структура("Номенклатура, НоменклатураУИД, НоменклатураВИН, ОценкаСтоимости, СуммаНаценки");
						
						СтрокаТовары.Номенклатура = СокрЛП(текСтрока.НомернойЭлемент);
						СтрокаТовары.НоменклатураУИД = СокрЛП(текСтрока.НомернойЭлемент.УникальныйИдентификатор());
						СтрокаТовары.НоменклатураВИН = СокрЛП(текСтрока.НомернойЭлемент.НомерАгрегата);
						
						СтрокаТовары.Вставить("НоменклатураМодельнаяГруппа", СокрЛП(текСтрока.НомернойЭлемент.Модель.МодельнаяГруппа));
						СтрокаТовары.Вставить("НоменклатураМарка", СокрЛП(текСтрока.НомернойЭлемент.Модель.Марка));
						
						СтрокаТовары.ОценкаСтоимости = текСтрока.ОценкаСтоимости;
						Если ЗначениеЗаполнено(ДокументСсылка.Договор)=Истина Тогда
							Если (ДокументСсылка.Договор.НаценкаАгентаРубли = Истина) Тогда
								СтрокаТовары.СуммаНаценки = ДокументСсылка.Договор.НаценкаАгента;
							Иначе
								НаценкаСумма = (текСтрока.ОценкаСтоимости / 100);
								НаценкаСумма = НаценкаСумма * ДокументСсылка.Договор.НаценкаАгента;
								ОценкаСтоимостиСНаценкой = текСтрока.ОценкаСтоимости + НаценкаСумма;
								ОценкаСтоимостиСНаценкой = Окр(ОценкаСтоимостиСНаценкой,-3,РежимОкругления.Окр15как20);
								
								СтрокаТовары.СуммаНаценки = ОценкаСтоимостиСНаценкой - текСтрока.ОценкаСтоимости;
							КонецЕсли;
						Иначе
							СтрокаТовары.СуммаНаценки = 0;
						КонецЕсли; 
						
						МестоХранения = СоответствиеАвтомобильМестоХранения.Получить(текСтрока.НомернойЭлемент);
						Если (ЗначениеЗаполнено(МестоХранения)=Истина) И (ТипЗнч(МестоХранения)=Тип("СправочникСсылка.МестаХранения")) Тогда
							СтрокаТовары.Вставить("МестоХранения", СокрЛП(МестоХранения));
							СтрокаТовары.Вставить("МестоХраненияУИД", СокрЛП(МестоХранения.УникальныйИдентификатор()));
						Иначе
							СтрокаТовары.Вставить("МестоХранения", "");
							СтрокаТовары.Вставить("МестоХраненияУИД", "");
						КонецЕсли; 
						
						УзелДокумент.Товары.Добавить(СтрокаТовары);
					КонецЦикла; 
				ИначеЕсли текЭлемент="НЭПриемНаХранение" Тогда
					УзелДокумент.ДополнительныеРеквизиты.Вставить("ТочкаОформления", СокрЛП(ДокументСсылка.ТочкаОформления));
					УзелДокумент.ДополнительныеРеквизиты.Вставить("ТочкаОформленияУИД", СокрЛП(ДокументСсылка.ТочкаОформления.УникальныйИдентификатор()));
					
					УзелДокумент.ДополнительныеРеквизиты.Вставить("Организация", СокрЛП(ДокументСсылка.Холдер));
					УзелДокумент.ДополнительныеРеквизиты.Вставить("ОрганизацияИНН", ДокументСсылка.Холдер.ИНН);
					УзелДокумент.ДополнительныеРеквизиты.Вставить("ОрганизацияКПП", ДокументСсылка.Холдер.КПП);
					
					УзелДокумент.ДополнительныеРеквизиты.Вставить("МестоХранения", СокрЛП(ДокументСсылка.МестоХранения));
					УзелДокумент.ДополнительныеРеквизиты.Вставить("МестоХраненияУИД", СокрЛП(ДокументСсылка.МестоХранения.УникальныйИдентификатор()));
					
					УзелДокумент.ДополнительныеРеквизиты.Вставить("Контрагент", СокрЛП(ДокументСсылка.Контрагент));
					УзелДокумент.ДополнительныеРеквизиты.Вставить("КонтрагентИНН", ДокументСсылка.Контрагент.ИНН);
					УзелДокумент.ДополнительныеРеквизиты.Вставить("КонтрагентКПП", ДокументСсылка.Контрагент.КПП);
					УзелДокумент.ДополнительныеРеквизиты.Вставить("КонтрагентУИД", СокрЛП(ДокументСсылка.Контрагент.УникальныйИдентификатор()));
					УзелДокумент.ДополнительныеРеквизиты.Вставить("КонтрагентФормаСобственности", СокрЛП(ДокументСсылка.Контрагент.ТипКонтрагента));
					
					УзелДокумент.ДополнительныеРеквизиты.Вставить("КонтрагентСтранаНаименование", ВРег(СокрЛП(ДокументСсылка.Контрагент.Страна.Наименование)));
					УзелДокумент.ДополнительныеРеквизиты.Вставить("КонтрагентСтранаКодОКСМ", СокрЛП(ДокументСсылка.Контрагент.Страна.КодОКСМ));
					УзелДокумент.ДополнительныеРеквизиты.Вставить("КонтрагентЭтоРезидент", ДокументСсылка.Контрагент.ПолучитьОбъект().ЭтоРезидент()); 
					
					УзелДокумент.ДополнительныеРеквизиты.Вставить("Договор", СокрЛП(ДокументСсылка.Договор));
					УзелДокумент.ДополнительныеРеквизиты.Вставить("ДоговорТип", СокрЛП(ТипЗнч(ДокументСсылка.Договор)));  
					Если ЗначениеЗаполнено(ДокументСсылка.договор) ТОгда
						УзелДокумент.ДополнительныеРеквизиты.Вставить("ДоговорНомер", СокрЛП(ДокументСсылка.Договор.Номер));
						УзелДокумент.ДополнительныеРеквизиты.Вставить("ДоговорДата", ДокументСсылка.Договор.Дата);
						УзелДокумент.ДополнительныеРеквизиты.Вставить("ДоговорУИД", СокрЛП(ДокументСсылка.Договор.УникальныйИдентификатор()));
					Иначе	
						УзелДокумент.ДополнительныеРеквизиты.Вставить("ДоговорНомер", "");
						УзелДокумент.ДополнительныеРеквизиты.Вставить("ДоговорДата", "");
						УзелДокумент.ДополнительныеРеквизиты.Вставить("ДоговорУИД", "");
					КонецЕсли;					              
					Если ЗначениеЗаполнено(ДокументСсылка.Основание) ТОгда
						УзелДокумент.ДополнительныеРеквизиты.Вставить("Основание", СокрЛП(ДокументСсылка.Основание));
						УзелДокумент.ДополнительныеРеквизиты.Вставить("ОснованиеТип", СокрЛП(ТипЗнч(ДокументСсылка.Основание)));
						УзелДокумент.ДополнительныеРеквизиты.Вставить("ОснованиеНомер", СокрЛП(ДокументСсылка.Основание.Номер));
						УзелДокумент.ДополнительныеРеквизиты.Вставить("ОснованиеДата", ДокументСсылка.Основание.Дата);
						УзелДокумент.ДополнительныеРеквизиты.Вставить("ОснованиеУИД", СокрЛП(ДокументСсылка.Основание.УникальныйИдентификатор()));
					Иначе	
						УзелДокумент.ДополнительныеРеквизиты.Вставить("Основание",  "");
						УзелДокумент.ДополнительныеРеквизиты.Вставить("ОснованиеТип", "" );
						УзелДокумент.ДополнительныеРеквизиты.Вставить("ОснованиеНомер",  "");
						УзелДокумент.ДополнительныеРеквизиты.Вставить("ОснованиеДата", "" );
						УзелДокумент.ДополнительныеРеквизиты.Вставить("ОснованиеУИД", "");
					КонецЕсли;					
					СтрокаТовары = Новый Структура("Номенклатура, НоменклатураУИД, НоменклатураВИН, ОценкаСтоимости");
					
					СтрокаТовары.Номенклатура = СокрЛП(ДокументСсылка.НомернойЭлемент);
					СтрокаТовары.НоменклатураУИД = СокрЛП(ДокументСсылка.НомернойЭлемент.УникальныйИдентификатор());
					СтрокаТовары.НоменклатураВИН = СокрЛП(ДокументСсылка.НомернойЭлемент.НомерАгрегата);
					
					СтрокаТовары.Вставить("НоменклатураМодельнаяГруппа", СокрЛП(ДокументСсылка.НомернойЭлемент.Модель.МодельнаяГруппа));
					СтрокаТовары.Вставить("НоменклатураМарка", СокрЛП(ДокументСсылка.НомернойЭлемент.Модель.Марка));
					
					СтрокаТовары.ОценкаСтоимости = ДокументСсылка.ОценкаСтоимости; 
					
					Если ТипЗнч(ДокументСсылка.Основание)=Тип("ДокументСсылка.НЭПередачаНаХранение") Тогда
						Доступно = (ТипЗнч(ДокументСсылка.Основание.Договор) = Тип("ДокументСсылка.ДоговорХолдерный"));
						Доступно = Доступно И (ДокументСсылка.Основание.Договор.ЭтоАгентский = Истина);  
						Доступно = Доступно И (ДокументСсылка.Основание.НомерныеЭлементы.Количество()>0);
						Если Доступно=Истина Тогда
							СтрокаТовары.Вставить("ОценкаСтоимостиОснование", ДокументСсылка.Основание.НомерныеЭлементы[0].ОценкаСтоимости);
						Иначе
							СтрокаТовары.Вставить("ОценкаСтоимостиОснование", 0);						
						КонецЕсли;
					Иначе
						СтрокаТовары.Вставить("ОценкаСтоимостиОснование", 0);						
					КонецЕсли;
					
					УзелДокумент.Товары.Добавить(СтрокаТовары); 
					
				ИначеЕсли текЭлемент="НЭСнятиеИзХранения" Тогда  
					УзелДокумент.ДополнительныеРеквизиты.Вставить("ТочкаОформления", СокрЛП(ДокументСсылка.ТочкаОформления));
					УзелДокумент.ДополнительныеРеквизиты.Вставить("ТочкаОформленияУИД", СокрЛП(ДокументСсылка.ТочкаОформления.УникальныйИдентификатор()));
					
					УзелДокумент.ДополнительныеРеквизиты.Вставить("Организация", СокрЛП(ДокументСсылка.Холдер));
					УзелДокумент.ДополнительныеРеквизиты.Вставить("ОрганизацияИНН", ДокументСсылка.Холдер.ИНН);
					УзелДокумент.ДополнительныеРеквизиты.Вставить("ОрганизацияКПП", ДокументСсылка.Холдер.КПП);
					
					ТекСтатус = ДвижениеНЭ.ДвижениеПолучить(ДокументСсылка.НомернойЭлемент,ДокументСсылка.Дата);
					Если ТипЗнч(ТекСтатус)=Тип("Структура") И ТекСтатус.Свойство("МестоХранения")=Истина Тогда
						УзелДокумент.ДополнительныеРеквизиты.Вставить("МестоХранения", СокрЛП(ТекСтатус.МестоХранения));
						УзелДокумент.ДополнительныеРеквизиты.Вставить("МестоХраненияУИД", XMLСтрока(ТекСтатус.МестоХранения));
					Иначе
						УзелДокумент.ДополнительныеРеквизиты.Вставить("МестоХранения", "");
						УзелДокумент.ДополнительныеРеквизиты.Вставить("МестоХраненияУИД", "");
					КонецЕсли;
					
					УзелДокумент.ДополнительныеРеквизиты.Вставить("Контрагент", СокрЛП(ДокументСсылка.Контрагент));
					УзелДокумент.ДополнительныеРеквизиты.Вставить("КонтрагентИНН", ДокументСсылка.Контрагент.ИНН);
					УзелДокумент.ДополнительныеРеквизиты.Вставить("КонтрагентКПП", ДокументСсылка.Контрагент.КПП);
					УзелДокумент.ДополнительныеРеквизиты.Вставить("КонтрагентУИД", СокрЛП(ДокументСсылка.Контрагент.УникальныйИдентификатор()));
					УзелДокумент.ДополнительныеРеквизиты.Вставить("КонтрагентФормаСобственности", СокрЛП(ДокументСсылка.Контрагент.ТипКонтрагента));
					
					УзелДокумент.ДополнительныеРеквизиты.Вставить("КонтрагентСтранаНаименование", ВРег(СокрЛП(ДокументСсылка.Контрагент.Страна.Наименование)));
					УзелДокумент.ДополнительныеРеквизиты.Вставить("КонтрагентСтранаКодОКСМ", СокрЛП(ДокументСсылка.Контрагент.Страна.КодОКСМ));
					УзелДокумент.ДополнительныеРеквизиты.Вставить("КонтрагентЭтоРезидент", ДокументСсылка.Контрагент.ПолучитьОбъект().ЭтоРезидент()); 
					
					УзелДокумент.ДополнительныеРеквизиты.Вставить("Договор", СокрЛП(ДокументСсылка.Договор));
					УзелДокумент.ДополнительныеРеквизиты.Вставить("ДоговорТип", СокрЛП(ТипЗнч(ДокументСсылка.Договор)));
					УзелДокумент.ДополнительныеРеквизиты.Вставить("ДоговорНомер", СокрЛП(ДокументСсылка.Договор.Номер));
					УзелДокумент.ДополнительныеРеквизиты.Вставить("ДоговорДата", ДокументСсылка.Договор.Дата);
					УзелДокумент.ДополнительныеРеквизиты.Вставить("ДоговорУИД", СокрЛП(ДокументСсылка.Договор.УникальныйИдентификатор()));
					
					СтрокаТовары = Новый Структура("Номенклатура, НоменклатураУИД, НоменклатураВИН, ОценкаСтоимости");
					
					СтрокаТовары.Номенклатура = СокрЛП(ДокументСсылка.НомернойЭлемент);
					СтрокаТовары.НоменклатураУИД = СокрЛП(ДокументСсылка.НомернойЭлемент.УникальныйИдентификатор());
					СтрокаТовары.НоменклатураВИН = СокрЛП(ДокументСсылка.НомернойЭлемент.НомерАгрегата);
					
					СтрокаТовары.Вставить("НоменклатураМодельнаяГруппа", СокрЛП(ДокументСсылка.НомернойЭлемент.Модель.МодельнаяГруппа));
					СтрокаТовары.Вставить("НоменклатураМарка", СокрЛП(ДокументСсылка.НомернойЭлемент.Модель.Марка));
					
					УзелДокумент.Товары.Добавить(СтрокаТовары);
					
				ИначеЕсли текЭлемент="НЭПеремещение" Тогда
					УзелДокумент.ДополнительныеРеквизиты.Вставить("ТочкаОформления", СокрЛП(ДокументСсылка.ТочкаОформления));
					УзелДокумент.ДополнительныеРеквизиты.Вставить("ТочкаОформленияУИД", СокрЛП(ДокументСсылка.ТочкаОформления.УникальныйИдентификатор()));
					
					УзелДокумент.ДополнительныеРеквизиты.Вставить("Организация", СокрЛП(ДокументСсылка.Холдер));
					УзелДокумент.ДополнительныеРеквизиты.Вставить("ОрганизацияИНН", ДокументСсылка.Холдер.ИНН);
					УзелДокумент.ДополнительныеРеквизиты.Вставить("ОрганизацияКПП", ДокументСсылка.Холдер.КПП);
					
					УзелДокумент.ДополнительныеРеквизиты.Вставить("СкладПолучатель", СокрЛП(ДокументСсылка.МестоХранения));
					УзелДокумент.ДополнительныеРеквизиты.Вставить("СкладПолучательУИД", СокрЛП(ДокументСсылка.МестоХранения.УникальныйИдентификатор()));
					
					Для каждого текСтрока Из ДокументСсылка.НомерныеЭлементы Цикл
						СтрокаТовары = Новый Структура;
						
						СтрокаТовары.Вставить("Номенклатура", СокрЛП(текСтрока.НомернойЭлемент));
						СтрокаТовары.Вставить("НоменклатураУИД", СокрЛП(текСтрока.НомернойЭлемент.УникальныйИдентификатор()));
						СтрокаТовары.Вставить("НоменклатураВИН", СокрЛП(текСтрока.НомернойЭлемент.НомерАгрегата));
						
						СтрокаТовары.Вставить("НоменклатураМодельнаяГруппа", СокрЛП(текСтрока.НомернойЭлемент.Модель.МодельнаяГруппа));
						СтрокаТовары.Вставить("НоменклатураМарка", СокрЛП(текСтрока.НомернойЭлемент.Модель.Марка));
						
						ТекСтатус = ДвижениеНЭ.ДвижениеПолучить(ТекСтрока.НомернойЭлемент,ДокументСсылка.Дата);
						Если (ТипЗнч(ТекСтатус) = Тип("Структура")) Тогда
							СтрокаТовары.Вставить("СкладОтправитель", СокрЛП(ТекСтатус.МестоХранения));
							СтрокаТовары.Вставить("СкладОтправительУИД", СокрЛП(ТекСтатус.МестоХранения.УникальныйИдентификатор()));
							
							СтрокаТовары.Вставить("Собственник", СокрЛП(ТекСтатус.Собственник));
							СтрокаТовары.Вставить("СобственникИНН", ТекСтатус.Собственник.ИНН);
							СтрокаТовары.Вставить("СобственникКПП", ТекСтатус.Собственник.КПП);
							СтрокаТовары.Вставить("СобственникУИД", СокрЛП(ТекСтатус.Собственник.УникальныйИдентификатор()));
							СтрокаТовары.Вставить("СобственникФормаСобственности", СокрЛП(ТекСтатус.Собственник.ТипКонтрагента));
							
							СтрокаТовары.Вставить("ПокупательСтранаНаименование", ВРег(СокрЛП(ТекСтатус.Собственник.Страна.Наименование)));
							СтрокаТовары.Вставить("ПокупательСтранаКодОКСМ", СокрЛП(ТекСтатус.Собственник.Страна.КодОКСМ));
							СтрокаТовары.Вставить("ПокупательЭтоРезидент", ТекСтатус.Собственник.ПолучитьОбъект().ЭтоРезидент()); 
						Иначе
							СтрокаТовары.Вставить("СкладОтправитель", "");
							СтрокаТовары.Вставить("СкладОтправительУИД", "");
							
							СтрокаТовары.Вставить("Собственник", "");
							СтрокаТовары.Вставить("СобственникИНН", "");
							СтрокаТовары.Вставить("СобственникКПП", "");
							СтрокаТовары.Вставить("СобственникУИД", "");
							СтрокаТовары.Вставить("СобственникФормаСобственности", "");
							
							СтрокаТовары.Вставить("ПокупательСтранаНаименование", "");
							СтрокаТовары.Вставить("ПокупательСтранаКодОКСМ", "");
							СтрокаТовары.Вставить("ПокупательЭтоРезидент", Ложь); 
						КонецЕсли;
						
						УзелДокумент.Товары.Добавить(СтрокаТовары);
					КонецЦикла; 
					
				ИначеЕсли текЭлемент="АвансовыйОтчет" Тогда
					УзелДокумент.ДополнительныеРеквизиты.Вставить("ТочкаОформления", СокрЛП(ДокументСсылка.ТочкаОформления));
					УзелДокумент.ДополнительныеРеквизиты.Вставить("ТочкаОформленияУИД", СокрЛП(ДокументСсылка.ТочкаОформления.УникальныйИдентификатор()));
					
					УзелДокумент.ДополнительныеРеквизиты.Вставить("Организация", СокрЛП(ДокументСсылка.Организация));
					УзелДокумент.ДополнительныеРеквизиты.Вставить("ОрганизацияИНН", ДокументСсылка.Организация.ИНН);
					УзелДокумент.ДополнительныеРеквизиты.Вставить("ОрганизацияКПП", ДокументСсылка.Организация.КПП);
					
					УзелДокумент.ДополнительныеРеквизиты.Вставить("СуммаДокумента", ДокументСсылка.СуммаДокумента);
					УзелДокумент.ДополнительныеРеквизиты.Вставить("СотрудникОтчитывающийся", СокрЛП(ДокументСсылка.СотрудникОтчитывающийся));
					
					ПротоколПроверкиДокумента = РегистрыСведений.ПротоколПроверкиДокументов.ПолучитьЗаписьРегистра(ДокументСсылка);
					Если ПротоколПроверкиДокумента=Неопределено Тогда
						УзелДокумент.ДополнительныеРеквизиты.Вставить("ДокументПроверен", Ложь);
					Иначе
						УзелДокумент.ДополнительныеРеквизиты.Вставить("ДокументПроверен", ПротоколПроверкиДокумента.ДокументПроверен);
					КонецЕсли;
					
					Для каждого текСтрока Из ДокументСсылка.Товары Цикл
						СтрокаТовары = Новый Структура("Номенклатура, НоменклатураУИД, Цена, Количество, Сумма");
						
						СтрокаТовары.Номенклатура = СокрЛП(текСтрока.Номенклатура);
						СтрокаТовары.НоменклатураУИД = СокрЛП(текСтрока.Номенклатура.УникальныйИдентификатор());
						СтрокаТовары.Цена = текСтрока.Цена;
						СтрокаТовары.Количество = текСтрока.Количество;
						СтрокаТовары.Сумма = текСтрока.Сумма;
						
						УзелДокумент.Товары.Добавить(СтрокаТовары);
					КонецЦикла; 
				ИначеЕсли текЭлемент="ВозвратПокупателя" Тогда
					УзелДокумент.ДополнительныеРеквизиты.Вставить("ТочкаОформления", СокрЛП(ДокументСсылка.ТочкаОформления));
					УзелДокумент.ДополнительныеРеквизиты.Вставить("ТочкаОформленияУИД", СокрЛП(ДокументСсылка.ТочкаОформления.УникальныйИдентификатор()));
					
					УзелДокумент.ДополнительныеРеквизиты.Вставить("Организация", СокрЛП(ДокументСсылка.Организация));
					УзелДокумент.ДополнительныеРеквизиты.Вставить("ОрганизацияИНН", ДокументСсылка.Организация.ИНН);
					УзелДокумент.ДополнительныеРеквизиты.Вставить("ОрганизацияКПП", ДокументСсылка.Организация.КПП);
					
					УзелДокумент.ДополнительныеРеквизиты.Вставить("Контрагент", СокрЛП(ДокументСсылка.Контрагент));
					УзелДокумент.ДополнительныеРеквизиты.Вставить("КонтрагентИНН", ДокументСсылка.Контрагент.ИНН);
					УзелДокумент.ДополнительныеРеквизиты.Вставить("КонтрагентКПП", ДокументСсылка.Контрагент.КПП);
					УзелДокумент.ДополнительныеРеквизиты.Вставить("КонтрагентУИД", СокрЛП(ДокументСсылка.Контрагент.УникальныйИдентификатор()));
					УзелДокумент.ДополнительныеРеквизиты.Вставить("КонтрагентФормаСобственности", 
					?(ТипЗнч(ДокументСсылка.Контрагент)=Тип("СправочникСсылка.Контрагенты")
					, СокрЛП(ДокументСсылка.Контрагент.ТипКонтрагента)
					, СокрЛП(Перечисления.ТипКонтрагента.Юл)));
					
					УзелДокумент.ДополнительныеРеквизиты.Вставить("КонтрагентСтранаНаименование", ВРег(СокрЛП(ДокументСсылка.Контрагент.Страна.Наименование)));
					УзелДокумент.ДополнительныеРеквизиты.Вставить("КонтрагентСтранаКодОКСМ", СокрЛП(ДокументСсылка.Контрагент.Страна.КодОКСМ));
					УзелДокумент.ДополнительныеРеквизиты.Вставить("КонтрагентЭтоРезидент", ДокументСсылка.Контрагент.ПолучитьОбъект().ЭтоРезидент()); 
					
					Если (ТипЗнч(ДокументСсылка.ДоговорВзаиморасчетов)=Тип("СправочникСсылка.ДоговорыВзаиморасчетов")) И ЗначениеЗаполнено(ДокументСсылка.ДоговорВзаиморасчетов) Тогда
						УзелДокумент.ДополнительныеРеквизиты.Вставить("Договор", СокрЛП(ДокументСсылка.ДоговорВзаиморасчетов.Наименование));
						УзелДокумент.ДополнительныеРеквизиты.Вставить("ДоговорУИД", СокрЛП(ДокументСсылка.ДоговорВзаиморасчетов.УникальныйИдентификатор()));
						УзелДокумент.ДополнительныеРеквизиты.Вставить("ДоговорНомер", СокрЛП(ДокументСсылка.ДоговорВзаиморасчетов.Номер));
						УзелДокумент.ДополнительныеРеквизиты.Вставить("ДоговорДата", ДокументСсылка.ДоговорВзаиморасчетов.НачПериода);
						УзелДокумент.ДополнительныеРеквизиты.Вставить("ДоговорВид", Метаданные.Перечисления.ВидыДоговоров.ЗначенияПеречисления[Перечисления.ВидыДоговоров.Индекс(ДокументСсылка.ДоговорВзаиморасчетов.ВидДоговора)].Имя);
						УзелДокумент.ДополнительныеРеквизиты.Вставить("ИдентификаторГосКонтракта", СокрЛП(ДокументСсылка.ДоговорВзаиморасчетов.ИдентификаторГосударственногоКонтракта));
						УзелДокумент.ДополнительныеРеквизиты.Вставить("ИдентификационныйКодЗакупки", СокрЛП(ДокументСсылка.ДоговорВзаиморасчетов.ИдентификационныйКодЗакупки));
					Иначе
						УзелДокумент.ДополнительныеРеквизиты.Вставить("Договор", "");
						УзелДокумент.ДополнительныеРеквизиты.Вставить("ДоговорУИД", "");
						УзелДокумент.ДополнительныеРеквизиты.Вставить("ДоговорНомер", "");
						УзелДокумент.ДополнительныеРеквизиты.Вставить("ДоговорДата", "");
						УзелДокумент.ДополнительныеРеквизиты.Вставить("ДоговорВид", "");
						УзелДокумент.ДополнительныеРеквизиты.Вставить("ИдентификаторГосКонтракта", "");
						УзелДокумент.ДополнительныеРеквизиты.Вставить("ИдентификационныйКодЗакупки", "");
					КонецЕсли; 
					
					Если ЗначениеЗаполнено(ДокументСсылка.НомерКоррСчф) Тогда
						УзелДокумент.ДополнительныеРеквизиты.Вставить("КоррСчетФактураНомер", СокрЛП(ДокументСсылка.НомерКоррСчф));
						УзелДокумент.ДополнительныеРеквизиты.Вставить("КоррСчетФактураДата", ДокументСсылка.Дата);
					Иначе
						УзелДокумент.ДополнительныеРеквизиты.Вставить("КоррСчетФактураНомер", "");
						УзелДокумент.ДополнительныеРеквизиты.Вставить("КоррСчетФактураДата", "");
					КонецЕсли; 
					
					УзелДокумент.ДополнительныеРеквизиты.Вставить("НомерВходящегоДокумента", СокрЛП(ДокументСсылка.ВхНомер));
					УзелДокумент.ДополнительныеРеквизиты.Вставить("ДатаВходящегоДокумента", ДокументСсылка.ВхДата);
					
					УзелДокумент.ДополнительныеРеквизиты.Вставить("СчетФактураНомер", СокрЛП(ДокументСсылка.СчфНомер));
					УзелДокумент.ДополнительныеРеквизиты.Вставить("СчетФактураДата", ДокументСсылка.СчфДата);
					
					УзелДокумент.ДополнительныеРеквизиты.Вставить("ДокументОснование", СокрЛП(ДокументСсылка.ДокументОснование));
					УзелДокумент.ДополнительныеРеквизиты.Вставить("ДокументОснованиеУИД", ?(ЗначениеЗаполнено(ДокументСсылка.ДокументОснование), СокрЛП(ДокументСсылка.ДокументОснование.УникальныйИдентификатор()), ""));
					
					ПротоколПроверкиДокумента = РегистрыСведений.ПротоколПроверкиДокументов.ПолучитьЗаписьРегистра(ДокументСсылка);
					Если ПротоколПроверкиДокумента=Неопределено Тогда
						УзелДокумент.ДополнительныеРеквизиты.Вставить("ДокументПроверен", Ложь);
					Иначе
						УзелДокумент.ДополнительныеРеквизиты.Вставить("ДокументПроверен", ПротоколПроверкиДокумента.ДокументПроверен);
					КонецЕсли;
					
					Для каждого текСтрока Из ДокументСсылка.Товары Цикл
						СтрокаТовары = Новый Структура("Номенклатура, НоменклатураУИД, Цена, Количество, Сумма, СуммаНДС, СтавкаНДС, ПредставлениеНДС, БезНДС");
						
						СтрокаТовары.Номенклатура = СокрЛП(текСтрока.Номенклатура);
						СтрокаТовары.НоменклатураУИД = СокрЛП(текСтрока.Номенклатура.УникальныйИдентификатор());
						СтрокаТовары.Цена = текСтрока.Цена;
						СтрокаТовары.Количество = текСтрока.Количество;
						СтрокаТовары.Сумма = текСтрока.Сумма;
						СтрокаТовары.СуммаНДС = текСтрока.СуммаНДС;
						СтрокаТовары.СтавкаНДС = текСтрока.СтавкаНДС.Ставка;
						СтрокаТовары.ПредставлениеНДС = ?(текСтрока.СтавкаНДС.Предопределенный=Истина, Справочники.СтавкиНДС.ПолучитьИмяПредопределенного(текСтрока.СтавкаНДС), СокрЛП(текСтрока.СтавкаНДС));
						СтрокаТовары.БезНДС = (текСтрока.СтавкаНДС=Справочники.СтавкиНДС.БезНДС);
						
						УзелДокумент.Товары.Добавить(СтрокаТовары);
					КонецЦикла; 
				ИначеЕсли текЭлемент="ВозвратПоставщику" Тогда
					УзелДокумент.ДополнительныеРеквизиты.Вставить("ТочкаОформления", СокрЛП(ДокументСсылка.ТочкаОформления));
					УзелДокумент.ДополнительныеРеквизиты.Вставить("ТочкаОформленияУИД", СокрЛП(ДокументСсылка.ТочкаОформления.УникальныйИдентификатор()));
					
					УзелДокумент.ДополнительныеРеквизиты.Вставить("Организация", СокрЛП(ДокументСсылка.Организация));
					УзелДокумент.ДополнительныеРеквизиты.Вставить("ОрганизацияИНН", ДокументСсылка.Организация.ИНН);
					УзелДокумент.ДополнительныеРеквизиты.Вставить("ОрганизацияКПП", ДокументСсылка.Организация.КПП);
					
					Если (ЗначениеЗаполнено(ДокументСсылка.ДокументОснование)=Истина) Тогда
						УзелДокумент.ДополнительныеРеквизиты.Вставить("ДокументОснование", СокрЛП(ДокументСсылка.ДокументОснование));
						УзелДокумент.ДополнительныеРеквизиты.Вставить("ДокументОснованиеВид", ДокументСсылка.ДокументОснование.Метаданные().Имя);
						УзелДокумент.ДополнительныеРеквизиты.Вставить("ДокументОснованиеУИД", СокрЛП(ДокументСсылка.ДокументОснование.УникальныйИдентификатор()));
					Иначе
						УзелДокумент.ДополнительныеРеквизиты.Вставить("ДокументОснование", "");
						УзелДокумент.ДополнительныеРеквизиты.Вставить("ДокументОснованиеВид", "");
						УзелДокумент.ДополнительныеРеквизиты.Вставить("ДокументОснованиеУИД", "");
					КонецЕсли; 
					
					УзелДокумент.ДополнительныеРеквизиты.Вставить("Контрагент", СокрЛП(ДокументСсылка.Контрагент));
					УзелДокумент.ДополнительныеРеквизиты.Вставить("КонтрагентИНН", ДокументСсылка.Контрагент.ИНН);
					УзелДокумент.ДополнительныеРеквизиты.Вставить("КонтрагентКПП", ДокументСсылка.Контрагент.КПП);
					УзелДокумент.ДополнительныеРеквизиты.Вставить("КонтрагентУИД", СокрЛП(ДокументСсылка.Контрагент.УникальныйИдентификатор()));
					УзелДокумент.ДополнительныеРеквизиты.Вставить("КонтрагентФормаСобственности", 
					?(ТипЗнч(ДокументСсылка.Контрагент)=Тип("СправочникСсылка.Контрагенты")
					, СокрЛП(ДокументСсылка.Контрагент.ТипКонтрагента)
					, СокрЛП(Перечисления.ТипКонтрагента.Юл)));
					
					УзелДокумент.ДополнительныеРеквизиты.Вставить("КонтрагентСтранаНаименование", ВРег(СокрЛП(ДокументСсылка.Контрагент.Страна.Наименование)));
					УзелДокумент.ДополнительныеРеквизиты.Вставить("КонтрагентСтранаКодОКСМ", СокрЛП(ДокументСсылка.Контрагент.Страна.КодОКСМ));
					УзелДокумент.ДополнительныеРеквизиты.Вставить("КонтрагентЭтоРезидент", ДокументСсылка.Контрагент.ПолучитьОбъект().ЭтоРезидент()); 
					
					Если (ТипЗнч(ДокументСсылка.ДоговорВзаиморасчетов)=Тип("СправочникСсылка.ДоговорыВзаиморасчетов")) И ЗначениеЗаполнено(ДокументСсылка.ДоговорВзаиморасчетов) Тогда
						УзелДокумент.ДополнительныеРеквизиты.Вставить("Договор", СокрЛП(ДокументСсылка.ДоговорВзаиморасчетов.Наименование));
						УзелДокумент.ДополнительныеРеквизиты.Вставить("ДоговорУИД", СокрЛП(ДокументСсылка.ДоговорВзаиморасчетов.УникальныйИдентификатор()));
						УзелДокумент.ДополнительныеРеквизиты.Вставить("ДоговорНомер", СокрЛП(ДокументСсылка.ДоговорВзаиморасчетов.Номер));
						УзелДокумент.ДополнительныеРеквизиты.Вставить("ДоговорДата", ДокументСсылка.ДоговорВзаиморасчетов.НачПериода);
						УзелДокумент.ДополнительныеРеквизиты.Вставить("ДоговорВид", Метаданные.Перечисления.ВидыДоговоров.ЗначенияПеречисления[Перечисления.ВидыДоговоров.Индекс(ДокументСсылка.ДоговорВзаиморасчетов.ВидДоговора)].Имя);
						УзелДокумент.ДополнительныеРеквизиты.Вставить("ИдентификаторГосКонтракта", СокрЛП(ДокументСсылка.ДоговорВзаиморасчетов.ИдентификаторГосударственногоКонтракта));
						УзелДокумент.ДополнительныеРеквизиты.Вставить("ИдентификационныйКодЗакупки", СокрЛП(ДокументСсылка.ДоговорВзаиморасчетов.ИдентификационныйКодЗакупки));
					Иначе
						УзелДокумент.ДополнительныеРеквизиты.Вставить("Договор", "");
						УзелДокумент.ДополнительныеРеквизиты.Вставить("ДоговорУИД", "");
						УзелДокумент.ДополнительныеРеквизиты.Вставить("ДоговорНомер", "");
						УзелДокумент.ДополнительныеРеквизиты.Вставить("ДоговорДата", "");
						УзелДокумент.ДополнительныеРеквизиты.Вставить("ДоговорВид", "");
						УзелДокумент.ДополнительныеРеквизиты.Вставить("ИдентификаторГосКонтракта", "");
						УзелДокумент.ДополнительныеРеквизиты.Вставить("ИдентификационныйКодЗакупки", "");
					КонецЕсли; 
					
					УзелДокумент.ДополнительныеРеквизиты.Вставить("СчетФактураНомер", СокрЛП(ДокументСсылка.НомерСчф));
					УзелДокумент.ДополнительныеРеквизиты.Вставить("СчетФактураДата", ДокументСсылка.Дата);
					
					УзелДокумент.ДополнительныеРеквизиты.Вставить("вхСчетФактураНомер", СокрЛП(ДокументСсылка.вхСчфНомер));
					УзелДокумент.ДополнительныеРеквизиты.Вставить("вхСчетФактураДата", ДокументСсылка.вхСчфДата);
					
					УзелДокумент.ДополнительныеРеквизиты.Вставить("вхНомер", СокрЛП(ДокументСсылка.ВхНомер));
					УзелДокумент.ДополнительныеРеквизиты.Вставить("вхДата", ДокументСсылка.ВхДата);
					
					ПротоколПроверкиДокумента = РегистрыСведений.ПротоколПроверкиДокументов.ПолучитьЗаписьРегистра(ДокументСсылка);
					Если ПротоколПроверкиДокумента=Неопределено Тогда
						УзелДокумент.ДополнительныеРеквизиты.Вставить("ДокументПроверен", Ложь);
					Иначе
						УзелДокумент.ДополнительныеРеквизиты.Вставить("ДокументПроверен", ПротоколПроверкиДокумента.ДокументПроверен);
					КонецЕсли;
					
					Для каждого текСтрока Из ДокументСсылка.Товары Цикл
						СтрокаТовары = Новый Структура("Номенклатура, НоменклатураУИД, Цена, Количество, Сумма, СтавкаНДС, СуммаНДС, ПредставлениеНДС, БезНДС");
						
						СтрокаТовары.Номенклатура = СокрЛП(текСтрока.Номенклатура);
						СтрокаТовары.НоменклатураУИД = СокрЛП(текСтрока.Номенклатура.УникальныйИдентификатор());
						СтрокаТовары.Цена = текСтрока.Цена;
						СтрокаТовары.Количество = текСтрока.Количество;
						СтрокаТовары.Сумма = текСтрока.Сумма;
						СтрокаТовары.СтавкаНДС = текСтрока.СтавкаНДС.Ставка;
						СтрокаТовары.СуммаНДС = текСтрока.СуммаНДС;
						СтрокаТовары.ПредставлениеНДС = ?(текСтрока.СтавкаНДС.Предопределенный=Истина, Справочники.СтавкиНДС.ПолучитьИмяПредопределенного(текСтрока.СтавкаНДС), СокрЛП(текСтрока.СтавкаНДС));
						СтрокаТовары.БезНДС = (текСтрока.СтавкаНДС=Справочники.СтавкиНДС.БезНДС);
						
						УзелДокумент.Товары.Добавить(СтрокаТовары);
					КонецЦикла; 
				ИначеЕсли текЭлемент="ЗаказНаряд" Тогда
					УзелДокумент.ДополнительныеРеквизиты.Вставить("ТочкаОформления", СокрЛП(ДокументСсылка.ТочкаОформления));
					УзелДокумент.ДополнительныеРеквизиты.Вставить("ТочкаОформленияУИД", СокрЛП(ДокументСсылка.ТочкаОформления.УникальныйИдентификатор()));
					
					УзелДокумент.ДополнительныеРеквизиты.Вставить("Организация", СокрЛП(ДокументСсылка.Организация));
					УзелДокумент.ДополнительныеРеквизиты.Вставить("ОрганизацияИНН", ДокументСсылка.Организация.ИНН);
					УзелДокумент.ДополнительныеРеквизиты.Вставить("ОрганизацияКПП", ДокументСсылка.Организация.КПП);
					
					УзелДокумент.ДополнительныеРеквизиты.Вставить("Контрагент", СокрЛП(ДокументСсылка.Контрагент));
					УзелДокумент.ДополнительныеРеквизиты.Вставить("КонтрагентИНН", ДокументСсылка.Контрагент.ИНН);
					УзелДокумент.ДополнительныеРеквизиты.Вставить("КонтрагентКПП", ДокументСсылка.Контрагент.КПП);
					УзелДокумент.ДополнительныеРеквизиты.Вставить("КонтрагентУИД", СокрЛП(ДокументСсылка.Контрагент.УникальныйИдентификатор()));
					УзелДокумент.ДополнительныеРеквизиты.Вставить("КонтрагентФормаСобственности", 
					?(ТипЗнч(ДокументСсылка.Контрагент)=Тип("СправочникСсылка.Контрагенты")
					, СокрЛП(ДокументСсылка.Контрагент.ТипКонтрагента)
					, СокрЛП(Перечисления.ТипКонтрагента.Юл)));
					
					УзелДокумент.ДополнительныеРеквизиты.Вставить("КонтрагентСтранаНаименование", ВРег(СокрЛП(ДокументСсылка.Контрагент.Страна.Наименование)));
					УзелДокумент.ДополнительныеРеквизиты.Вставить("КонтрагентСтранаКодОКСМ", СокрЛП(ДокументСсылка.Контрагент.Страна.КодОКСМ));
					УзелДокумент.ДополнительныеРеквизиты.Вставить("КонтрагентЭтоРезидент", ДокументСсылка.Контрагент.ПолучитьОбъект().ЭтоРезидент()); 
					
					Если (ТипЗнч(ДокументСсылка.ДоговорВзаиморасчетов)=Тип("СправочникСсылка.ДоговорыВзаиморасчетов")) И ЗначениеЗаполнено(ДокументСсылка.ДоговорВзаиморасчетов) Тогда
						УзелДокумент.ДополнительныеРеквизиты.Вставить("Договор", СокрЛП(ДокументСсылка.ДоговорВзаиморасчетов.Наименование));
						УзелДокумент.ДополнительныеРеквизиты.Вставить("ДоговорУИД", СокрЛП(ДокументСсылка.ДоговорВзаиморасчетов.УникальныйИдентификатор()));
						УзелДокумент.ДополнительныеРеквизиты.Вставить("ДоговорНомер", СокрЛП(ДокументСсылка.ДоговорВзаиморасчетов.Номер));
						УзелДокумент.ДополнительныеРеквизиты.Вставить("ДоговорДата", ДокументСсылка.ДоговорВзаиморасчетов.НачПериода);
						УзелДокумент.ДополнительныеРеквизиты.Вставить("ДоговорВид", Метаданные.Перечисления.ВидыДоговоров.ЗначенияПеречисления[Перечисления.ВидыДоговоров.Индекс(ДокументСсылка.ДоговорВзаиморасчетов.ВидДоговора)].Имя);
						УзелДокумент.ДополнительныеРеквизиты.Вставить("ИдентификаторГосКонтракта", СокрЛП(ДокументСсылка.ДоговорВзаиморасчетов.ИдентификаторГосударственногоКонтракта));
						УзелДокумент.ДополнительныеРеквизиты.Вставить("ИдентификационныйКодЗакупки", СокрЛП(ДокументСсылка.ДоговорВзаиморасчетов.ИдентификационныйКодЗакупки));
					Иначе
						УзелДокумент.ДополнительныеРеквизиты.Вставить("Договор", "");
						УзелДокумент.ДополнительныеРеквизиты.Вставить("ДоговорУИД", "");
						УзелДокумент.ДополнительныеРеквизиты.Вставить("ДоговорНомер", "");
						УзелДокумент.ДополнительныеРеквизиты.Вставить("ДоговорДата", "");
						УзелДокумент.ДополнительныеРеквизиты.Вставить("ДоговорВид", "");
						УзелДокумент.ДополнительныеРеквизиты.Вставить("ИдентификаторГосКонтракта", "");
						УзелДокумент.ДополнительныеРеквизиты.Вставить("ИдентификационныйКодЗакупки", "");
					КонецЕсли; 
					
					УзелДокумент.ДополнительныеРеквизиты.Вставить("СчетФактураНомер", СокрЛП(ДокументСсылка.НомерСчф));
					УзелДокумент.ДополнительныеРеквизиты.Вставить("ДатаЗакрытия", ДокументСсылка.ДатаЗакрытия);
					
					УзелДокумент.ДополнительныеРеквизиты.Вставить("СуммаДокумента", ДокументСсылка.СуммаДокумента);
					УзелДокумент.ДополнительныеРеквизиты.Вставить("СуммаНДС", ДокументСсылка.СуммаНДС);
					УзелДокумент.ДополнительныеРеквизиты.Вставить("СтавкаНДС", ДокументСсылка.СтавкаНДС.Ставка);
					УзелДокумент.ДополнительныеРеквизиты.Вставить("ПредставлениеНДС", ?(ДокументСсылка.СтавкаНДС.Предопределенный=Истина, Справочники.СтавкиНДС.ПолучитьИмяПредопределенного(ДокументСсылка.СтавкаНДС), СокрЛП(ДокументСсылка.СтавкаНДС)));
					УзелДокумент.ДополнительныеРеквизиты.Вставить("БезНДС", (ДокументСсылка.СтавкаНДС=Справочники.СтавкиНДС.БезНДС));
					
					УзелДокумент.ДополнительныеРеквизиты.Вставить("ВидРемонта", СокрЛП(ДокументСсылка.ВидРемонта));
					УзелДокумент.ДополнительныеРеквизиты.Вставить("ВидРемонтаУИД", СокрЛП(ДокументСсылка.ВидРемонта.УникальныйИдентификатор()));
					
					УзелДокумент.ДополнительныеРеквизиты.Вставить("Автомобиль", СокрЛП(ДокументСсылка.ДокументОснование.Автомобиль));
					УзелДокумент.ДополнительныеРеквизиты.Вставить("АвтомобильВИН", СокрЛП(ДокументСсылка.ДокументОснование.Автомобиль.НомерАгрегата));
					УзелДокумент.ДополнительныеРеквизиты.Вставить("АвтомобильУИД", СокрЛП(ДокументСсылка.ДокументОснование.Автомобиль.УникальныйИдентификатор()));
					УзелДокумент.ДополнительныеРеквизиты.Вставить("АвтомобильМодельнаяГруппа",  СокрЛП(ДокументСсылка.ДокументОснование.Автомобиль.Модель.МодельнаяГруппа));
					УзелДокумент.ДополнительныеРеквизиты.Вставить("АвтомобильМарка",  СокрЛП(ДокументСсылка.ДокументОснование.Автомобиль.Модель.Марка));
					
					
					
					
					Найдено = ТЗСводныеАкты.НайтиСтроки(Новый Структура("Док", ДокументСсылка)); 
					Если Найдено.Количество() > 0 тогда
					УзелДокумент.ДополнительныеРеквизиты.Вставить("СводныйАктНомер", Найдено[0].Номер);
					УзелДокумент.ДополнительныеРеквизиты.Вставить("СводныйАктДата", Найдено[0].Дата);	
					УзелДокумент.ДополнительныеРеквизиты.Вставить("СводныйАктУИД", СокрЛП(Найдено[0].Ссылка.УникальныйИдентификатор()));	
						
					КонецЕсли;	
					
					
					
					Для каждого текСтрока Из ДокументСсылка.Товары Цикл
						СтрокаТовары = Новый Структура("Номенклатура, НоменклатураУИД, Цена, Количество, Сумма");
						
						СтрокаТовары.Номенклатура = СокрЛП(текСтрока.Номенклатура);
						СтрокаТовары.НоменклатураУИД = СокрЛП(текСтрока.Номенклатура.УникальныйИдентификатор());
						СтрокаТовары.Цена = текСтрока.Цена;
						СтрокаТовары.Количество = текСтрока.Количество;
						СтрокаТовары.Сумма = текСтрока.Сумма;
						
						УзелДокумент.Товары.Добавить(СтрокаТовары);
					КонецЦикла; 
					
					Если ДокументыРНПТ.Найти(ДокументСсылка)<> Неопределено тогда
						ТЗРНПТ = ПолучитьРНПТ(ДокументСсылка);
						
						Для каждого текСтрока Из ТЗРНПТ Цикл
							СтрокаРНПТ = Новый Структура("Номенклатура, Количество, КоличествоПрослеживаемости, СтранаПроисхождения, Сумма, РНПТ, РНПТУИД");
							
							СтрокаРНПТ.Номенклатура = СокрЛП(текСтрока.Номенклатура);
							СтрокаРНПТ.Количество = текСтрока.Количество;
							СтрокаРНПТ.КоличествоПрослеживаемости = текСтрока.КоличествоПрослеживаемости;
							СтрокаРНПТ.СтранаПроисхождения = текСтрока.СтранаПроисхождения;
							СтрокаРНПТ.РНПТ = СокрЛП(текСтрока.РНПТ);
							СтрокаРНПТ.РНПТУИД = СокрЛП(текСтрока.РНПТ.УникальныйИдентификатор());
							
							УзелДокумент.РНПТ.Добавить(СтрокаРНПТ);
						КонецЦикла;
					КонецЕсли;
					
					
					
					УзелДокумент.Вставить("Работы", Новый Массив);
					Для каждого текСтрока Из ДокументСсылка.Работы Цикл
						СтрокаРаботы = Новый Структура;
						СтрокаРаботы.Вставить("Работа", СокрЛП(текСтрока.Работа));
						СтрокаРаботы.Вставить("Количество", текСтрока.Количество);
						СтрокаРаботы.Вставить("ВремяВыполнения", текСтрока.ВремяВыполнения);
						СтрокаРаботы.Вставить("Цена", текСтрока.Цена);
						СтрокаРаботы.Вставить("Сумма", текСтрока.Сумма);
						
						УзелДокумент.Работы.Добавить(СтрокаРаботы);
					КонецЦикла; 
					
					УзелДокумент.Вставить("Подряды", Новый Массив);
					Для каждого текСтрока Из ДокументСсылка.Подряды Цикл
						СтрокаПодряды = Новый Структура;
						СтрокаПодряды.Вставить("Работа", СокрЛП(текСтрока.Работа));
						СтрокаПодряды.Вставить("Количество", текСтрока.Количество);
						СтрокаПодряды.Вставить("Цена", текСтрока.Цена);
						СтрокаПодряды.Вставить("Сумма", текСтрока.Сумма);
						СтрокаПодряды.Вставить("Себестоимость", текСтрока.Себестоимость);
						
						СтрокаПодряды.Вставить("Контрагент", СокрЛП(текСтрока.Контрагент));
						СтрокаПодряды.Вставить("КонтрагентИНН", текСтрока.Контрагент.ИНН);
						СтрокаПодряды.Вставить("КонтрагентКПП", текСтрока.Контрагент.КПП);
						СтрокаПодряды.Вставить("КонтрагентУИД", СокрЛП(текСтрока.Контрагент.УникальныйИдентификатор()));
						СтрокаПодряды.Вставить("КонтрагентФормаСобственности", СокрЛП(текСтрока.Контрагент.ТипКонтрагента));
						
						СтрокаПодряды.Вставить("КонтрагентСтранаНаименование", ВРег(СокрЛП(текСтрока.Контрагент.Страна.Наименование)));
						СтрокаПодряды.Вставить("КонтрагентСтранаКодОКСМ", СокрЛП(текСтрока.Контрагент.Страна.КодОКСМ));
						СтрокаПодряды.Вставить("КонтрагентЭтоРезидент", текСтрока.Контрагент.ПолучитьОбъект().ЭтоРезидент()); 
						
						УзелДокумент.Подряды.Добавить(СтрокаПодряды);
					КонецЦикла; 
				ИначеЕсли текЭлемент="АктВыполненныхРаботСводный" Тогда
					УзелДокумент.ДополнительныеРеквизиты.Вставить("ТочкаОформления", СокрЛП(ДокументСсылка.ТочкаОформления));
					УзелДокумент.ДополнительныеРеквизиты.Вставить("ТочкаОформленияУИД", СокрЛП(ДокументСсылка.ТочкаОформления.УникальныйИдентификатор()));
					
					УзелДокумент.ДополнительныеРеквизиты.Вставить("Организация", СокрЛП(ДокументСсылка.Организация));
					УзелДокумент.ДополнительныеРеквизиты.Вставить("ОрганизацияИНН", ДокументСсылка.Организация.ИНН);
					УзелДокумент.ДополнительныеРеквизиты.Вставить("ОрганизацияКПП", ДокументСсылка.Организация.КПП);
					
					УзелДокумент.ДополнительныеРеквизиты.Вставить("Контрагент", СокрЛП(ДокументСсылка.Контрагент));
					УзелДокумент.ДополнительныеРеквизиты.Вставить("КонтрагентИНН", ДокументСсылка.Контрагент.ИНН);
					УзелДокумент.ДополнительныеРеквизиты.Вставить("КонтрагентКПП", ДокументСсылка.Контрагент.КПП);
					УзелДокумент.ДополнительныеРеквизиты.Вставить("КонтрагентУИД", СокрЛП(ДокументСсылка.Контрагент.УникальныйИдентификатор()));
					УзелДокумент.ДополнительныеРеквизиты.Вставить("КонтрагентФормаСобственности", 
					?(ТипЗнч(ДокументСсылка.Контрагент)=Тип("СправочникСсылка.Контрагенты")
					, СокрЛП(ДокументСсылка.Контрагент.ТипКонтрагента)
					, СокрЛП(Перечисления.ТипКонтрагента.Юл)));
					
					УзелДокумент.ДополнительныеРеквизиты.Вставить("КонтрагентСтранаНаименование", ВРег(СокрЛП(ДокументСсылка.Контрагент.Страна.Наименование)));
					УзелДокумент.ДополнительныеРеквизиты.Вставить("КонтрагентСтранаКодОКСМ", СокрЛП(ДокументСсылка.Контрагент.Страна.КодОКСМ));
					УзелДокумент.ДополнительныеРеквизиты.Вставить("КонтрагентЭтоРезидент", ДокументСсылка.Контрагент.ПолучитьОбъект().ЭтоРезидент()); 
					
					Если (ТипЗнч(ДокументСсылка.ДоговорВзаиморасчетов)=Тип("СправочникСсылка.ДоговорыВзаиморасчетов")) И ЗначениеЗаполнено(ДокументСсылка.ДоговорВзаиморасчетов) Тогда
						УзелДокумент.ДополнительныеРеквизиты.Вставить("Договор", СокрЛП(ДокументСсылка.ДоговорВзаиморасчетов.Наименование));
						УзелДокумент.ДополнительныеРеквизиты.Вставить("ДоговорУИД", СокрЛП(ДокументСсылка.ДоговорВзаиморасчетов.УникальныйИдентификатор()));
						УзелДокумент.ДополнительныеРеквизиты.Вставить("ДоговорНомер", СокрЛП(ДокументСсылка.ДоговорВзаиморасчетов.Номер));
						УзелДокумент.ДополнительныеРеквизиты.Вставить("ДоговорДата", ДокументСсылка.ДоговорВзаиморасчетов.НачПериода);
						УзелДокумент.ДополнительныеРеквизиты.Вставить("ДоговорВид", Метаданные.Перечисления.ВидыДоговоров.ЗначенияПеречисления[Перечисления.ВидыДоговоров.Индекс(ДокументСсылка.ДоговорВзаиморасчетов.ВидДоговора)].Имя);
						УзелДокумент.ДополнительныеРеквизиты.Вставить("ИдентификаторГосКонтракта", СокрЛП(ДокументСсылка.ДоговорВзаиморасчетов.ИдентификаторГосударственногоКонтракта));
						УзелДокумент.ДополнительныеРеквизиты.Вставить("ИдентификационныйКодЗакупки", СокрЛП(ДокументСсылка.ДоговорВзаиморасчетов.ИдентификационныйКодЗакупки));
					Иначе
						УзелДокумент.ДополнительныеРеквизиты.Вставить("Договор", "");
						УзелДокумент.ДополнительныеРеквизиты.Вставить("ДоговорУИД", "");
						УзелДокумент.ДополнительныеРеквизиты.Вставить("ДоговорНомер", "");
						УзелДокумент.ДополнительныеРеквизиты.Вставить("ДоговорДата", "");
						УзелДокумент.ДополнительныеРеквизиты.Вставить("ДоговорВид", "");
						УзелДокумент.ДополнительныеРеквизиты.Вставить("ИдентификаторГосКонтракта", "");
						УзелДокумент.ДополнительныеРеквизиты.Вставить("ИдентификационныйКодЗакупки", "");
					КонецЕсли; 
					
					УзелДокумент.ДополнительныеРеквизиты.Вставить("СчетФактураНомер", СокрЛП(ДокументСсылка.НомерСчф));
					УзелДокумент.ДополнительныеРеквизиты.Вставить("ДатаЗакрытия", ДокументСсылка.Дата);
					
					УзелДокумент.ДополнительныеРеквизиты.Вставить("СуммаДокумента", ДокументСсылка.СуммаДокумента);
					УзелДокумент.ДополнительныеРеквизиты.Вставить("СуммаНДС", ДокументСсылка.СуммаНДС);
					УзелДокумент.ДополнительныеРеквизиты.Вставить("СтавкаНДС", ДокументСсылка.СтавкаНДС.Ставка);
					УзелДокумент.ДополнительныеРеквизиты.Вставить("ПредставлениеНДС", ?(ДокументСсылка.СтавкаНДС.Предопределенный=Истина, Справочники.СтавкиНДС.ПолучитьИмяПредопределенного(ДокументСсылка.СтавкаНДС), СокрЛП(ДокументСсылка.СтавкаНДС)));
					УзелДокумент.ДополнительныеРеквизиты.Вставить("БезНДС", (ДокументСсылка.СтавкаНДС=Справочники.СтавкиНДС.БезНДС));
					
						УзелДокумент.Вставить("Реестр", Новый Массив);
						Для каждого текСтрока Из ДокументСсылка.Реестр Цикл
						СтрокаРеестр = Новый Структура;
						СтрокаРеестр.Вставить("ДокУИД", СокрЛП(текСтрока.док.УникальныйИдентификатор()));
						СтрокаРеестр.Вставить("ДокНомер", текстрока.Док.Номер);
						СтрокаРеестр.Вставить("ДокДата", текстрока.Док.ДатаЗакрытия);
					//	СтрокаПодряды.Вставить("Количество", текСтрока.Количество);
					//	СтрокаПодряды.Вставить("Цена", текСтрока.Цена);
						СтрокаРеестр.Вставить("СуммаДокумента", текСтрока.СуммаДокумента);                      
						СтрокаРеестр.Вставить("СуммаНДС", текстрока.СуммаНДС);
						СтрокаРеестр.Вставить("СтавкаНДС", текстрока.СтавкаНДС.Ставка);
					
					
					//	СтрокаПодряды.Вставить("КонтрагентУИД", СокрЛП(текСтрока.Контрагент.УникальныйИдентификатор()));
					//	СтрокаПодряды.Вставить("КонтрагентФормаСобственности", СокрЛП(текСтрока.Контрагент.ТипКонтрагента));
					//	
					//	СтрокаПодряды.Вставить("КонтрагентСтранаНаименование", ВРег(СокрЛП(текСтрока.Контрагент.Страна.Наименование)));
					//	СтрокаПодряды.Вставить("КонтрагентСтранаКодОКСМ", СокрЛП(текСтрока.Контрагент.Страна.КодОКСМ));
					//	СтрокаПодряды.Вставить("КонтрагентЭтоРезидент", текСтрока.Контрагент.ПолучитьОбъект().ЭтоРезидент()); 
					//	
						УзелДокумент.Реестр.Добавить(СтрокаРеестр);
						КонецЦикла; 	
						
					
					//УзелДокумент.Вставить("Подряды", Новый Массив);
					//Для каждого текСтрока Из ДокументСсылка.Подряды Цикл
					//	СтрокаПодряды = Новый Структура;
					//	СтрокаПодряды.Вставить("Работа", СокрЛП(текСтрока.Работа));
					//	СтрокаПодряды.Вставить("Количество", текСтрока.Количество);
					//	СтрокаПодряды.Вставить("Цена", текСтрока.Цена);
					//	СтрокаПодряды.Вставить("Сумма", текСтрока.Сумма);
					//	СтрокаПодряды.Вставить("Себестоимость", текСтрока.Себестоимость);
					//	
					//	СтрокаПодряды.Вставить("Контрагент", СокрЛП(текСтрока.Контрагент));
					//	СтрокаПодряды.Вставить("КонтрагентИНН", текСтрока.Контрагент.ИНН);
					//	СтрокаПодряды.Вставить("КонтрагентКПП", текСтрока.Контрагент.КПП);
					//	СтрокаПодряды.Вставить("КонтрагентУИД", СокрЛП(текСтрока.Контрагент.УникальныйИдентификатор()));
					//	СтрокаПодряды.Вставить("КонтрагентФормаСобственности", СокрЛП(текСтрока.Контрагент.ТипКонтрагента));
					//	
					//	СтрокаПодряды.Вставить("КонтрагентСтранаНаименование", ВРег(СокрЛП(текСтрока.Контрагент.Страна.Наименование)));
					//	СтрокаПодряды.Вставить("КонтрагентСтранаКодОКСМ", СокрЛП(текСтрока.Контрагент.Страна.КодОКСМ));
					//	СтрокаПодряды.Вставить("КонтрагентЭтоРезидент", текСтрока.Контрагент.ПолучитьОбъект().ЭтоРезидент()); 
					//	
					//	УзелДокумент.Подряды.Добавить(СтрокаПодряды);
					//КонецЦикла; 	
					
				ИначеЕсли текЭлемент="УслугаПроизводства" Тогда
					УзелДокумент.ДополнительныеРеквизиты.Вставить("ТочкаОформления", СокрЛП(ДокументСсылка.ТочкаОформления));
					УзелДокумент.ДополнительныеРеквизиты.Вставить("ТочкаОформленияУИД", СокрЛП(ДокументСсылка.ТочкаОформления.УникальныйИдентификатор()));
					
					УзелДокумент.ДополнительныеРеквизиты.Вставить("Организация", СокрЛП(ДокументСсылка.Организация));
					УзелДокумент.ДополнительныеРеквизиты.Вставить("ОрганизацияИНН", ДокументСсылка.Организация.ИНН);
					УзелДокумент.ДополнительныеРеквизиты.Вставить("ОрганизацияКПП", ДокументСсылка.Организация.КПП);
					
					УзелДокумент.ДополнительныеРеквизиты.Вставить("Контрагент", СокрЛП(ДокументСсылка.Контрагент));
					УзелДокумент.ДополнительныеРеквизиты.Вставить("КонтрагентИНН", ДокументСсылка.Контрагент.ИНН);
					УзелДокумент.ДополнительныеРеквизиты.Вставить("КонтрагентКПП", ДокументСсылка.Контрагент.КПП);
					УзелДокумент.ДополнительныеРеквизиты.Вставить("КонтрагентУИД", СокрЛП(ДокументСсылка.Контрагент.УникальныйИдентификатор()));
					УзелДокумент.ДополнительныеРеквизиты.Вставить("КонтрагентФормаСобственности", 
					?(ТипЗнч(ДокументСсылка.Контрагент)=Тип("СправочникСсылка.Контрагенты")
					, СокрЛП(ДокументСсылка.Контрагент.ТипКонтрагента)
					, СокрЛП(Перечисления.ТипКонтрагента.Юл)));
					
					УзелДокумент.ДополнительныеРеквизиты.Вставить("КонтрагентСтранаНаименование", ВРег(СокрЛП(ДокументСсылка.Контрагент.Страна.Наименование)));
					УзелДокумент.ДополнительныеРеквизиты.Вставить("КонтрагентСтранаКодОКСМ", СокрЛП(ДокументСсылка.Контрагент.Страна.КодОКСМ));
					УзелДокумент.ДополнительныеРеквизиты.Вставить("КонтрагентЭтоРезидент", ДокументСсылка.Контрагент.ПолучитьОбъект().ЭтоРезидент()); 
					
					Если (ТипЗнч(ДокументСсылка.ДоговорВзаиморасчетов)=Тип("СправочникСсылка.ДоговорыВзаиморасчетов")) И ЗначениеЗаполнено(ДокументСсылка.ДоговорВзаиморасчетов) Тогда
						УзелДокумент.ДополнительныеРеквизиты.Вставить("Договор", СокрЛП(ДокументСсылка.ДоговорВзаиморасчетов.Наименование));
						УзелДокумент.ДополнительныеРеквизиты.Вставить("ДоговорУИД", СокрЛП(ДокументСсылка.ДоговорВзаиморасчетов.УникальныйИдентификатор()));
						УзелДокумент.ДополнительныеРеквизиты.Вставить("ДоговорНомер", СокрЛП(ДокументСсылка.ДоговорВзаиморасчетов.Номер));
						УзелДокумент.ДополнительныеРеквизиты.Вставить("ДоговорДата", ДокументСсылка.ДоговорВзаиморасчетов.НачПериода);
						УзелДокумент.ДополнительныеРеквизиты.Вставить("ДоговорВид", Метаданные.Перечисления.ВидыДоговоров.ЗначенияПеречисления[Перечисления.ВидыДоговоров.Индекс(ДокументСсылка.ДоговорВзаиморасчетов.ВидДоговора)].Имя);
						УзелДокумент.ДополнительныеРеквизиты.Вставить("ИдентификаторГосКонтракта", СокрЛП(ДокументСсылка.ДоговорВзаиморасчетов.ИдентификаторГосударственногоКонтракта));
						УзелДокумент.ДополнительныеРеквизиты.Вставить("ИдентификационныйКодЗакупки", СокрЛП(ДокументСсылка.ДоговорВзаиморасчетов.ИдентификационныйКодЗакупки));
					Иначе
						УзелДокумент.ДополнительныеРеквизиты.Вставить("Договор", "");
						УзелДокумент.ДополнительныеРеквизиты.Вставить("ДоговорУИД", "");
						УзелДокумент.ДополнительныеРеквизиты.Вставить("ДоговорНомер", "");
						УзелДокумент.ДополнительныеРеквизиты.Вставить("ДоговорДата", "");
						УзелДокумент.ДополнительныеРеквизиты.Вставить("ДоговорВид", "");
						УзелДокумент.ДополнительныеРеквизиты.Вставить("ИдентификаторГосКонтракта", "");
						УзелДокумент.ДополнительныеРеквизиты.Вставить("ИдентификационныйКодЗакупки", "");
					КонецЕсли; 
					
					УзелДокумент.ДополнительныеРеквизиты.Вставить("СчетФактураНомер", СокрЛП(ДокументСсылка.НомерСчф));
					УзелДокумент.ДополнительныеРеквизиты.Вставить("ДатаЗакрытия", ДокументСсылка.Дата);
					
					УзелДокумент.ДополнительныеРеквизиты.Вставить("СуммаДокумента", ДокументСсылка.СуммаДокумента);
					УзелДокумент.ДополнительныеРеквизиты.Вставить("СтавкаНДС", ДокументСсылка.СтавкаНДС.Ставка);
					УзелДокумент.ДополнительныеРеквизиты.Вставить("ПредставлениеНДС", ?(ДокументСсылка.СтавкаНДС.Предопределенный=Истина, Справочники.СтавкиНДС.ПолучитьИмяПредопределенного(ДокументСсылка.СтавкаНДС), СокрЛП(ДокументСсылка.СтавкаНДС)));
					УзелДокумент.ДополнительныеРеквизиты.Вставить("БезНДС", (ДокументСсылка.СтавкаНДС=Справочники.СтавкиНДС.БезНДС));
					
					СуммаНДС = 0;
					Для Каждого ТекСтрока Из ДокументСсылка.Работы Цикл
						СтрОтбора = Новый Структура("Работа",ТекСтрока.Работа);
						ТЗТовары = ДокументСсылка.Товары.Выгрузить(СтрОтбора,"Сумма");
						ПозСумма = ТекСтрока.Сумма + ТЗТовары.Итог("Сумма");
						
						СуммаНДС = СуммаНДС + Окр(Конвертация.НдсОтСуммыПолучить(ПозСумма,ДокументСсылка.СтавкаНДС),2);
					КонецЦикла;
					УзелДокумент.ДополнительныеРеквизиты.Вставить("СуммаНДС", СуммаНДС);
					
					УзелДокумент.ДополнительныеРеквизиты.Вставить("ВидРемонта", СокрЛП(ДокументСсылка.ВидРемонта));
					УзелДокумент.ДополнительныеРеквизиты.Вставить("ВидРемонтаУИД", СокрЛП(ДокументСсылка.ВидРемонта.УникальныйИдентификатор()));
					
					Для каждого текСтрока Из ДокументСсылка.Товары Цикл
						СтрокаТовары = Новый Структура("Номенклатура, НоменклатураУИД, Цена, Количество, Сумма");
						
						СтрокаТовары.Номенклатура = СокрЛП(текСтрока.Номенклатура);
						СтрокаТовары.НоменклатураУИД = СокрЛП(текСтрока.Номенклатура.УникальныйИдентификатор());
						СтрокаТовары.Цена = текСтрока.Цена;
						СтрокаТовары.Количество = текСтрока.Количество;
						СтрокаТовары.Сумма = текСтрока.Сумма;
						
						УзелДокумент.Товары.Добавить(СтрокаТовары);
					КонецЦикла; 
				ИначеЕсли текЭлемент="ПриемОтветХранениеШин" Тогда
					УзелДокумент.ДополнительныеРеквизиты.Вставить("ТочкаОформления", СокрЛП(ДокументСсылка.ТочкаОформления));
					УзелДокумент.ДополнительныеРеквизиты.Вставить("ТочкаОформленияУИД", СокрЛП(ДокументСсылка.ТочкаОформления.УникальныйИдентификатор()));
					
					УзелДокумент.ДополнительныеРеквизиты.Вставить("Организация", СокрЛП(ДокументСсылка.Организация));
					УзелДокумент.ДополнительныеРеквизиты.Вставить("ОрганизацияИНН", ДокументСсылка.Организация.ИНН);
					УзелДокумент.ДополнительныеРеквизиты.Вставить("ОрганизацияКПП", ДокументСсылка.Организация.КПП);
					
					УзелДокумент.ДополнительныеРеквизиты.Вставить("Контрагент", СокрЛП(ДокументСсылка.Контрагент));
					УзелДокумент.ДополнительныеРеквизиты.Вставить("КонтрагентИНН", ДокументСсылка.Контрагент.ИНН);
					УзелДокумент.ДополнительныеРеквизиты.Вставить("КонтрагентКПП", ДокументСсылка.Контрагент.КПП);
					УзелДокумент.ДополнительныеРеквизиты.Вставить("КонтрагентУИД", СокрЛП(ДокументСсылка.Контрагент.УникальныйИдентификатор()));
					УзелДокумент.ДополнительныеРеквизиты.Вставить("КонтрагентФормаСобственности", 
					?(ТипЗнч(ДокументСсылка.Контрагент)=Тип("СправочникСсылка.Контрагенты")
					, СокрЛП(ДокументСсылка.Контрагент.ТипКонтрагента)
					, СокрЛП(Перечисления.ТипКонтрагента.Юл)));
					
					УзелДокумент.ДополнительныеРеквизиты.Вставить("КонтрагентСтранаНаименование", ВРег(СокрЛП(ДокументСсылка.Контрагент.Страна.Наименование)));
					УзелДокумент.ДополнительныеРеквизиты.Вставить("КонтрагентСтранаКодОКСМ", СокрЛП(ДокументСсылка.Контрагент.Страна.КодОКСМ));
					УзелДокумент.ДополнительныеРеквизиты.Вставить("КонтрагентЭтоРезидент", ДокументСсылка.Контрагент.ПолучитьОбъект().ЭтоРезидент()); 
					
					Если (ТипЗнч(ДокументСсылка.ДоговорВзаиморасчетов)=Тип("СправочникСсылка.ДоговорыВзаиморасчетов")) И ЗначениеЗаполнено(ДокументСсылка.ДоговорВзаиморасчетов) Тогда
						УзелДокумент.ДополнительныеРеквизиты.Вставить("Договор", СокрЛП(ДокументСсылка.ДоговорВзаиморасчетов.Наименование));
						УзелДокумент.ДополнительныеРеквизиты.Вставить("ДоговорУИД", СокрЛП(ДокументСсылка.ДоговорВзаиморасчетов.УникальныйИдентификатор()));
						УзелДокумент.ДополнительныеРеквизиты.Вставить("ДоговорНомер", СокрЛП(ДокументСсылка.ДоговорВзаиморасчетов.Номер));
						УзелДокумент.ДополнительныеРеквизиты.Вставить("ДоговорДата", ДокументСсылка.ДоговорВзаиморасчетов.НачПериода);
						УзелДокумент.ДополнительныеРеквизиты.Вставить("ДоговорВид", Метаданные.Перечисления.ВидыДоговоров.ЗначенияПеречисления[Перечисления.ВидыДоговоров.Индекс(ДокументСсылка.ДоговорВзаиморасчетов.ВидДоговора)].Имя);
						УзелДокумент.ДополнительныеРеквизиты.Вставить("ИдентификаторГосКонтракта", СокрЛП(ДокументСсылка.ДоговорВзаиморасчетов.ИдентификаторГосударственногоКонтракта));
						УзелДокумент.ДополнительныеРеквизиты.Вставить("ИдентификационныйКодЗакупки", СокрЛП(ДокументСсылка.ДоговорВзаиморасчетов.ИдентификационныйКодЗакупки));
					Иначе
						УзелДокумент.ДополнительныеРеквизиты.Вставить("Договор", "");
						УзелДокумент.ДополнительныеРеквизиты.Вставить("ДоговорУИД", "");
						УзелДокумент.ДополнительныеРеквизиты.Вставить("ДоговорНомер", "");
						УзелДокумент.ДополнительныеРеквизиты.Вставить("ДоговорДата", "");
						УзелДокумент.ДополнительныеРеквизиты.Вставить("ДоговорВид", "");
						УзелДокумент.ДополнительныеРеквизиты.Вставить("ИдентификаторГосКонтракта", "");
						УзелДокумент.ДополнительныеРеквизиты.Вставить("ИдентификационныйКодЗакупки", "");
					КонецЕсли; 
					
					УзелДокумент.ДополнительныеРеквизиты.Вставить("СчетФактураНомер", СокрЛП(ДокументСсылка.НомерСчф));
					УзелДокумент.ДополнительныеРеквизиты.Вставить("ДатаЗакрытия", ДокументСсылка.Дата);
					
					УзелДокумент.ДополнительныеРеквизиты.Вставить("СуммаДокумента", ДокументСсылка.СуммаДокумента);
					УзелДокумент.ДополнительныеРеквизиты.Вставить("СтавкаНДС", ДокументСсылка.СтавкаНДС.Ставка);
					УзелДокумент.ДополнительныеРеквизиты.Вставить("ПредставлениеНДС", ?(ДокументСсылка.СтавкаНДС.Предопределенный=Истина, Справочники.СтавкиНДС.ПолучитьИмяПредопределенного(ДокументСсылка.СтавкаНДС), СокрЛП(ДокументСсылка.СтавкаНДС)));
					УзелДокумент.ДополнительныеРеквизиты.Вставить("БезНДС", (ДокументСсылка.СтавкаНДС=Справочники.СтавкиНДС.БезНДС));
					
					Для каждого текСтрока Из ДокументСсылка.Товары Цикл
						СтрокаТовары = Новый Структура("Номенклатура, НоменклатураУИД, Цена, Количество, Сумма");
						
						СтрокаТовары.Номенклатура = СокрЛП(текСтрока.Номенклатура);
						СтрокаТовары.НоменклатураУИД = СокрЛП(текСтрока.Номенклатура.УникальныйИдентификатор());
						СтрокаТовары.Цена = текСтрока.Цена;
						СтрокаТовары.Количество = текСтрока.Количество;
						СтрокаТовары.Сумма = текСтрока.Сумма;
						
						УзелДокумент.Товары.Добавить(СтрокаТовары);
					КонецЦикла; 	
				ИначеЕсли текЭлемент="ВыдачаОтветХранениеШин" Тогда
					УзелДокумент.ДополнительныеРеквизиты.Вставить("ТочкаОформления", СокрЛП(ДокументСсылка.ТочкаОформления));
					УзелДокумент.ДополнительныеРеквизиты.Вставить("ТочкаОформленияУИД", СокрЛП(ДокументСсылка.ТочкаОформления.УникальныйИдентификатор()));
					
					УзелДокумент.ДополнительныеРеквизиты.Вставить("Организация", СокрЛП(ДокументСсылка.Организация));
					УзелДокумент.ДополнительныеРеквизиты.Вставить("ОрганизацияИНН", ДокументСсылка.Организация.ИНН);
					УзелДокумент.ДополнительныеРеквизиты.Вставить("ОрганизацияКПП", ДокументСсылка.Организация.КПП);
					
					УзелДокумент.ДополнительныеРеквизиты.Вставить("Контрагент", СокрЛП(ДокументСсылка.Контрагент));
					УзелДокумент.ДополнительныеРеквизиты.Вставить("КонтрагентИНН", ДокументСсылка.Контрагент.ИНН);
					УзелДокумент.ДополнительныеРеквизиты.Вставить("КонтрагентКПП", ДокументСсылка.Контрагент.КПП);
					УзелДокумент.ДополнительныеРеквизиты.Вставить("КонтрагентУИД", СокрЛП(ДокументСсылка.Контрагент.УникальныйИдентификатор()));
					УзелДокумент.ДополнительныеРеквизиты.Вставить("КонтрагентФормаСобственности", 
					?(ТипЗнч(ДокументСсылка.Контрагент)=Тип("СправочникСсылка.Контрагенты")
					, СокрЛП(ДокументСсылка.Контрагент.ТипКонтрагента)
					, СокрЛП(Перечисления.ТипКонтрагента.Юл)));
					
					УзелДокумент.ДополнительныеРеквизиты.Вставить("КонтрагентСтранаНаименование", ВРег(СокрЛП(ДокументСсылка.Контрагент.Страна.Наименование)));
					УзелДокумент.ДополнительныеРеквизиты.Вставить("КонтрагентСтранаКодОКСМ", СокрЛП(ДокументСсылка.Контрагент.Страна.КодОКСМ));
					УзелДокумент.ДополнительныеРеквизиты.Вставить("КонтрагентЭтоРезидент", ДокументСсылка.Контрагент.ПолучитьОбъект().ЭтоРезидент()); 
					
					Если (ТипЗнч(ДокументСсылка.ДоговорВзаиморасчетов)=Тип("СправочникСсылка.ДоговорыВзаиморасчетов")) И ЗначениеЗаполнено(ДокументСсылка.ДоговорВзаиморасчетов) Тогда
						УзелДокумент.ДополнительныеРеквизиты.Вставить("Договор", СокрЛП(ДокументСсылка.ДоговорВзаиморасчетов.Наименование));
						УзелДокумент.ДополнительныеРеквизиты.Вставить("ДоговорУИД", СокрЛП(ДокументСсылка.ДоговорВзаиморасчетов.УникальныйИдентификатор()));
						УзелДокумент.ДополнительныеРеквизиты.Вставить("ДоговорНомер", СокрЛП(ДокументСсылка.ДоговорВзаиморасчетов.Номер));
						УзелДокумент.ДополнительныеРеквизиты.Вставить("ДоговорДата", ДокументСсылка.ДоговорВзаиморасчетов.НачПериода);
						УзелДокумент.ДополнительныеРеквизиты.Вставить("ДоговорВид", Метаданные.Перечисления.ВидыДоговоров.ЗначенияПеречисления[Перечисления.ВидыДоговоров.Индекс(ДокументСсылка.ДоговорВзаиморасчетов.ВидДоговора)].Имя);
						УзелДокумент.ДополнительныеРеквизиты.Вставить("ИдентификаторГосКонтракта", СокрЛП(ДокументСсылка.ДоговорВзаиморасчетов.ИдентификаторГосударственногоКонтракта));
						УзелДокумент.ДополнительныеРеквизиты.Вставить("ИдентификационныйКодЗакупки", СокрЛП(ДокументСсылка.ДоговорВзаиморасчетов.ИдентификационныйКодЗакупки));
					Иначе
						УзелДокумент.ДополнительныеРеквизиты.Вставить("Договор", "");
						УзелДокумент.ДополнительныеРеквизиты.Вставить("ДоговорУИД", "");
						УзелДокумент.ДополнительныеРеквизиты.Вставить("ДоговорНомер", "");
						УзелДокумент.ДополнительныеРеквизиты.Вставить("ДоговорДата", "");
						УзелДокумент.ДополнительныеРеквизиты.Вставить("ДоговорВид", "");
						УзелДокумент.ДополнительныеРеквизиты.Вставить("ИдентификаторГосКонтракта", "");
						УзелДокумент.ДополнительныеРеквизиты.Вставить("ИдентификационныйКодЗакупки", "");
					КонецЕсли; 
					
					УзелДокумент.ДополнительныеРеквизиты.Вставить("СчетФактураНомер", СокрЛП(ДокументСсылка.НомерСчф));
					УзелДокумент.ДополнительныеРеквизиты.Вставить("ДатаЗакрытия", ДокументСсылка.Дата);
					
					УзелДокумент.ДополнительныеРеквизиты.Вставить("СуммаДокумента", ДокументСсылка.СуммаДокумента);
					УзелДокумент.ДополнительныеРеквизиты.Вставить("СтавкаНДС", ДокументСсылка.СтавкаНДС.Ставка);
					УзелДокумент.ДополнительныеРеквизиты.Вставить("ПредставлениеНДС", ?(ДокументСсылка.СтавкаНДС.Предопределенный=Истина, Справочники.СтавкиНДС.ПолучитьИмяПредопределенного(ДокументСсылка.СтавкаНДС), СокрЛП(ДокументСсылка.СтавкаНДС)));
					УзелДокумент.ДополнительныеРеквизиты.Вставить("БезНДС", (ДокументСсылка.СтавкаНДС=Справочники.СтавкиНДС.БезНДС));
					
					Для каждого текСтрока Из ДокументСсылка.Товары Цикл
						СтрокаТовары = Новый Структура("Номенклатура, НоменклатураУИД, Цена, Количество, Сумма");
						
						СтрокаТовары.Номенклатура = СокрЛП(текСтрока.Номенклатура);
						СтрокаТовары.НоменклатураУИД = СокрЛП(текСтрока.Номенклатура.УникальныйИдентификатор());
						СтрокаТовары.Цена = текСтрока.Цена;
						СтрокаТовары.Количество = текСтрока.Количество;
						СтрокаТовары.Сумма = текСтрока.Сумма;
						
						УзелДокумент.Товары.Добавить(СтрокаТовары);
					КонецЦикла; 		
				ИначеЕсли текЭлемент="ПеремещениеТоваров" Тогда
					УзелДокумент.ДополнительныеРеквизиты.Вставить("ТочкаОформления", СокрЛП(ДокументСсылка.ТочкаОформления));
					УзелДокумент.ДополнительныеРеквизиты.Вставить("ТочкаОформленияУИД", СокрЛП(ДокументСсылка.ТочкаОформления.УникальныйИдентификатор()));
					
					УзелДокумент.ДополнительныеРеквизиты.Вставить("СкладОтправитель", СокрЛП(ДокументСсылка.СкладОтправитель));
					УзелДокумент.ДополнительныеРеквизиты.Вставить("СкладОтправительУИД", СокрЛП(ДокументСсылка.СкладОтправитель.УникальныйИдентификатор()));
					УзелДокумент.ДополнительныеРеквизиты.Вставить("ТочкаОформленияОтправитель", СокрЛП(ДокументСсылка.СкладОтправитель.ТочкаОформления));
					УзелДокумент.ДополнительныеРеквизиты.Вставить("ТочкаОформленияОтправительУИД", СокрЛП(ДокументСсылка.СкладОтправитель.ТочкаОформления.УникальныйИдентификатор()));
					
					УзелДокумент.ДополнительныеРеквизиты.Вставить("СкладПолучатель", СокрЛП(ДокументСсылка.СкладПолучатель));
					УзелДокумент.ДополнительныеРеквизиты.Вставить("СкладПолучательУИД", СокрЛП(ДокументСсылка.СкладПолучатель.УникальныйИдентификатор()));
					УзелДокумент.ДополнительныеРеквизиты.Вставить("ТочкаОформленияПолучатель", СокрЛП(ДокументСсылка.СкладПолучатель.ТочкаОформления));
					УзелДокумент.ДополнительныеРеквизиты.Вставить("ТочкаОформленияПолучательУИД", СокрЛП(ДокументСсылка.СкладПолучатель.ТочкаОформления.УникальныйИдентификатор()));
					
					УзелДокумент.ДополнительныеРеквизиты.Вставить("ДатаУчетная", ДокументСсылка.ДатаУчетная);
					
					ДокОбъект = ДокументСсылка.ПолучитьОбъект();
					ДокОбъект.Движения.ОстаткиТоваровКомпании.Прочитать();
					Для каждого текСтрока Из ДокОбъект.Движения.ОстаткиТоваровКомпании Цикл
						Если (НЕ текСтрока.ВидДвижения=ВидДвиженияНакопления.Расход) Тогда
							Продолжить;
						КонецЕсли;
						
						СтрокаТовары = Новый Структура("Номенклатура, НоменклатураУИД, Владелец, ВладелецИНН, ВладелецКПП, Количество, СуммаСебестоимость");
						
						СтрокаТовары.Владелец = СокрЛП(текСтрока.Партия.Организация);
						СтрокаТовары.ВладелецИНН = СокрЛП(текСтрока.Партия.Организация.ИНН);
						СтрокаТовары.ВладелецКПП = СокрЛП(текСтрока.Партия.Организация.КПП);
						
						СтрокаТовары.Номенклатура = СокрЛП(текСтрока.Номенклатура);
						СтрокаТовары.НоменклатураУИД = СокрЛП(текСтрока.Номенклатура.УникальныйИдентификатор());
						
						СтрокаТовары.Количество = текСтрока.Количество;
						СтрокаТовары.СуммаСебестоимость = текСтрока.СуммаСебестоимость;
						
						УзелДокумент.Товары.Добавить(СтрокаТовары);
					КонецЦикла; 
				ИначеЕсли текЭлемент="ПоступлениеТоваров" Тогда
					УзелДокумент.ДополнительныеРеквизиты.Вставить("ТочкаОформления", СокрЛП(ДокументСсылка.ТочкаОформления));
					УзелДокумент.ДополнительныеРеквизиты.Вставить("ТочкаОформленияУИД", СокрЛП(ДокументСсылка.ТочкаОформления.УникальныйИдентификатор()));
					
					УзелДокумент.ДополнительныеРеквизиты.Вставить("Организация", СокрЛП(ДокументСсылка.Организация));
					УзелДокумент.ДополнительныеРеквизиты.Вставить("ОрганизацияИНН", ДокументСсылка.Организация.ИНН);
					УзелДокумент.ДополнительныеРеквизиты.Вставить("ОрганизацияКПП", ДокументСсылка.Организация.КПП);
					
					УзелДокумент.ДополнительныеРеквизиты.Вставить("Контрагент", СокрЛП(ДокументСсылка.Контрагент));
					УзелДокумент.ДополнительныеРеквизиты.Вставить("КонтрагентИНН", ДокументСсылка.Контрагент.ИНН);
					УзелДокумент.ДополнительныеРеквизиты.Вставить("КонтрагентКПП", ДокументСсылка.Контрагент.КПП);
					УзелДокумент.ДополнительныеРеквизиты.Вставить("КонтрагентУИД", СокрЛП(ДокументСсылка.Контрагент.УникальныйИдентификатор()));     
					
					Страна = ДокументСсылка.Контрагент.Страна;
					Если ЗначениеЗаполнено(Страна) и не Страна.ЭтоГруппа и Страна.ЭтоСтрана Тогда
						УзелДокумент.ДополнительныеРеквизиты.Вставить("СтранаКод", Страна.КодОКСМ);
					Иначе
						УзелДокумент.ДополнительныеРеквизиты.Вставить("СтранаКод", "");
					КонецЕсли;
					
					
					УзелДокумент.ДополнительныеРеквизиты.Вставить("КонтрагентФормаСобственности", 
					?(ТипЗнч(ДокументСсылка.Контрагент)=Тип("СправочникСсылка.Контрагенты")
					, СокрЛП(ДокументСсылка.Контрагент.ТипКонтрагента)
					, СокрЛП(Перечисления.ТипКонтрагента.Юл)));
					
					УзелДокумент.ДополнительныеРеквизиты.Вставить("КонтрагентСтранаНаименование", ВРег(СокрЛП(ДокументСсылка.Контрагент.Страна.Наименование)));
					УзелДокумент.ДополнительныеРеквизиты.Вставить("КонтрагентСтранаКодОКСМ", СокрЛП(ДокументСсылка.Контрагент.Страна.КодОКСМ));
					УзелДокумент.ДополнительныеРеквизиты.Вставить("КонтрагентЭтоРезидент", ДокументСсылка.Контрагент.ПолучитьОбъект().ЭтоРезидент()); 
					
					Если (ТипЗнч(ДокументСсылка.ДоговорВзаиморасчетов)=Тип("СправочникСсылка.ДоговорыВзаиморасчетов")) И ЗначениеЗаполнено(ДокументСсылка.ДоговорВзаиморасчетов) Тогда
						УзелДокумент.ДополнительныеРеквизиты.Вставить("Договор", СокрЛП(ДокументСсылка.ДоговорВзаиморасчетов.Наименование));
						УзелДокумент.ДополнительныеРеквизиты.Вставить("ДоговорУИД", СокрЛП(ДокументСсылка.ДоговорВзаиморасчетов.УникальныйИдентификатор()));
						УзелДокумент.ДополнительныеРеквизиты.Вставить("ДоговорНомер", СокрЛП(ДокументСсылка.ДоговорВзаиморасчетов.Номер));
						УзелДокумент.ДополнительныеРеквизиты.Вставить("ДоговорДата", ДокументСсылка.ДоговорВзаиморасчетов.НачПериода);
						УзелДокумент.ДополнительныеРеквизиты.Вставить("ДоговорВид", Метаданные.Перечисления.ВидыДоговоров.ЗначенияПеречисления[Перечисления.ВидыДоговоров.Индекс(ДокументСсылка.ДоговорВзаиморасчетов.ВидДоговора)].Имя);
						УзелДокумент.ДополнительныеРеквизиты.Вставить("ДоговорВалютаКод", ?(ЗначениеЗаполнено(ДокументСсылка.ДоговорВзаиморасчетов.Валюта),ДокументСсылка.ДоговорВзаиморасчетов.Валюта.Код,""));
						УзелДокумент.ДополнительныеРеквизиты.Вставить("ИдентификаторГосКонтракта", СокрЛП(ДокументСсылка.ДоговорВзаиморасчетов.ИдентификаторГосударственногоКонтракта));
						УзелДокумент.ДополнительныеРеквизиты.Вставить("ИдентификационныйКодЗакупки", СокрЛП(ДокументСсылка.ДоговорВзаиморасчетов.ИдентификационныйКодЗакупки));
										
					Иначе
						УзелДокумент.ДополнительныеРеквизиты.Вставить("Договор", "");
						УзелДокумент.ДополнительныеРеквизиты.Вставить("ДоговорУИД", "");
						УзелДокумент.ДополнительныеРеквизиты.Вставить("ДоговорНомер", "");
						УзелДокумент.ДополнительныеРеквизиты.Вставить("ДоговорДата", "");
						УзелДокумент.ДополнительныеРеквизиты.Вставить("ДоговорВид", "");
						УзелДокумент.ДополнительныеРеквизиты.Вставить("ИдентификаторГосКонтракта", "");
						УзелДокумент.ДополнительныеРеквизиты.Вставить("ИдентификационныйКодЗакупки", "");
					КонецЕсли; 
					
					УзелДокумент.ДополнительныеРеквизиты.Вставить("НомерВходящегоДокумента", СокрЛП(ДокументСсылка.Номер));
					УзелДокумент.ДополнительныеРеквизиты.Вставить("ДатаВходящегоДокумента", ДокументСсылка.ВхДата);
					
					УзелДокумент.ДополнительныеРеквизиты.Вставить("СчетФактураНомер", СокрЛП(ДокументСсылка.СчфНомер));
					УзелДокумент.ДополнительныеРеквизиты.Вставить("СчетФактураДата", ДокументСсылка.СчфДата);
					
					УзелДокумент.ДополнительныеРеквизиты.Вставить("СуммаДокумента", ДокументСсылка.СуммаДокумента);
					УзелДокумент.ДополнительныеРеквизиты.Вставить("Курс", ДокументСсылка.Курс);  
					Если ЗначениеЗаполнено(ДокументСсылка.НомерГТД) Тогда
						УзелДокумент.ДополнительныеРеквизиты.Вставить("ГТДНомер", ДокументСсылка.НомерГТД.Код);
					Иначе
						УзелДокумент.ДополнительныеРеквизиты.Вставить("ГТДНомер", "");
					КонецЕсли;	
					
					Валюта = ДокументСсылка.Валюта;
						Если ЗначениеЗаполнено(Валюта)  Тогда
							УзелДокумент.ДополнительныеРеквизиты.Вставить("ВалютаКод", Валюта.Код);
						Иначе
							УзелДокумент.ДополнительныеРеквизиты.Вставить("ВалютаКод", "");
						КонецЕсли;
                    Курс = ДокументСсылка.Курс;
						Если ЗначениеЗаполнено(Курс)  Тогда
							УзелДокумент.ДополнительныеРеквизиты.Вставить("Курс", Курс);
						Иначе
							УзелДокумент.ДополнительныеРеквизиты.Вставить("Курс", 0);
						КонецЕсли;
					
					УзелДокумент.ДополнительныеРеквизиты.Вставить("ВозвратПокупателя", ДокументСсылка.ВозвратПокупателя);     
					
					ПротоколПроверкиДокумента = РегистрыСведений.ПротоколПроверкиДокументов.ПолучитьЗаписьРегистра(ДокументСсылка);
					Если ПротоколПроверкиДокумента=Неопределено Тогда
						УзелДокумент.ДополнительныеРеквизиты.Вставить("ДокументПроверен", Ложь);
					Иначе
						УзелДокумент.ДополнительныеРеквизиты.Вставить("ДокументПроверен", ПротоколПроверкиДокумента.ДокументПроверен);
					КонецЕсли;
					
					Для каждого текСтрока Из ДокументСсылка.Товары Цикл
						СтрокаТовары = Новый Структура("Номенклатура, НоменклатураУИД, Цена, ЦенаВал, Количество, Сумма, СуммаВал, СтавкаНДС, СуммаНДС, ПредставлениеНДС, БезНДС,ИдентификаторСтроки");
						
						СтрокаТовары.Номенклатура = СокрЛП(текСтрока.Номенклатура);
						СтрокаТовары.НоменклатураУИД = СокрЛП(текСтрока.Номенклатура.УникальныйИдентификатор());
						СтрокаТовары.ЦенаВал = текСтрока.ЦенаВал;
						СтрокаТовары.Количество = текСтрока.Количество;
						СтрокаТовары.СуммаВал = текСтрока.СуммаВал;
						СтрокаТовары.Цена = текСтрока.Цена;
						СтрокаТовары.Сумма = текСтрока.Сумма;
						СтрокаТовары.СтавкаНДС = текСтрока.СтавкаНДС.Ставка;
						СтрокаТовары.СуммаНДС = текСтрока.СуммаНДС;
						СтрокаТовары.ПредставлениеНДС = ?(текСтрока.СтавкаНДС.Предопределенный=Истина, Справочники.СтавкиНДС.ПолучитьИмяПредопределенного(текСтрока.СтавкаНДС), СокрЛП(текСтрока.СтавкаНДС));
						СтрокаТовары.БезНДС = (текСтрока.СтавкаНДС=Справочники.СтавкиНДС.БезНДС);
						СтрокаТовары.ИдентификаторСтроки = СокрЛП(текСтрока.ИдентификаторСтроки);
						
						УзелДокумент.Товары.Добавить(СтрокаТовары);
					КонецЦикла;
					
					Для каждого текСтрока Из ДокументСсылка.СведенияПрослеживаемости Цикл
						СтрокаРНПТ = Новый Структура("Номенклатура, ИдентификаторСтроки, Количество, КоличествоПрослеживаемости, СтранаПроисхождения, Сумма, РНПТ, РНПТУИД");
						
						СтрокаРНПТ.Номенклатура = СокрЛП(текСтрока.Номенклатура);
						СтрокаРНПТ.ИдентификаторСтроки = СокрЛП(текСтрока.ИдентификаторСтроки);
						СтрокаРНПТ.Количество = текСтрока.Количество;
						СтрокаРНПТ.КоличествоПрослеживаемости = текСтрока.КоличествоПрослеживаемости;
						СтрокаРНПТ.СтранаПроисхождения = текСтрока.СтранаПроисхождения;
						СтрокаРНПТ.РНПТ = СокрЛП(текСтрока.РНПТ);
						СтрокаРНПТ.РНПТУИД = СокрЛП(текСтрока.РНПТ.УникальныйИдентификатор());
						
						
						УзелДокумент.РНПТ.Добавить(СтрокаРНПТ);
					КонецЦикла;
					
					
				ИначеЕсли текЭлемент="ПоступлениеУслуг" Тогда
					УзелДокумент.ДополнительныеРеквизиты.Вставить("ТочкаОформления", СокрЛП(ДокументСсылка.ТочкаОформления));
					УзелДокумент.ДополнительныеРеквизиты.Вставить("ТочкаОформленияУИД", СокрЛП(ДокументСсылка.ТочкаОформления.УникальныйИдентификатор()));
					
					УзелДокумент.ДополнительныеРеквизиты.Вставить("Организация", СокрЛП(ДокументСсылка.Организация));
					УзелДокумент.ДополнительныеРеквизиты.Вставить("ОрганизацияИНН", ДокументСсылка.Организация.ИНН);
					УзелДокумент.ДополнительныеРеквизиты.Вставить("ОрганизацияКПП", ДокументСсылка.Организация.КПП);
					
					УзелДокумент.ДополнительныеРеквизиты.Вставить("Контрагент", СокрЛП(ДокументСсылка.Контрагент));
					УзелДокумент.ДополнительныеРеквизиты.Вставить("КонтрагентИНН", ДокументСсылка.Контрагент.ИНН);
					УзелДокумент.ДополнительныеРеквизиты.Вставить("КонтрагентКПП", ДокументСсылка.Контрагент.КПП);
					УзелДокумент.ДополнительныеРеквизиты.Вставить("КонтрагентУИД", СокрЛП(ДокументСсылка.Контрагент.УникальныйИдентификатор()));
					УзелДокумент.ДополнительныеРеквизиты.Вставить("КонтрагентФормаСобственности", 
					?(ТипЗнч(ДокументСсылка.Контрагент)=Тип("СправочникСсылка.Контрагенты")
					, СокрЛП(ДокументСсылка.Контрагент.ТипКонтрагента)
					, СокрЛП(Перечисления.ТипКонтрагента.Юл)));
					
					УзелДокумент.ДополнительныеРеквизиты.Вставить("КонтрагентСтранаНаименование", ВРег(СокрЛП(ДокументСсылка.Контрагент.Страна.Наименование)));
					УзелДокумент.ДополнительныеРеквизиты.Вставить("КонтрагентСтранаКодОКСМ", СокрЛП(ДокументСсылка.Контрагент.Страна.КодОКСМ));
					УзелДокумент.ДополнительныеРеквизиты.Вставить("КонтрагентЭтоРезидент", ДокументСсылка.Контрагент.ПолучитьОбъект().ЭтоРезидент()); 
					
					Если (ТипЗнч(ДокументСсылка.ДоговорВзаиморасчетов)=Тип("СправочникСсылка.ДоговорыВзаиморасчетов")) И ЗначениеЗаполнено(ДокументСсылка.ДоговорВзаиморасчетов) Тогда
						УзелДокумент.ДополнительныеРеквизиты.Вставить("Договор", СокрЛП(ДокументСсылка.ДоговорВзаиморасчетов.Наименование));
						УзелДокумент.ДополнительныеРеквизиты.Вставить("ДоговорУИД", СокрЛП(ДокументСсылка.ДоговорВзаиморасчетов.УникальныйИдентификатор()));
						УзелДокумент.ДополнительныеРеквизиты.Вставить("ДоговорНомер", СокрЛП(ДокументСсылка.ДоговорВзаиморасчетов.Номер));
						УзелДокумент.ДополнительныеРеквизиты.Вставить("ДоговорДата", ДокументСсылка.ДоговорВзаиморасчетов.НачПериода);
						УзелДокумент.ДополнительныеРеквизиты.Вставить("ДоговорВид", Метаданные.Перечисления.ВидыДоговоров.ЗначенияПеречисления[Перечисления.ВидыДоговоров.Индекс(ДокументСсылка.ДоговорВзаиморасчетов.ВидДоговора)].Имя);
						УзелДокумент.ДополнительныеРеквизиты.Вставить("ИдентификаторГосКонтракта", СокрЛП(ДокументСсылка.ДоговорВзаиморасчетов.ИдентификаторГосударственногоКонтракта));
						УзелДокумент.ДополнительныеРеквизиты.Вставить("ИдентификационныйКодЗакупки", СокрЛП(ДокументСсылка.ДоговорВзаиморасчетов.ИдентификационныйКодЗакупки));
					Иначе
						УзелДокумент.ДополнительныеРеквизиты.Вставить("Договор", "");
						УзелДокумент.ДополнительныеРеквизиты.Вставить("ДоговорУИД", "");
						УзелДокумент.ДополнительныеРеквизиты.Вставить("ДоговорНомер", "");
						УзелДокумент.ДополнительныеРеквизиты.Вставить("ДоговорДата", "");
						УзелДокумент.ДополнительныеРеквизиты.Вставить("ДоговорВид", "");
						УзелДокумент.ДополнительныеРеквизиты.Вставить("ИдентификаторГосКонтракта", "");
						УзелДокумент.ДополнительныеРеквизиты.Вставить("ИдентификационныйКодЗакупки", "");
					КонецЕсли; 
					
					УзелДокумент.ДополнительныеРеквизиты.Вставить("НомерВходящегоДокумента", СокрЛП(ДокументСсылка.Номер));
					УзелДокумент.ДополнительныеРеквизиты.Вставить("ДатаВходящегоДокумента", ДокументСсылка.ВхДата);
					
					УзелДокумент.ДополнительныеРеквизиты.Вставить("СчетФактураНомер", СокрЛП(ДокументСсылка.СчфНомер));
					УзелДокумент.ДополнительныеРеквизиты.Вставить("СчетФактураДата", ДокументСсылка.СчфДата);
					
					УзелДокумент.ДополнительныеРеквизиты.Вставить("СуммаДокумента", ДокументСсылка.СуммаДокумента);
					
					
					ПротоколПроверкиДокумента = РегистрыСведений.ПротоколПроверкиДокументов.ПолучитьЗаписьРегистра(ДокументСсылка);
					Если ПротоколПроверкиДокумента=Неопределено Тогда
						УзелДокумент.ДополнительныеРеквизиты.Вставить("ДокументПроверен", Ложь);
					Иначе
						УзелДокумент.ДополнительныеРеквизиты.Вставить("ДокументПроверен", ПротоколПроверкиДокумента.ДокументПроверен);
					КонецЕсли;
					
					Для каждого текСтрока Из ДокументСсылка.Услуги Цикл
						СтрокаТовары = Новый Структура("Номенклатура, НоменклатураУИД, Цена, ЦенаВал, Количество, Сумма, СуммаВал, СтавкаНДС, СуммаНДС, ПредставлениеНДС, БезНДС,ИдентификаторСтроки");
						
						СтрокаТовары.Номенклатура = СокрЛП(текСтрока.Услуга);
						СтрокаТовары.НоменклатураУИД = СокрЛП(текСтрока.Услуга.УникальныйИдентификатор());
						СтрокаТовары.Количество = текСтрока.Количество;
						СтрокаТовары.Цена = текСтрока.Цена;
						СтрокаТовары.Сумма = текСтрока.Сумма;
						СтрокаТовары.СтавкаНДС = текСтрока.СтавкаНДС.Ставка;
						СтрокаТовары.СуммаНДС = текСтрока.СуммаНДС;
						СтрокаТовары.ПредставлениеНДС = ?(текСтрока.СтавкаНДС.Предопределенный=Истина, Справочники.СтавкиНДС.ПолучитьИмяПредопределенного(текСтрока.СтавкаНДС), СокрЛП(текСтрока.СтавкаНДС));
						СтрокаТовары.БезНДС = (текСтрока.СтавкаНДС=Справочники.СтавкиНДС.БезНДС);
						
						УзелДокумент.Товары.Добавить(СтрокаТовары);
					КонецЦикла;
					
				ИначеЕсли текЭлемент="ЗаявлениеОВвозеТоваровПолученное" Тогда
					//УзелДокумент.ДополнительныеРеквизиты.Вставить("ТочкаОформления", СокрЛП(ДокументСсылка.ТочкаОформления));
					//УзелДокумент.ДополнительныеРеквизиты.Вставить("ТочкаОформленияУИД", СокрЛП(ДокументСсылка.ТочкаОформления.УникальныйИдентификатор()));
					
					УзелДокумент.ДополнительныеРеквизиты.Вставить("Организация", СокрЛП(ДокументСсылка.Организация));
					УзелДокумент.ДополнительныеРеквизиты.Вставить("ОрганизацияИНН", ДокументСсылка.Организация.ИНН);
					УзелДокумент.ДополнительныеРеквизиты.Вставить("ОрганизацияКПП", ДокументСсылка.Организация.КПП);
					
					УзелДокумент.ДополнительныеРеквизиты.Вставить("Контрагент", СокрЛП(ДокументСсылка.Контрагент));
					УзелДокумент.ДополнительныеРеквизиты.Вставить("КонтрагентИНН", ДокументСсылка.Контрагент.ИНН);
					УзелДокумент.ДополнительныеРеквизиты.Вставить("КонтрагентКПП", ДокументСсылка.Контрагент.КПП);
					УзелДокумент.ДополнительныеРеквизиты.Вставить("КонтрагентУИД", СокрЛП(ДокументСсылка.Контрагент.УникальныйИдентификатор()));
					УзелДокумент.ДополнительныеРеквизиты.Вставить("КонтрагентФормаСобственности", 
					?(ТипЗнч(ДокументСсылка.Контрагент)=Тип("СправочникСсылка.Контрагенты")
					, СокрЛП(ДокументСсылка.Контрагент.ТипКонтрагента)
					, СокрЛП(Перечисления.ТипКонтрагента.Юл)));
					
					УзелДокумент.ДополнительныеРеквизиты.Вставить("КонтрагентСтранаНаименование", ВРег(СокрЛП(ДокументСсылка.Контрагент.Страна.Наименование)));
					УзелДокумент.ДополнительныеРеквизиты.Вставить("КонтрагентСтранаКодОКСМ", СокрЛП(ДокументСсылка.Контрагент.Страна.КодОКСМ));
					УзелДокумент.ДополнительныеРеквизиты.Вставить("КонтрагентЭтоРезидент", ДокументСсылка.Контрагент.ПолучитьОбъект().ЭтоРезидент()); 
					
					Если (ТипЗнч(ДокументСсылка.ДоговорВзаиморасчетов)=Тип("СправочникСсылка.ДоговорыВзаиморасчетов")) И ЗначениеЗаполнено(ДокументСсылка.ДоговорВзаиморасчетов) Тогда
						УзелДокумент.ДополнительныеРеквизиты.Вставить("Договор", СокрЛП(ДокументСсылка.ДоговорВзаиморасчетов.Наименование));
						УзелДокумент.ДополнительныеРеквизиты.Вставить("ДоговорУИД", СокрЛП(ДокументСсылка.ДоговорВзаиморасчетов.УникальныйИдентификатор()));
						УзелДокумент.ДополнительныеРеквизиты.Вставить("ДоговорНомер", СокрЛП(ДокументСсылка.ДоговорВзаиморасчетов.Номер));
						УзелДокумент.ДополнительныеРеквизиты.Вставить("ДоговорДата", ДокументСсылка.ДоговорВзаиморасчетов.НачПериода);
						УзелДокумент.ДополнительныеРеквизиты.Вставить("ДоговорВид", Метаданные.Перечисления.ВидыДоговоров.ЗначенияПеречисления[Перечисления.ВидыДоговоров.Индекс(ДокументСсылка.ДоговорВзаиморасчетов.ВидДоговора)].Имя);
						УзелДокумент.ДополнительныеРеквизиты.Вставить("ИдентификаторГосКонтракта", СокрЛП(ДокументСсылка.ДоговорВзаиморасчетов.ИдентификаторГосударственногоКонтракта));
						УзелДокумент.ДополнительныеРеквизиты.Вставить("ИдентификационныйКодЗакупки", СокрЛП(ДокументСсылка.ДоговорВзаиморасчетов.ИдентификационныйКодЗакупки));
					Иначе
						УзелДокумент.ДополнительныеРеквизиты.Вставить("Договор", "");
						УзелДокумент.ДополнительныеРеквизиты.Вставить("ДоговорУИД", "");
						УзелДокумент.ДополнительныеРеквизиты.Вставить("ДоговорНомер", "");
						УзелДокумент.ДополнительныеРеквизиты.Вставить("ДоговорДата", "");
						УзелДокумент.ДополнительныеРеквизиты.Вставить("ДоговорВид", "");
						УзелДокумент.ДополнительныеРеквизиты.Вставить("ИдентификаторГосКонтракта", "");
						УзелДокумент.ДополнительныеРеквизиты.Вставить("ИдентификационныйКодЗакупки", "");
					КонецЕсли; 
					
					УзелДокумент.ДополнительныеРеквизиты.Вставить("НомерВходящегоДокумента", СокрЛП(ДокументСсылка.Номер));
					УзелДокумент.ДополнительныеРеквизиты.Вставить("ДатаВходящегоДокумента", ДокументСсылка.ВхДата);
					
					//УзелДокумент.ДополнительныеРеквизиты.Вставить("СчетФактураНомер", СокрЛП(ДокументСсылка.СчфНомер));
					//УзелДокумент.ДополнительныеРеквизиты.Вставить("СчетФактураДата", ДокументСсылка.СчфДата);
					
					//УзелДокумент.ДополнительныеРеквизиты.Вставить("СуммаДокумента", ДокументСсылка.СуммаДокумента);
					
					
					//ПротоколПроверкиДокумента = РегистрыСведений.ПротоколПроверкиДокументов.ПолучитьЗаписьРегистра(ДокументСсылка);
					//Если ПротоколПроверкиДокумента=Неопределено Тогда
					//	УзелДокумент.ДополнительныеРеквизиты.Вставить("ДокументПроверен", Ложь);
					//Иначе
					//	УзелДокумент.ДополнительныеРеквизиты.Вставить("ДокументПроверен", ПротоколПроверкиДокумента.ДокументПроверен);
					//КонецЕсли;
					
					Для каждого текСтрока Из ДокументСсылка.ДокументыОтгрузки Цикл
						СтрокаДокументыОтгрузки = Новый Структура("ДокументОтгрузки");
						
						СтрокаДокументыОтгрузки.ДокументОтгрузки = СокрЛП(текСтрока.ДокументОтгрузки);
						СтрокаТовары.ДокументОтгрузкиУИД = СокрЛП(текСтрока.ДокументОтгрузки.УникальныйИдентификатор());
						
						
						УзелДокумент.ДокументыОтгрузки.Добавить(СтрокаДокументыОтгрузки);
					КонецЦикла;	
					
				ИначеЕсли текЭлемент="РеализацияТоваров" Тогда
					УзелДокумент.ДополнительныеРеквизиты.Вставить("ТочкаОформления", СокрЛП(ДокументСсылка.ТочкаОформления));
					УзелДокумент.ДополнительныеРеквизиты.Вставить("ТочкаОформленияУИД", СокрЛП(ДокументСсылка.ТочкаОформления.УникальныйИдентификатор()));
					
					УзелДокумент.ДополнительныеРеквизиты.Вставить("Организация", СокрЛП(ДокументСсылка.Организация));
					УзелДокумент.ДополнительныеРеквизиты.Вставить("ОрганизацияИНН", ДокументСсылка.Организация.ИНН);
					УзелДокумент.ДополнительныеРеквизиты.Вставить("ОрганизацияКПП", ДокументСсылка.Организация.КПП);
					
					УзелДокумент.ДополнительныеРеквизиты.Вставить("Контрагент", СокрЛП(ДокументСсылка.Контрагент));
					УзелДокумент.ДополнительныеРеквизиты.Вставить("КонтрагентИНН", ДокументСсылка.Контрагент.ИНН);
					УзелДокумент.ДополнительныеРеквизиты.Вставить("КонтрагентКПП", ДокументСсылка.Контрагент.КПП);
					УзелДокумент.ДополнительныеРеквизиты.Вставить("КонтрагентУИД", СокрЛП(ДокументСсылка.Контрагент.УникальныйИдентификатор()));
					УзелДокумент.ДополнительныеРеквизиты.Вставить("КонтрагентФормаСобственности", 
					?(ТипЗнч(ДокументСсылка.Контрагент)=Тип("СправочникСсылка.Контрагенты")
					, СокрЛП(ДокументСсылка.Контрагент.ТипКонтрагента)
					, СокрЛП(Перечисления.ТипКонтрагента.Юл)));
					
					УзелДокумент.ДополнительныеРеквизиты.Вставить("КонтрагентСтранаНаименование", ВРег(СокрЛП(ДокументСсылка.Контрагент.Страна.Наименование)));
					УзелДокумент.ДополнительныеРеквизиты.Вставить("КонтрагентСтранаКодОКСМ", СокрЛП(ДокументСсылка.Контрагент.Страна.КодОКСМ));
					УзелДокумент.ДополнительныеРеквизиты.Вставить("КонтрагентЭтоРезидент", ДокументСсылка.Контрагент.ПолучитьОбъект().ЭтоРезидент()); 
					Если ДокументСсылка.ВидОперации <> Перечисления.ВидыОперацийРеализацияТоваров.ПустаяСсылка() тогда
						УзелДокумент.ДополнительныеРеквизиты.Вставить("ВидОперации", Метаданные.Перечисления.ВидыОперацийРеализацияТоваров.ЗначенияПеречисления[Перечисления.ВидыОперацийРеализацияТоваров.Индекс(ДокументСсылка.ВидОперации)].Имя);
					Иначе
						УзелДокумент.ДополнительныеРеквизиты.Вставить("ВидОперации", Метаданные.Перечисления.ВидыОперацийРеализацияТоваров.ЗначенияПеречисления[Перечисления.ВидыОперацийРеализацияТоваров.Индекс(Перечисления.ВидыОперацийРеализацияТоваров.Реализация)].Имя);
					КонецЕсли;
					
					Если (ТипЗнч(ДокументСсылка.ДоговорВзаиморасчетов)=Тип("СправочникСсылка.ДоговорыВзаиморасчетов")) И ЗначениеЗаполнено(ДокументСсылка.ДоговорВзаиморасчетов) Тогда
						УзелДокумент.ДополнительныеРеквизиты.Вставить("Договор", СокрЛП(ДокументСсылка.ДоговорВзаиморасчетов.Наименование));
						УзелДокумент.ДополнительныеРеквизиты.Вставить("ДоговорУИД", СокрЛП(ДокументСсылка.ДоговорВзаиморасчетов.УникальныйИдентификатор()));
						УзелДокумент.ДополнительныеРеквизиты.Вставить("ДоговорНомер", СокрЛП(ДокументСсылка.ДоговорВзаиморасчетов.Номер));
						УзелДокумент.ДополнительныеРеквизиты.Вставить("ДоговорДата", ДокументСсылка.ДоговорВзаиморасчетов.НачПериода);
						УзелДокумент.ДополнительныеРеквизиты.Вставить("ДоговорВид", Метаданные.Перечисления.ВидыДоговоров.ЗначенияПеречисления[Перечисления.ВидыДоговоров.Индекс(ДокументСсылка.ДоговорВзаиморасчетов.ВидДоговора)].Имя);
						УзелДокумент.ДополнительныеРеквизиты.Вставить("ИдентификаторГосКонтракта", СокрЛП(ДокументСсылка.ДоговорВзаиморасчетов.ИдентификаторГосударственногоКонтракта));
						УзелДокумент.ДополнительныеРеквизиты.Вставить("ИдентификационныйКодЗакупки", СокрЛП(ДокументСсылка.ДоговорВзаиморасчетов.ИдентификационныйКодЗакупки));
					Иначе
						УзелДокумент.ДополнительныеРеквизиты.Вставить("Договор", "");
						УзелДокумент.ДополнительныеРеквизиты.Вставить("ДоговорУИД", "");
						УзелДокумент.ДополнительныеРеквизиты.Вставить("ДоговорНомер", "");
						УзелДокумент.ДополнительныеРеквизиты.Вставить("ДоговорДата", "");
						УзелДокумент.ДополнительныеРеквизиты.Вставить("ДоговорВид", "");
						УзелДокумент.ДополнительныеРеквизиты.Вставить("ИдентификаторГосКонтракта", "");
						УзелДокумент.ДополнительныеРеквизиты.Вставить("ИдентификационныйКодЗакупки", "");
					КонецЕсли; 
					
					УзелДокумент.ДополнительныеРеквизиты.Вставить("СчетФактураНомер", СокрЛП(ДокументСсылка.НомерСчф));
					УзелДокумент.ДополнительныеРеквизиты.Вставить("СчетФактураДата", ДокументСсылка.Дата);
					
					УзелДокумент.ДополнительныеРеквизиты.Вставить("СуммаДокумента", ДокументСсылка.СуммаДокумента);
					
					ПротоколПроверкиДокумента = РегистрыСведений.ПротоколПроверкиДокументов.ПолучитьЗаписьРегистра(ДокументСсылка);
					Если ПротоколПроверкиДокумента=Неопределено Тогда
						УзелДокумент.ДополнительныеРеквизиты.Вставить("ДокументПроверен", Ложь);
					Иначе
						УзелДокумент.ДополнительныеРеквизиты.Вставить("ДокументПроверен", ПротоколПроверкиДокумента.ДокументПроверен);
					КонецЕсли;
					
					Страна = ДокументСсылка.Контрагент.Страна;
					Если ЗначениеЗаполнено(Страна) и не Страна.ЭтоГруппа и Страна.ЭтоСтрана Тогда
						УзелДокумент.ДополнительныеРеквизиты.Вставить("СтранаКод", Страна.КодОКСМ);
					Иначе
						УзелДокумент.ДополнительныеРеквизиты.Вставить("СтранаКод", "");
					КонецЕсли;
					
					
					
					
					
					Для каждого текСтрока Из ДокументСсылка.Товары Цикл
						СтрокаТовары = Новый Структура("Номенклатура, НоменклатураУИД, Цена, Количество, Сумма, СтавкаНДС, СуммаНДС, ПредставлениеНДС, БезНДС");
						
						СтрокаТовары.Номенклатура = СокрЛП(текСтрока.Номенклатура);
						СтрокаТовары.НоменклатураУИД = СокрЛП(текСтрока.Номенклатура.УникальныйИдентификатор());
						СтрокаТовары.Цена = текСтрока.Цена;
						СтрокаТовары.Количество = текСтрока.Количество;
						СтрокаТовары.Сумма = текСтрока.Сумма;
						СтрокаТовары.СтавкаНДС = текСтрока.СтавкаНДС.Ставка;
						СтрокаТовары.СуммаНДС = текСтрока.СуммаНДС;
						СтрокаТовары.ПредставлениеНДС = ?(текСтрока.СтавкаНДС.Предопределенный=Истина, Справочники.СтавкиНДС.ПолучитьИмяПредопределенного(текСтрока.СтавкаНДС), СокрЛП(текСтрока.СтавкаНДС));
						СтрокаТовары.БезНДС = (текСтрока.СтавкаНДС=Справочники.СтавкиНДС.БезНДС);
						
						УзелДокумент.Товары.Добавить(СтрокаТовары);
					КонецЦикла; 
					Если ДокументыРНПТ.Найти(ДокументСсылка)<> Неопределено тогда
						ТЗРНПТ = ПолучитьРНПТ(ДокументСсылка);
						
						Для каждого текСтрока Из ТЗРНПТ Цикл
							СтрокаРНПТ = Новый Структура("Номенклатура, Количество, КоличествоПрослеживаемости, СтранаПроисхождения, Сумма, РНПТ, РНПТУИД");
							
							СтрокаРНПТ.Номенклатура = СокрЛП(текСтрока.Номенклатура);
							СтрокаРНПТ.Количество = текСтрока.Количество;
							СтрокаРНПТ.КоличествоПрослеживаемости = текСтрока.КоличествоПрослеживаемости;
							СтрокаРНПТ.СтранаПроисхождения = текСтрока.СтранаПроисхождения;
							СтрокаРНПТ.РНПТ = СокрЛП(текСтрока.РНПТ);
							СтрокаРНПТ.РНПТУИД = СокрЛП(текСтрока.РНПТ.УникальныйИдентификатор());
							
							УзелДокумент.РНПТ.Добавить(СтрокаРНПТ);
						КонецЦикла;
						
						
						
						
					КонецЕсли;	
					
					Если  ДокументСсылка.ВидОперации = Перечисления.ВидыОперацийРеализацияТоваров.ПередачаНаКомиссию тогда
						
						МассивДокументовПередачиНаКомиссию.Добавить(ДокументСсылка);						
						
					КонецЕсли;	
					
				ИначеЕсли текЭлемент="ОтчетКомиссионера" Тогда
					УзелДокумент.ДополнительныеРеквизиты.Вставить("ТочкаОформления", СокрЛП(ДокументСсылка.ТочкаОформления));
					УзелДокумент.ДополнительныеРеквизиты.Вставить("ТочкаОформленияУИД", СокрЛП(ДокументСсылка.ТочкаОформления.УникальныйИдентификатор()));
					
					УзелДокумент.ДополнительныеРеквизиты.Вставить("Организация", СокрЛП(ДокументСсылка.Организация));
					УзелДокумент.ДополнительныеРеквизиты.Вставить("ОрганизацияИНН", ДокументСсылка.Организация.ИНН);
					УзелДокумент.ДополнительныеРеквизиты.Вставить("ОрганизацияКПП", ДокументСсылка.Организация.КПП);
					
					УзелДокумент.ДополнительныеРеквизиты.Вставить("Контрагент", СокрЛП(ДокументСсылка.Контрагент));
					УзелДокумент.ДополнительныеРеквизиты.Вставить("КонтрагентИНН", ДокументСсылка.Контрагент.ИНН);
					УзелДокумент.ДополнительныеРеквизиты.Вставить("КонтрагентКПП", ДокументСсылка.Контрагент.КПП);
					УзелДокумент.ДополнительныеРеквизиты.Вставить("КонтрагентУИД", СокрЛП(ДокументСсылка.Контрагент.УникальныйИдентификатор()));
					УзелДокумент.ДополнительныеРеквизиты.Вставить("КонтрагентФормаСобственности", 
					?(ТипЗнч(ДокументСсылка.Контрагент)=Тип("СправочникСсылка.Контрагенты")
					, СокрЛП(ДокументСсылка.Контрагент.ТипКонтрагента)
					, СокрЛП(Перечисления.ТипКонтрагента.Юл)));
					
					УзелДокумент.ДополнительныеРеквизиты.Вставить("КонтрагентСтранаНаименование", ВРег(СокрЛП(ДокументСсылка.Контрагент.Страна.Наименование)));
					УзелДокумент.ДополнительныеРеквизиты.Вставить("КонтрагентСтранаКодОКСМ", СокрЛП(ДокументСсылка.Контрагент.Страна.КодОКСМ));
					УзелДокумент.ДополнительныеРеквизиты.Вставить("КонтрагентЭтоРезидент", ДокументСсылка.Контрагент.ПолучитьОбъект().ЭтоРезидент()); 
					
					Если (ТипЗнч(ДокументСсылка.ДоговорВзаиморасчетов)=Тип("СправочникСсылка.ДоговорыВзаиморасчетов")) И ЗначениеЗаполнено(ДокументСсылка.ДоговорВзаиморасчетов) Тогда
						УзелДокумент.ДополнительныеРеквизиты.Вставить("Договор", СокрЛП(ДокументСсылка.ДоговорВзаиморасчетов.Наименование));
						УзелДокумент.ДополнительныеРеквизиты.Вставить("ДоговорУИД", СокрЛП(ДокументСсылка.ДоговорВзаиморасчетов.УникальныйИдентификатор()));
						УзелДокумент.ДополнительныеРеквизиты.Вставить("ДоговорНомер", СокрЛП(ДокументСсылка.ДоговорВзаиморасчетов.Номер));
						УзелДокумент.ДополнительныеРеквизиты.Вставить("ДоговорДата", ДокументСсылка.ДоговорВзаиморасчетов.НачПериода);
						УзелДокумент.ДополнительныеРеквизиты.Вставить("ДоговорВид", Метаданные.Перечисления.ВидыДоговоров.ЗначенияПеречисления[Перечисления.ВидыДоговоров.Индекс(ДокументСсылка.ДоговорВзаиморасчетов.ВидДоговора)].Имя);
						УзелДокумент.ДополнительныеРеквизиты.Вставить("ИдентификаторГосКонтракта", СокрЛП(ДокументСсылка.ДоговорВзаиморасчетов.ИдентификаторГосударственногоКонтракта));
						УзелДокумент.ДополнительныеРеквизиты.Вставить("ИдентификационныйКодЗакупки", СокрЛП(ДокументСсылка.ДоговорВзаиморасчетов.ИдентификационныйКодЗакупки));
					Иначе
						УзелДокумент.ДополнительныеРеквизиты.Вставить("Договор", "");
						УзелДокумент.ДополнительныеРеквизиты.Вставить("ДоговорУИД", "");
						УзелДокумент.ДополнительныеРеквизиты.Вставить("ДоговорНомер", "");
						УзелДокумент.ДополнительныеРеквизиты.Вставить("ДоговорДата", "");
						УзелДокумент.ДополнительныеРеквизиты.Вставить("ДоговорВид", "");
						УзелДокумент.ДополнительныеРеквизиты.Вставить("ИдентификаторГосКонтракта", "");
						УзелДокумент.ДополнительныеРеквизиты.Вставить("ИдентификационныйКодЗакупки", "");
					КонецЕсли; 
					
					//УзелДокумент.ДополнительныеРеквизиты.Вставить("СчетФактураНомер", СокрЛП(ДокументСсылка.НомерСчф));
					//УзелДокумент.ДополнительныеРеквизиты.Вставить("СчетФактураДата", ДокументСсылка.Дата);
					
					УзелДокумент.ДополнительныеРеквизиты.Вставить("СуммаДокумента", ДокументСсылка.СуммаДокумента);
					УзелДокумент.ДополнительныеРеквизиты.Вставить("СуммаВознаграждения", ДокументСсылка.СуммаДокумента);
					УзелДокумент.ДополнительныеРеквизиты.Вставить("УдержатьВознаграждение", ДокументСсылка.УдержатьВознаграждение);
					
					ПротоколПроверкиДокумента = РегистрыСведений.ПротоколПроверкиДокументов.ПолучитьЗаписьРегистра(ДокументСсылка);
					Если ПротоколПроверкиДокумента=Неопределено Тогда
						УзелДокумент.ДополнительныеРеквизиты.Вставить("ДокументПроверен", Ложь);
					Иначе
						УзелДокумент.ДополнительныеРеквизиты.Вставить("ДокументПроверен", ПротоколПроверкиДокумента.ДокументПроверен);
					КонецЕсли;
					
					УзелДокумент.Вставить("Возврат", Новый Массив);
					
					Для каждого текСтрока Из ДокументСсылка.Товары Цикл
						СтрокаТовары = Новый Структура("Номенклатура, НоменклатураУИД, ЦенаПродажи, Количество, СуммаПродажи,ЦенаПередачи,СуммаПередачи,СтавкаНДС, СуммаПродажиНДС,СуммаВознаграждения,СуммаНДСВознаграждения, ПредставлениеНДС,Покупатель,ПокупательИНН,ПокупательКПП,ПокупательУИД,НомерСФКомиссионера,ДатаСФКомиссионера");
						
						СтрокаТовары.Номенклатура = СокрЛП(текСтрока.Номенклатура);
						СтрокаТовары.НоменклатураУИД = СокрЛП(текСтрока.Номенклатура.УникальныйИдентификатор());
						СтрокаТовары.ЦенаПродажи = текСтрока.ЦенаПродажи;
						СтрокаТовары.Количество = текСтрока.Количество;
						СтрокаТовары.СуммаПродажи = текСтрока.СуммаПродажи;
						СтрокаТовары.ЦенаПередачи = текСтрока.Цена;
						СтрокаТовары.СуммаПередачи = текСтрока.Сумма;
						СтрокаТовары.СтавкаНДС = текСтрока.СтавкаНДС.Ставка;
						СтрокаТовары.СуммаПродажиНДС = текСтрока.СуммаПродажиНДС;
						СтрокаТовары.СуммаВознаграждения = текСтрока.СуммаВознаграждения;
						СтрокаТовары.СуммаНДСВознаграждения = текСтрока.СуммаНДСВознаграждения;
						СтрокаТовары.ПредставлениеНДС = ?(текСтрока.СтавкаНДС.Предопределенный=Истина, Справочники.СтавкиНДС.ПолучитьИмяПредопределенного(текСтрока.СтавкаНДС), СокрЛП(текСтрока.СтавкаНДС));
						
						
						СтрокаТовары.Покупатель =  СокрЛП(текСтрока.Покупатель);
						СтрокаТовары.ПокупательИНН =  текСтрока.Покупатель.ИНН;
						СтрокаТовары.ПокупательКПП =  текСтрока.Покупатель.КПП;
						СтрокаТовары.ПокупательУИД =  текСтрока.Покупатель.УникальныйИдентификатор();
						СтрокаТовары.НомерСФКомиссионера =  СокрЛП(текСтрока.НомерСФКомиссионера);
						СтрокаТовары.ДатаСФКомиссионера =  СокрЛП(текСтрока.ДатаСФКомиссионера);
						
						
						
						УзелДокумент.Товары.Добавить(СтрокаТовары);
					КонецЦикла; 
					Для каждого текСтрока Из ДокументСсылка.Возвраты Цикл
						СтрокаТовары = Новый Структура("Номенклатура, НоменклатураУИД, ЦенаПродажи, Количество, СуммаПродажи,ЦенаПередачи,СуммаПередачи,СтавкаНДС, СуммаПродажиНДС,СуммаВознаграждения,СуммаНДСВознаграждения, ПредставлениеНДС,Покупатель,ПокупательИНН,ПокупательКПП,ПокупательУИД,НомерСФКомиссионера,ДатаСФКомиссионера");
						
						СтрокаТовары.Номенклатура = СокрЛП(текСтрока.Номенклатура);
						СтрокаТовары.НоменклатураУИД = СокрЛП(текСтрока.Номенклатура.УникальныйИдентификатор());
						СтрокаТовары.ЦенаПродажи = текСтрока.ЦенаПродажи;
						СтрокаТовары.Количество = текСтрока.Количество;
						СтрокаТовары.СуммаПродажи = текСтрока.СуммаПродажи;
						СтрокаТовары.ЦенаПередачи = текСтрока.Цена;
						СтрокаТовары.СуммаПередачи = текСтрока.Сумма;
						СтрокаТовары.СтавкаНДС = текСтрока.СтавкаНДС.Ставка;
						СтрокаТовары.СуммаПродажиНДС = текСтрока.СуммаПродажиНДС;
						СтрокаТовары.СуммаВознаграждения = текСтрока.СуммаВознаграждения;
						СтрокаТовары.СуммаНДСВознаграждения = текСтрока.СуммаНДСВознаграждения;
						СтрокаТовары.ПредставлениеНДС = ?(текСтрока.СтавкаНДС.Предопределенный=Истина, Справочники.СтавкиНДС.ПолучитьИмяПредопределенного(текСтрока.СтавкаНДС), СокрЛП(текСтрока.СтавкаНДС));
						
						
						СтрокаТовары.Покупатель =  СокрЛП(текСтрока.Покупатель);
						СтрокаТовары.ПокупательИНН =  текСтрока.Покупатель.ИНН;
						СтрокаТовары.ПокупательКПП =  текСтрока.Покупатель.КПП;
						СтрокаТовары.ПокупательУИД =  текСтрока.Покупатель.УникальныйИдентификатор();
						СтрокаТовары.НомерСФКомиссионера =  СокрЛП(текСтрока.НомерСФКомиссионера);
						СтрокаТовары.ДатаСФКомиссионера =  СокрЛП(текСтрока.ДатаСФКомиссионера);
						
						УзелДокумент.Возврат.Добавить(СтрокаТовары);
					КонецЦикла;  
					
					Для каждого текСтрока Из ДокументСсылка.Возвраты  Цикл
						Если НоменклатураДляВыгрузки.НайтиПоЗначению(текСтрока.Номенклатура)=Неопределено Тогда
							НоменклатураДляВыгрузки.Добавить(текСтрока.Номенклатура);						
						КонецЕсли; 
					КонецЦикла;
					
					Если ДокументыРНПТ.Найти(ДокументСсылка)<> Неопределено тогда
						ТЗРНПТ = ПолучитьРНПТ(ДокументСсылка);
						
						Для каждого текСтрока Из ТЗРНПТ Цикл
							СтрокаРНПТ = Новый Структура("Номенклатура, Количество, КоличествоПрослеживаемости, СтранаПроисхождения, Сумма, РНПТ, РНПТУИД");
							
							СтрокаРНПТ.Номенклатура = СокрЛП(текСтрока.Номенклатура);
							СтрокаРНПТ.Количество = текСтрока.Количество;
							СтрокаРНПТ.КоличествоПрослеживаемости = текСтрока.КоличествоПрослеживаемости;
							СтрокаРНПТ.СтранаПроисхождения = текСтрока.СтранаПроисхождения;
							СтрокаРНПТ.РНПТ = СокрЛП(текСтрока.РНПТ);
							СтрокаРНПТ.РНПТУИД = СокрЛП(текСтрока.РНПТ.УникальныйИдентификатор());
							
							УзелДокумент.РНПТ.Добавить(СтрокаРНПТ);
						КонецЦикла;
						
					КонецЕсли;	
					
					//Если  ДокументСсылка.ВидОперации = Перечисления.ВидыОперацийРеализацияТоваров.ПередачаНаКомиссию тогда
					//	
					//	МассивДокументовПередачиНаКомиссию.Добавить(ДокументСсылка);						
					//	
					//КонецЕсли;	
				ИначеЕсли текЭлемент="ОтчетКомитенту" Тогда
					УзелДокумент.ДополнительныеРеквизиты.Вставить("ТочкаОформления", СокрЛП(ДокументСсылка.ТочкаОформления));
					УзелДокумент.ДополнительныеРеквизиты.Вставить("ТочкаОформленияУИД", СокрЛП(ДокументСсылка.ТочкаОформления.УникальныйИдентификатор()));
					
					УзелДокумент.ДополнительныеРеквизиты.Вставить("Организация", СокрЛП(ДокументСсылка.Организация));
					УзелДокумент.ДополнительныеРеквизиты.Вставить("ОрганизацияИНН", ДокументСсылка.Организация.ИНН);
					УзелДокумент.ДополнительныеРеквизиты.Вставить("ОрганизацияКПП", ДокументСсылка.Организация.КПП);
					
					УзелДокумент.ДополнительныеРеквизиты.Вставить("Контрагент", СокрЛП(ДокументСсылка.Контрагент));
					УзелДокумент.ДополнительныеРеквизиты.Вставить("КонтрагентИНН", ДокументСсылка.Контрагент.ИНН);
					УзелДокумент.ДополнительныеРеквизиты.Вставить("КонтрагентКПП", ДокументСсылка.Контрагент.КПП);
					УзелДокумент.ДополнительныеРеквизиты.Вставить("КонтрагентУИД", СокрЛП(ДокументСсылка.Контрагент.УникальныйИдентификатор()));
					УзелДокумент.ДополнительныеРеквизиты.Вставить("КонтрагентФормаСобственности", 
					?(ТипЗнч(ДокументСсылка.Контрагент)=Тип("СправочникСсылка.Контрагенты")
					, СокрЛП(ДокументСсылка.Контрагент.ТипКонтрагента)
					, СокрЛП(Перечисления.ТипКонтрагента.Юл)));
					
					УзелДокумент.ДополнительныеРеквизиты.Вставить("КонтрагентСтранаНаименование", ВРег(СокрЛП(ДокументСсылка.Контрагент.Страна.Наименование)));
					УзелДокумент.ДополнительныеРеквизиты.Вставить("КонтрагентСтранаКодОКСМ", СокрЛП(ДокументСсылка.Контрагент.Страна.КодОКСМ));
					УзелДокумент.ДополнительныеРеквизиты.Вставить("КонтрагентЭтоРезидент", ДокументСсылка.Контрагент.ПолучитьОбъект().ЭтоРезидент()); 
					
					Если (ТипЗнч(ДокументСсылка.ДоговорВзаиморасчетов)=Тип("СправочникСсылка.ДоговорыВзаиморасчетов")) И ЗначениеЗаполнено(ДокументСсылка.ДоговорВзаиморасчетов) Тогда
						УзелДокумент.ДополнительныеРеквизиты.Вставить("Договор", СокрЛП(ДокументСсылка.ДоговорВзаиморасчетов.Наименование));
						УзелДокумент.ДополнительныеРеквизиты.Вставить("ДоговорУИД", СокрЛП(ДокументСсылка.ДоговорВзаиморасчетов.УникальныйИдентификатор()));
						УзелДокумент.ДополнительныеРеквизиты.Вставить("ДоговорНомер", СокрЛП(ДокументСсылка.ДоговорВзаиморасчетов.Номер));
						УзелДокумент.ДополнительныеРеквизиты.Вставить("ДоговорДата", ДокументСсылка.ДоговорВзаиморасчетов.НачПериода);
						УзелДокумент.ДополнительныеРеквизиты.Вставить("ДоговорВид", Метаданные.Перечисления.ВидыДоговоров.ЗначенияПеречисления[Перечисления.ВидыДоговоров.Индекс(ДокументСсылка.ДоговорВзаиморасчетов.ВидДоговора)].Имя);
						УзелДокумент.ДополнительныеРеквизиты.Вставить("ИдентификаторГосКонтракта", СокрЛП(ДокументСсылка.ДоговорВзаиморасчетов.ИдентификаторГосударственногоКонтракта));
						УзелДокумент.ДополнительныеРеквизиты.Вставить("ИдентификационныйКодЗакупки", СокрЛП(ДокументСсылка.ДоговорВзаиморасчетов.ИдентификационныйКодЗакупки));
					Иначе
						УзелДокумент.ДополнительныеРеквизиты.Вставить("Договор", "");
						УзелДокумент.ДополнительныеРеквизиты.Вставить("ДоговорУИД", "");
						УзелДокумент.ДополнительныеРеквизиты.Вставить("ДоговорНомер", "");
						УзелДокумент.ДополнительныеРеквизиты.Вставить("ДоговорДата", "");
						УзелДокумент.ДополнительныеРеквизиты.Вставить("ДоговорВид", "");
						УзелДокумент.ДополнительныеРеквизиты.Вставить("ИдентификаторГосКонтракта", "");
						УзелДокумент.ДополнительныеРеквизиты.Вставить("ИдентификационныйКодЗакупки", "");
					КонецЕсли; 
					
					//УзелДокумент.ДополнительныеРеквизиты.Вставить("СчетФактураНомер", СокрЛП(ДокументСсылка.НомерСчф));
					//УзелДокумент.ДополнительныеРеквизиты.Вставить("СчетФактураДата", ДокументСсылка.Дата);
					
					УзелДокумент.ДополнительныеРеквизиты.Вставить("СуммаДокумента", ДокументСсылка.СуммаДокумента);
					УзелДокумент.ДополнительныеРеквизиты.Вставить("СуммаВознаграждения", ДокументСсылка.СуммаДокумента);
					УзелДокумент.ДополнительныеРеквизиты.Вставить("УдержатьВознаграждение", ДокументСсылка.УдержатьВознаграждение);
					
					ПротоколПроверкиДокумента = РегистрыСведений.ПротоколПроверкиДокументов.ПолучитьЗаписьРегистра(ДокументСсылка);
					Если ПротоколПроверкиДокумента=Неопределено Тогда
						УзелДокумент.ДополнительныеРеквизиты.Вставить("ДокументПроверен", Ложь);
					Иначе
						УзелДокумент.ДополнительныеРеквизиты.Вставить("ДокументПроверен", ПротоколПроверкиДокумента.ДокументПроверен);
					КонецЕсли;
					
					УзелДокумент.Вставить("Возврат", Новый Массив);
					
					Для каждого текСтрока Из ДокументСсылка.Товары Цикл
						СтрокаТовары = Новый Структура("Номенклатура, НоменклатураУИД, ЦенаПродажи, Количество, СуммаПродажи,ЦенаПередачи,СуммаПередачи,СтавкаНДС, СуммаПродажиНДС,СуммаВознаграждения,СуммаНДСВознаграждения, ПредставлениеНДС,Покупатель,ПокупательИНН,ПокупательКПП,ПокупательУИД,НомерСФКомиссионера,ДатаСФКомиссионера");
						
						СтрокаТовары.Номенклатура = СокрЛП(текСтрока.Номенклатура);
						СтрокаТовары.НоменклатураУИД = СокрЛП(текСтрока.Номенклатура.УникальныйИдентификатор());
						СтрокаТовары.ЦенаПродажи = текСтрока.ЦенаПродажи;
						СтрокаТовары.Количество = текСтрока.Количество;
						СтрокаТовары.СуммаПродажи = текСтрока.СуммаПродажи;
						СтрокаТовары.ЦенаПередачи = текСтрока.Цена;
						СтрокаТовары.СуммаПередачи = текСтрока.Сумма;
						СтрокаТовары.СтавкаНДС = текСтрока.СтавкаНДС.Ставка;
						СтрокаТовары.СуммаПродажиНДС = текСтрока.СуммаПродажиНДС;
						СтрокаТовары.СуммаВознаграждения = текСтрока.СуммаВознаграждения;
						СтрокаТовары.СуммаНДСВознаграждения = текСтрока.СуммаНДСВознаграждения;
						СтрокаТовары.ПредставлениеНДС = ?(текСтрока.СтавкаНДС.Предопределенный=Истина, Справочники.СтавкиНДС.ПолучитьИмяПредопределенного(текСтрока.СтавкаНДС), СокрЛП(текСтрока.СтавкаНДС));
						
						СтрокаТовары.Покупатель =  СокрЛП(текСтрока.Покупатель);
						СтрокаТовары.ПокупательИНН =  текСтрока.Покупатель.ИНН;
						СтрокаТовары.ПокупательКПП =  текСтрока.Покупатель.КПП;
						СтрокаТовары.ПокупательУИД =  СокрЛП(текСтрока.Покупатель.УникальныйИдентификатор());
						СтрокаТовары.НомерСФКомиссионера =  СокрЛП(текСтрока.НомерСФКомиссионера);
						СтрокаТовары.ДатаСФКомиссионера =  СокрЛП(текСтрока.ДатаСФКомиссионера);
						
						УзелДокумент.Товары.Добавить(СтрокаТовары);
					КонецЦикла; 
					Для каждого текСтрока Из ДокументСсылка.Возврат Цикл
						СтрокаТовары = Новый Структура("Номенклатура, НоменклатураУИД, ЦенаПродажи, Количество, СуммаПродажи,ЦенаПередачи,СуммаПередачи,СтавкаНДС, СуммаПродажиНДС,СуммаВознаграждения,СуммаНДСВознаграждения, ПредставлениеНДС,Покупатель,ПокупательИНН,ПокупательКПП,ПокупательУИД,НомерСФКомиссионера,ДатаСФКомиссионера");
						
						СтрокаТовары.Номенклатура = СокрЛП(текСтрока.Номенклатура);
						СтрокаТовары.НоменклатураУИД = СокрЛП(текСтрока.Номенклатура.УникальныйИдентификатор());
						СтрокаТовары.ЦенаПродажи = текСтрока.ЦенаПродажи;
						СтрокаТовары.Количество = текСтрока.Количество;
						СтрокаТовары.СуммаПродажи = текСтрока.СуммаПродажи;
						СтрокаТовары.ЦенаПередачи = текСтрока.Цена;
						СтрокаТовары.СуммаПередачи = текСтрока.Сумма;
						СтрокаТовары.СтавкаНДС = текСтрока.СтавкаНДС.Ставка;
						СтрокаТовары.СуммаПродажиНДС = текСтрока.СуммаПродажиНДС;
						СтрокаТовары.СуммаВознаграждения = текСтрока.СуммаВознаграждения;
						СтрокаТовары.СуммаНДСВознаграждения = текСтрока.СуммаНДСВознаграждения;
						СтрокаТовары.ПредставлениеНДС = ?(текСтрока.СтавкаНДС.Предопределенный=Истина, Справочники.СтавкиНДС.ПолучитьИмяПредопределенного(текСтрока.СтавкаНДС), СокрЛП(текСтрока.СтавкаНДС));
						
						СтрокаТовары.Покупатель =  СокрЛП(текСтрока.Покупатель);
						СтрокаТовары.ПокупательИНН =  текСтрока.Покупатель.ИНН;
						СтрокаТовары.ПокупательКПП =  текСтрока.Покупатель.КПП;
						СтрокаТовары.ПокупательУИД =  текСтрока.Покупатель.УникальныйИдентификатор();
						СтрокаТовары.НомерСФКомиссионера =  СокрЛП(текСтрока.НомерСФКомиссионера);
						СтрокаТовары.ДатаСФКомиссионера =  СокрЛП(текСтрока.ДатаСФКомиссионера);
						
						УзелДокумент.Возврат.Добавить(СтрокаТовары);
					КонецЦикла; 
					
					Для каждого текСтрока Из ДокументСсылка.Возврат  Цикл
						Если НоменклатураДляВыгрузки.НайтиПоЗначению(текСтрока.Номенклатура)=Неопределено Тогда
							НоменклатураДляВыгрузки.Добавить(текСтрока.Номенклатура);						
						КонецЕсли; 
					КонецЦикла;
					
					Если ДокументыРНПТ.Найти(ДокументСсылка)<> Неопределено тогда
						ТЗРНПТ = ПолучитьРНПТ(ДокументСсылка);
						
						Для каждого текСтрока Из ТЗРНПТ Цикл
							СтрокаРНПТ = Новый Структура("Номенклатура, Количество, КоличествоПрослеживаемости, СтранаПроисхождения, Сумма, РНПТ, РНПТУИД");
							
							СтрокаРНПТ.Номенклатура = СокрЛП(текСтрока.Номенклатура);
							СтрокаРНПТ.Количество = текСтрока.Количество;
							СтрокаРНПТ.КоличествоПрослеживаемости = текСтрока.КоличествоПрослеживаемости;
							СтрокаРНПТ.СтранаПроисхождения = текСтрока.СтранаПроисхождения;
							СтрокаРНПТ.РНПТ = СокрЛП(текСтрока.РНПТ);
							СтрокаРНПТ.РНПТУИД = СокрЛП(текСтрока.РНПТ.УникальныйИдентификатор());
							
							УзелДокумент.РНПТ.Добавить(СтрокаРНПТ);
						КонецЦикла;
						
					КонецЕсли;	
					
					//Если  ДокументСсылка.ВидОперации = Перечисления.ВидыОперацийРеализацияТоваров.ПередачаНаКомиссию тогда
					//	
					//	МассивДокументовПередачиНаКомиссию.Добавить(ДокументСсылка);						
					//	
					//КонецЕсли;		
					
					
				ИначеЕсли текЭлемент="ВводИнструментовВЭксплуатацию" Тогда
					УзелДокумент.ДополнительныеРеквизиты.Вставить("ТочкаОформления", СокрЛП(ДокументСсылка.ТочкаОформления));
					УзелДокумент.ДополнительныеРеквизиты.Вставить("ТочкаОформленияУИД", СокрЛП(ДокументСсылка.ТочкаОформления.УникальныйИдентификатор()));
					
					УзелДокумент.ДополнительныеРеквизиты.Вставить("Организация", СокрЛП(ДокументСсылка.Организация));
					УзелДокумент.ДополнительныеРеквизиты.Вставить("ОрганизацияИНН", ДокументСсылка.Организация.ИНН);
					УзелДокумент.ДополнительныеРеквизиты.Вставить("ОрганизацияКПП", ДокументСсылка.Организация.КПП);     
					
					УзелДокумент.ДополнительныеРеквизиты.Вставить("СкладОтправитель", СокрЛП(ДокументСсылка.СкладОтправитель));
					УзелДокумент.ДополнительныеРеквизиты.Вставить("СкладОтправительУИД", СокрЛП(ДокументСсылка.СкладОтправитель.УникальныйИдентификатор()));
					
					УзелДокумент.ДополнительныеРеквизиты.Вставить("СкладПолучатель", СокрЛП(ДокументСсылка.СкладПолучатель));
					УзелДокумент.ДополнительныеРеквизиты.Вставить("СкладПолучательУИД", СокрЛП(ДокументСсылка.СкладПолучатель.УникальныйИдентификатор()));
					
					УзелДокумент.ДополнительныеРеквизиты.Вставить("СуммаДокумента", ДокументСсылка.СуммаДокумента);
					УзелДокумент.ДополнительныеРеквизиты.Вставить("ДатаСписания", ДокументСсылка.ДатаСписания);		
					
					Для каждого текСтрока Из ДокументСсылка.Товары Цикл
						СтрокаТовары = Новый Структура("Номенклатура, НоменклатураУИД, Количество");
						
						СтрокаТовары.Номенклатура = СокрЛП(текСтрока.Номенклатура);
						СтрокаТовары.НоменклатураУИД = СокрЛП(текСтрока.Номенклатура.УникальныйИдентификатор());
						СтрокаТовары.Количество = текСтрока.Количество;
						
						УзелДокумент.Товары.Добавить(СтрокаТовары);
					КонецЦикла;  
					
					МассивДокументовСписанияТоваров.Добавить(ДокументСсылка);							
					
				ИначеЕсли текЭлемент="СписаниеТоваров" Тогда
					УзелДокумент.ДополнительныеРеквизиты.Вставить("ТочкаОформления", СокрЛП(ДокументСсылка.ТочкаОформления));
					УзелДокумент.ДополнительныеРеквизиты.Вставить("ТочкаОформленияУИД", СокрЛП(ДокументСсылка.ТочкаОформления.УникальныйИдентификатор()));
					
					УзелДокумент.ДополнительныеРеквизиты.Вставить("Организация", СокрЛП(ДокументСсылка.Организация));
					УзелДокумент.ДополнительныеРеквизиты.Вставить("ОрганизацияИНН", ДокументСсылка.Организация.ИНН);
					УзелДокумент.ДополнительныеРеквизиты.Вставить("ОрганизацияКПП", ДокументСсылка.Организация.КПП);
					
					Если (ЗначениеЗаполнено(ДокументСсылка.ДокументОснование)=Истина) Тогда
						УзелДокумент.ДополнительныеРеквизиты.Вставить("Инвентаризация", (ТипЗнч(ДокументСсылка.ДокументОснование)=Тип("ДокументСсылка.ИнвентаризацияТоваровНаСкладе")));
						УзелДокумент.ДополнительныеРеквизиты.Вставить("ДокументОснование", СокрЛП(ДокументСсылка.ДокументОснование));
						УзелДокумент.ДополнительныеРеквизиты.Вставить("ДокументОснованиеВид", ДокументСсылка.ДокументОснование.Метаданные().Имя);
						УзелДокумент.ДополнительныеРеквизиты.Вставить("ДокументОснованиеУИД", СокрЛП(ДокументСсылка.ДокументОснование.УникальныйИдентификатор()));
					Иначе
						УзелДокумент.ДополнительныеРеквизиты.Вставить("Инвентаризация", Ложь);
						УзелДокумент.ДополнительныеРеквизиты.Вставить("ДокументОснование", "");
						УзелДокумент.ДополнительныеРеквизиты.Вставить("ДокументОснованиеВид", "");
						УзелДокумент.ДополнительныеРеквизиты.Вставить("ДокументОснованиеУИД", "");
					КонецЕсли; 
					
					УзелДокумент.ДополнительныеРеквизиты.Вставить("СуммаДокумента", ДокументСсылка.СуммаДокумента);
					
					Для каждого текСтрока Из ДокументСсылка.Товары Цикл
						СтрокаТовары = Новый Структура("Номенклатура, НоменклатураУИД, Количество");
						
						СтрокаТовары.Номенклатура = СокрЛП(текСтрока.Номенклатура);
						СтрокаТовары.НоменклатураУИД = СокрЛП(текСтрока.Номенклатура.УникальныйИдентификатор());
						СтрокаТовары.Количество = текСтрока.Количество;
						
						УзелДокумент.Товары.Добавить(СтрокаТовары);
					КонецЦикла;  
					
					МассивДокументовСписанияТоваров.Добавить(ДокументСсылка);					
				ИначеЕсли текЭлемент="ОприходованиеТоваров" Тогда
					УзелДокумент.ДополнительныеРеквизиты.Вставить("ТочкаОформления", СокрЛП(ДокументСсылка.ТочкаОформления));
					УзелДокумент.ДополнительныеРеквизиты.Вставить("ТочкаОформленияУИД", СокрЛП(ДокументСсылка.ТочкаОформления.УникальныйИдентификатор()));
					
					УзелДокумент.ДополнительныеРеквизиты.Вставить("Организация", СокрЛП(ДокументСсылка.Организация));
					УзелДокумент.ДополнительныеРеквизиты.Вставить("ОрганизацияИНН", ДокументСсылка.Организация.ИНН);
					УзелДокумент.ДополнительныеРеквизиты.Вставить("ОрганизацияКПП", ДокументСсылка.Организация.КПП);
					
					Если (ЗначениеЗаполнено(ДокументСсылка.ДокументОснование)=Истина) Тогда
						УзелДокумент.ДополнительныеРеквизиты.Вставить("Инвентаризация", (ТипЗнч(ДокументСсылка.ДокументОснование)=Тип("ДокументСсылка.ИнвентаризацияТоваровНаСкладе")));
						УзелДокумент.ДополнительныеРеквизиты.Вставить("ДокументОснование", СокрЛП(ДокументСсылка.ДокументОснование));
						УзелДокумент.ДополнительныеРеквизиты.Вставить("ДокументОснованиеВид", ДокументСсылка.ДокументОснование.Метаданные().Имя);
						УзелДокумент.ДополнительныеРеквизиты.Вставить("ДокументОснованиеУИД", СокрЛП(ДокументСсылка.ДокументОснование.УникальныйИдентификатор()));
					Иначе
						УзелДокумент.ДополнительныеРеквизиты.Вставить("Инвентаризация", Ложь);
						УзелДокумент.ДополнительныеРеквизиты.Вставить("ДокументОснование", "");
						УзелДокумент.ДополнительныеРеквизиты.Вставить("ДокументОснованиеВид", "");
						УзелДокумент.ДополнительныеРеквизиты.Вставить("ДокументОснованиеУИД", "");
					КонецЕсли; 
					
					УзелДокумент.ДополнительныеРеквизиты.Вставить("СуммаДокумента", ДокументСсылка.СуммаДокумента);
					
					Для каждого текСтрока Из ДокументСсылка.Товары Цикл
						СтрокаТовары = Новый Структура("Номенклатура, НоменклатураУИД, Цена, Количество, Сумма, ЦенаЗакупочная, СуммаЗакупочная");
						
						СтрокаТовары.Номенклатура = СокрЛП(текСтрока.Номенклатура);
						СтрокаТовары.НоменклатураУИД = СокрЛП(текСтрока.Номенклатура.УникальныйИдентификатор());
						СтрокаТовары.Количество = текСтрока.Количество;
						СтрокаТовары.Цена = текСтрока.Цена;
						СтрокаТовары.Сумма = текСтрока.Сумма;
						СтрокаТовары.ЦенаЗакупочная = текСтрока.ЦенаЗакупочная;
						СтрокаТовары.СуммаЗакупочная = текСтрока.СуммаЗакупочная;
						
						УзелДокумент.Товары.Добавить(СтрокаТовары);
					КонецЦикла; 
				КонецЕсли; 
				
				МассивДокументов.Добавить(УзелДокумент);
				
				Если (текЭлемент="НЭДоукомплектация") ИЛИ (текЭлемент="МТЗакупка") ИЛИ (текЭлемент="МТРеализация") Тогда
					Для каждого текСтрока Из ДокументСсылка.Материалы Цикл
						Если НоменклатураДляВыгрузки.НайтиПоЗначению(текСтрока.Материал)=Неопределено Тогда
							НоменклатураДляВыгрузки.Добавить(текСтрока.Материал);						
						КонецЕсли; 
					КонецЦикла;
				ИначеЕсли (ДокументыКонтурПродажиАвтомобилей.Найти(текЭлемент)=Неопределено) И (текЭлемент<>"РеализацияУслуг")  И (текЭлемент<>"ПоступлениеУслуг") И (текЭлемент<>"КомплектацияТоваров") И (текЭлемент<>"АктВыполненныхРаботСводный") Тогда
					Для каждого текСтрока Из ДокументСсылка.Товары Цикл
						Если НоменклатураДляВыгрузки.НайтиПоЗначению(текСтрока.Номенклатура)=Неопределено Тогда
							НоменклатураДляВыгрузки.Добавить(текСтрока.Номенклатура);						
						КонецЕсли; 
					КонецЦикла;
					Если ДокументСсылка.Метаданные().Реквизиты.Найти("Контрагент") <> Неопределено тогда
						Если ДокументСсылка.Контрагент <> Неопределено тогда
							Если КонтрагентыДляВыгрузки.НайтиПоЗначению(ДокументСсылка.Контрагент)=Неопределено Тогда
								КонтрагентыДляВыгрузки.Добавить(ДокументСсылка.Контрагент);						
							КонецЕсли; 
						КонецЕсли; 
					КонецЕсли;
					
				КонецЕсли; 
			КонецЦикла; 
		КонецЕсли;
		
		Если МассивДокументов.Количество()>0 Тогда
			ДеревоДокументов.Вставить(текЭлемент, МассивДокументов);
		КонецЕсли; 
	КонецЦикла; 
	
	// Межхолдерные движения 
	//-------------------------------------------------------------------------------------------------
	МассивМежхолдерныхДвижений = Новый Массив;
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ
	|	Продажи.ТочкаОформления КАК ТочкаОформления,
	|	Продажи.Товар КАК Номенклатура,
	|	Продажи.Партия.Организация КАК ОрганизацияОтправитель,
	|	Продажи.Поставщик КАК ОрганизацияПолучатель,
	|	НАЧАЛОПЕРИОДА(Продажи.Период, ДЕНЬ) КАК ДатаДокумента,
	|	Продажи.Регистратор КАК Регистратор,
	|	Продажи.Партия КАК Партия,
	|	ВЫБОР
	|		КОГДА Продажи.Партия.Комментарий ПОДОБНО &Производство
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК Производство,
	|	Продажи.СтавкаНДС КАК СтавкаНДС,
	|	СУММА(Продажи.Количество) КАК КоличествоРасход,
	|	СУММА(Продажи.СуммаСебестоимость) КАК СебестоимостьРасход,
	|	ВЫБОР
	|		КОГДА НЕ Продажи.ДоговорВзаиморасчетов = ЗНАЧЕНИЕ(Справочник.ДоговорыВзаиморасчетов.ПустаяСсылка)
	|			ТОГДА Продажи.ДоговорВзаиморасчетов.ИдентификаторГосударственногоКонтракта
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК ИГК
	|ИЗ
	|	РегистрНакопления.Продажи КАК Продажи
	|ГДЕ
	|	Продажи.Период МЕЖДУ НАЧАЛОПЕРИОДА(&НачалоПериода, ДЕНЬ) И КОНЕЦПЕРИОДА(&ОкончаниеПериода, ДЕНЬ)
	|	И Продажи.Товар ССЫЛКА Справочник.Номенклатура
	|	И (Продажи.Поставщик.ИНН = &ОрганизацияПолучатель
	|			ИЛИ &ОрганизацияПолучатель = НЕОПРЕДЕЛЕНО)
	|	И ВЫБОР
	|			КОГДА НЕ Продажи.Партия.Комментарий ПОДОБНО &Производство
	|				ТОГДА Продажи.Партия.Организация <> Продажи.Поставщик
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И ТИПЗНАЧЕНИЯ(Продажи.Регистратор) <> ТИП(Документ.ОтчетКомиссионера)
	|	И НЕ Продажи.Регистратор ССЫЛКА Документ.ОтчетКомиссионера
	|
	|СГРУППИРОВАТЬ ПО
	|	Продажи.ТочкаОформления,
	|	Продажи.Товар,
	|	Продажи.Партия.Организация,
	|	Продажи.Поставщик,
	|	НАЧАЛОПЕРИОДА(Продажи.Период, ДЕНЬ),
	|	Продажи.Регистратор,
	|	Продажи.Партия,
	|	ВЫБОР
	|		КОГДА Продажи.Партия.Комментарий ПОДОБНО &Производство
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ,
	|	Продажи.СтавкаНДС,
	|	ВЫБОР
	|		КОГДА НЕ Продажи.ДоговорВзаиморасчетов = ЗНАЧЕНИЕ(Справочник.ДоговорыВзаиморасчетов.ПустаяСсылка)
	|			ТОГДА Продажи.ДоговорВзаиморасчетов.ИдентификаторГосударственногоКонтракта
	|		ИНАЧЕ """"
	|	КОНЕЦ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТоварыПроизводство.Основание.ТочкаОформления,
	|	ТоварыПроизводство.Номенклатура,
	|	ТоварыПроизводство.Партия.Организация,
	|	ТоварыПроизводство.Основание.Организация,
	|	НАЧАЛОПЕРИОДА(ТоварыПроизводство.Период, ДЕНЬ),
	|	ТоварыПроизводство.Регистратор,
	|	ТоварыПроизводство.Партия,
	|	ВЫБОР
	|		КОГДА ТоварыПроизводство.Партия.Комментарий ПОДОБНО &Производство
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ,
	|	ТоварыПроизводство.Основание.СтавкаНДС,
	|	СУММА(ТоварыПроизводство.Количество),
	|	СУММА(ТоварыПроизводство.СуммаСебестоимость),
	|	ВЫБОР
	|		КОГДА НЕ ТоварыПроизводство.Основание.ДоговорВзаиморасчетов = ЗНАЧЕНИЕ(Справочник.ДоговорыВзаиморасчетов.ПустаяСсылка)
	|			ТОГДА ТоварыПроизводство.Основание.ДоговорВзаиморасчетов.ИдентификаторГосударственногоКонтракта
	|		ИНАЧЕ """"
	|	КОНЕЦ
	|ИЗ
	|	РегистрНакопления.ТоварыПроизводство КАК ТоварыПроизводство
	|ГДЕ
	|	ТоварыПроизводство.Период МЕЖДУ НАЧАЛОПЕРИОДА(&НачалоПериода, ДЕНЬ) И КОНЕЦПЕРИОДА(&ОкончаниеПериода, ДЕНЬ)
	|	И ТоварыПроизводство.Номенклатура ССЫЛКА Справочник.Номенклатура
	|	И (ТоварыПроизводство.Основание.Организация.ИНН = &ОрганизацияПолучатель
	|			ИЛИ &ОрганизацияПолучатель = НЕОПРЕДЕЛЕНО)
	|	И ВЫБОР
	|			КОГДА НЕ ТоварыПроизводство.Партия.Комментарий ПОДОБНО &Производство
	|				ТОГДА ТоварыПроизводство.Партия.Организация <> ТоварыПроизводство.Основание.Организация
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И ТоварыПроизводство.Регистратор ССЫЛКА Документ.ЗаказНаряд
	|	И ТоварыПроизводство.Основание.Организация = ТоварыПроизводство.Основание.Контрагент
	|
	|СГРУППИРОВАТЬ ПО
	|	ТоварыПроизводство.Основание.ТочкаОформления,
	|	ТоварыПроизводство.Номенклатура,
	|	ТоварыПроизводство.Партия.Организация,
	|	ТоварыПроизводство.Основание.Организация,
	|	НАЧАЛОПЕРИОДА(ТоварыПроизводство.Период, ДЕНЬ),
	|	ТоварыПроизводство.Регистратор,
	|	ТоварыПроизводство.Партия,
	|	ВЫБОР
	|		КОГДА ТоварыПроизводство.Партия.Комментарий ПОДОБНО &Производство
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ,
	|	ТоварыПроизводство.Основание.СтавкаНДС,
	|	ВЫБОР
	|		КОГДА НЕ ТоварыПроизводство.Основание.ДоговорВзаиморасчетов = ЗНАЧЕНИЕ(Справочник.ДоговорыВзаиморасчетов.ПустаяСсылка)
	|			ТОГДА ТоварыПроизводство.Основание.ДоговорВзаиморасчетов.ИдентификаторГосударственногоКонтракта
	|		ИНАЧЕ """"
	|	КОНЕЦ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ОстаткиТоваровКомпании.СкладКомпании.ТочкаОформления,
	|	ОстаткиТоваровКомпании.Номенклатура,
	|	ОстаткиТоваровКомпании.Партия.Организация,
	|	ОстаткиТоваровКомпании.Регистратор.Организация,
	|	НАЧАЛОПЕРИОДА(ОстаткиТоваровКомпании.Период, ДЕНЬ),
	|	ОстаткиТоваровКомпании.Регистратор,
	|	ОстаткиТоваровКомпании.Партия,
	|	ЛОЖЬ,
	|	НЕОПРЕДЕЛЕНО,
	|	ОстаткиТоваровКомпании.Количество,
	|	ОстаткиТоваровКомпании.СуммаСебестоимость,
	|	""""
	|ИЗ
	|	РегистрНакопления.ОстаткиТоваровКомпании КАК ОстаткиТоваровКомпании
	|ГДЕ
	|	ОстаткиТоваровКомпании.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	И ОстаткиТоваровКомпании.Регистратор В(&МассивДокументовСписанияТоваров)
	|	И ОстаткиТоваровКомпании.Партия.Организация <> ОстаткиТоваровКомпании.Регистратор.Организация
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТоварыПереданныеНаКомиссию.ТочкаОформления,
	|	ТоварыПереданныеНаКомиссию.Номенклатура,
	|	ТоварыПереданныеНаКомиссию.Партия.Организация,
	|	ТоварыПереданныеНаКомиссию.Регистратор.Организация,
	|	НАЧАЛОПЕРИОДА(ТоварыПереданныеНаКомиссию.Период, ДЕНЬ),
	|	ТоварыПереданныеНаКомиссию.Регистратор,
	|	ТоварыПереданныеНаКомиссию.Партия,
	|	ЛОЖЬ,
	|	НЕОПРЕДЕЛЕНО,
	|	ТоварыПереданныеНаКомиссию.Количество,
	|	ТоварыПереданныеНаКомиссию.СуммаСебестоимости,
	|	""""
	|ИЗ
	|	РегистрНакопления.ТоварыПереданныеНаКомиссию КАК ТоварыПереданныеНаКомиссию
	|ГДЕ
	|	ТоварыПереданныеНаКомиссию.Период МЕЖДУ НАЧАЛОПЕРИОДА(&НачалоПериода, ДЕНЬ) И КОНЕЦПЕРИОДА(&ОкончаниеПериода, ДЕНЬ)
	|	И ТоварыПереданныеНаКомиссию.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|	И ТоварыПереданныеНаКомиссию.Партия.Организация <> ТоварыПереданныеНаКомиссию.Регистратор.Организация
	|	И ТоварыПереданныеНаКомиссию.Организация.ИНН = &ОрганизацияПолучатель";
	
	Запрос.УстановитьПараметр("НачалоПериода", НачалоПериода);
	Запрос.УстановитьПараметр("ОкончаниеПериода", ОкончаниеПериода);
	Запрос.УстановитьПараметр("Производство", "##ПРОИЗВОДСТВО%");
	Запрос.УстановитьПараметр("ОрганизацияПолучатель", ?(ЗначениеЗаполнено(ОрганизацияИНН)=Истина, ОрганизацияИНН, Неопределено)); 
	
	Запрос.УстановитьПараметр("МассивДокументовСписанияТоваров", МассивДокументовСписанияТоваров);
	//	Запрос.УстановитьПараметр("МассивДокументовПередачиНаКомиссию", МассивДокументовПередачиНаКомиссию);
	
	ТаблицаДвижений = Запрос.Выполнить().Выгрузить();
	
	ТаблицаДвижений.Свернуть("ТочкаОформления, Номенклатура, ОрганизацияОтправитель, ОрганизацияПолучатель, ДатаДокумента, Регистратор, СтавкаНДС, ИГК,Производство", "КоличествоРасход, СебестоимостьРасход");  
	
	Для каждого текСтрока Из ТаблицаДвижений Цикл
		СтрокаДвижения = Новый Структура;
		
		СтрокаДвижения.Вставить("ТочкаОформления", СокрЛП(текСтрока.ТочкаОформления));
		СтрокаДвижения.Вставить("ТочкаОформленияУИД", СокрЛП(текСтрока.ТочкаОформления.УникальныйИдентификатор()));
		СтрокаДвижения.Вставить("ИГК", СокрЛП(текСтрока.ИГК));
		СтрокаДвижения.Вставить("Производство", текСтрока.Производство);
		Если текСтрока.ОрганизацияОтправитель = null тогда 
			продолжить
		Иначе	
			СтрокаДвижения.Вставить("ОрганизацияОтправитель", СокрЛП(текСтрока.ОрганизацияОтправитель));
			СтрокаДвижения.Вставить("ОрганизацияОтправительИНН", текСтрока.ОрганизацияОтправитель.ИНН);
			СтрокаДвижения.Вставить("ОрганизацияОтправительКПП", текСтрока.ОрганизацияОтправитель.КПП);
		КонецЕсли;
		
		СтрокаДвижения.Вставить("ОрганизацияПолучатель", СокрЛП(текСтрока.ОрганизацияПолучатель));
		СтрокаДвижения.Вставить("ОрганизацияПолучательИНН", текСтрока.ОрганизацияПолучатель.ИНН);
		СтрокаДвижения.Вставить("ОрганизацияПолучательКПП", текСтрока.ОрганизацияПолучатель.КПП);
		
		СтрокаДвижения.Вставить("Номенклатура", СокрЛП(текСтрока.Номенклатура));
		СтрокаДвижения.Вставить("НоменклатураУИД", СокрЛП(текСтрока.Номенклатура.УникальныйИдентификатор()));	
		
		СтрокаДвижения.Вставить("ДатаДокумента", текСтрока.ДатаДокумента);
		
		СтрокаДвижения.Вставить("КоличествоРасход", текСтрока.КоличествоРасход);
		СтрокаДвижения.Вставить("СебестоимостьРасход", текСтрока.СебестоимостьРасход);
		
		СтрокаДвижения.Вставить("Регистратор", СокрЛП(текСтрока.Регистратор));
		СтрокаДвижения.Вставить("РегистраторУИД", СокрЛП(текСтрока.Регистратор.УникальныйИдентификатор()));	
		
		Если ЗначениеЗаполнено(текСтрока.СтавкаНДС)=Истина Тогда
			СтавкаНДС = текСтрока.СтавкаНДС;	
		Иначе
			Если ЗначенияСервера.БезНДС(текСтрока.ОрганизацияПолучатель,,текСтрока.ДатаДокумента,текСтрока.ТочкаОформления)=Истина Тогда
				СтавкаНДС =Справочники.СтавкиНДС.БезНДС;
			Иначе
				СтавкаНДС = ЗначенияСервера.НоменклатураПолучитьСтавкуНДС(текСтрока.Номенклатура, текСтрока.ДатаДокумента);
			КонецЕсли; 
		КонецЕсли; 
		
		СтрокаДвижения.Вставить("СтавкаНДС", СтавкаНДС.Ставка);
		СтрокаДвижения.Вставить("ПредставлениеНДС", ?(СтавкаНДС.Предопределенный=Истина, Справочники.СтавкиНДС.ПолучитьИмяПредопределенного(СтавкаНДС), СокрЛП(СтавкаНДС)));
		СтрокаДвижения.Вставить("БезНДС", (СтавкаНДС=Справочники.СтавкиНДС.БезНДС));
		
		МассивМежхолдерныхДвижений.Добавить(СтрокаДвижения);
		
		Если НоменклатураДляВыгрузки.НайтиПоЗначению(текСтрока.Номенклатура)=Неопределено Тогда
			НоменклатураДляВыгрузки.Добавить(текСтрока.Номенклатура);						
		КонецЕсли; 
	КонецЦикла; 
	
	Если МассивМежхолдерныхДвижений.Количество()>0 Тогда
		ДеревоДокументов.Вставить("МежхолдерныеДвижения", МассивМежхолдерныхДвижений);
	КонецЕсли;
	
	// Номенклатура
	//-------------------------------------------------------------------------------------------------
	МассивНоменклатуры = Новый Массив;
	
	НоменклатураДляВыгрузки.СортироватьПоЗначению();
	Для каждого текЭлемент Из НоменклатураДляВыгрузки Цикл
		СтрокаНоменклатуры = Новый Структура("ИД, КодОбмена, КодОбменаУИД, Наименование, КодЕдиницыИзмерения, НаименованиеПолное, Артикул, Штрихкод, НоменклатурнаяГруппа,Прослеживаемость,ТНВЭД");
		
		Если типЗнч(текЭлемент.Значение)=Тип("СправочникСсылка.Материалы") Тогда
			СтрокаНоменклатуры.ИД = СокрЛП(текЭлемент.Значение.УникальныйИдентификатор());
			СтрокаНоменклатуры.КодОбменаУИД = Ложь;
			СтрокаНоменклатуры.КодОбмена = "";
			СтрокаНоменклатуры.Наименование = СокрЛП(текЭлемент.Значение.Наименование);
			СтрокаНоменклатуры.КодЕдиницыИзмерения = текЭлемент.Значение.ЕдиницаИзмерения.Код;
			СтрокаНоменклатуры.НаименованиеПолное = СокрЛП(текЭлемент.Значение.Наименование);
			СтрокаНоменклатуры.Артикул = "";
			СтрокаНоменклатуры.Штрихкод = ""; 
			СтрокаНоменклатуры.НоменклатурнаяГруппа = "";	
			СтрокаНоменклатуры.Прослеживаемость = "";	
			СтрокаНоменклатуры.ТНВЭД = "";	
		Иначе
			СтрокаНоменклатуры.ИД = СокрЛП(текЭлемент.Значение.УникальныйИдентификатор());
			СтрокаНоменклатуры.КодОбменаУИД = Ложь;
			СтрокаНоменклатуры.КодОбмена = ПолучитьКодОбмена(текЭлемент.Значение, КлючКодаОбмена, СтрокаНоменклатуры.КодОбменаУИД);
			СтрокаНоменклатуры.Наименование = СокрЛП(текЭлемент.Значение.Наименование);
			СтрокаНоменклатуры.КодЕдиницыИзмерения = текЭлемент.Значение.ЕдиницаИзмерения.Код;
			СтрокаНоменклатуры.НаименованиеПолное = СокрЛП(текЭлемент.Значение.НаименованиеПолное);
			СтрокаНоменклатуры.Артикул = СокрЛП(текЭлемент.Значение.Артикул);
			СтрокаНоменклатуры.Штрихкод = СокрЛП(текЭлемент.Значение.ШтрихКод);          
			СтрокаНоменклатуры.Прослеживаемость = ТекЭлемент.Значение.РНПТ;	   
			Если ЗначениеЗаполнено(ТекЭлемент.Значение.ТНВЭД) Тогда
				СтрокаНоменклатуры.ТНВЭД = ТекЭлемент.Значение.ТНВЭД.КодТНВЭД;	
			Иначе	
				СтрокаНоменклатуры.ТНВЭД = "";	
			КонецЕсли;	
			
			Если ЗначениеЗаполнено(текЭлемент.Значение.НоменклатурнаяГруппа)=Истина Тогда 
				СтрокаНоменклатуры.НоменклатурнаяГруппа = ?(ЗначениеЗаполнено(текЭлемент.Значение.НоменклатурнаяГруппа.ИмяПредопределенныхДанных)=Истина, СокрЛП(текЭлемент.Значение.НоменклатурнаяГруппа.ИмяПредопределенныхДанных), СокрЛП(текЭлемент.Значение.НоменклатурнаяГруппа));	
			Иначе
				СтрокаНоменклатуры.НоменклатурнаяГруппа = "";	
			КонецЕсли;
		КонецЕсли; 
		
		МассивНоменклатуры.Добавить(СтрокаНоменклатуры);
	КонецЦикла; 
	
	Если МассивНоменклатуры.Количество()>0 Тогда
		ДеревоДокументов.Вставить("Номенклатура", МассивНоменклатуры);
	КонецЕсли; 
	
	// Контрагенты  (для Гаранта)
	//-------------------------------------------------------------------------------------------------
	
	МассивКонтрагентов = Новый Массив;
	КонтрагентыДляВыгрузки.СортироватьПоЗначению(); 
	
	Если КлючКодаОбмена = "GARANT_T" Тогда
		КлючКодаОбмена = "GARANT_K"
	КонецЕсли;
	
	Для каждого текЭлемент Из КонтрагентыДляВыгрузки Цикл
		СтрокаКонтрагент = Новый Структура("ИД, КодОбмена, КодОбменаУИД, Наименование,ИНН,КПП");  
		
		СтрокаКонтрагент.ИД = СокрЛП(текЭлемент.Значение.УникальныйИдентификатор());
		СтрокаКонтрагент.КодОбменаУИД = Ложь;
		СтрокаКонтрагент.КодОбмена = ПолучитьКодОбмена(текЭлемент.Значение, КлючКодаОбмена, СтрокаКонтрагент.КодОбменаУИД);
		СтрокаКонтрагент.Наименование = СокрЛП(текЭлемент.Значение.Наименование);
		СтрокаКонтрагент.ИНН = СокрЛП(текЭлемент.Значение.ИНН);
		СтрокаКонтрагент.КПП = СокрЛП(текЭлемент.Значение.КПП);
		
		МассивКонтрагентов.Добавить(СтрокаКонтрагент);
	КонецЦикла; 
	
	Если МассивКонтрагентов.Количество()>0 Тогда
		ДеревоДокументов.Вставить("Контрагенты", МассивКонтрагентов);
	КонецЕсли; 
	
	Возврат ДеревоДокументов;	
КонецФункции


//=================================================================================================
// Процедуры и функции для работы с внешними базами данных
//=================================================================================================

Процедура АктивностьПользователейЗагрузить() Экспорт

// Загрузим сведения об активности пользователей (история работы пользователей) за последний час
//-------------------------------------------------------------------------------------------------
	ОпорнаяДата = ЗначенияСервера.ТекущаяДатаСервер();
	РегистрыСведений.АктивностьПользователей.ИсторияОбработать(ОпорнаяДата);
КонецПроцедуры

Функция _Удалить_АгрегаторСоединение() Экспорт
	
	// Функция выполняет подключение к базе данных агрегатора на сервере MainAPPL. В случае успеха
	// возвращает COM-объект типа "COMConnector". В случае ошибки возвращает строку с описанием ошибки
	//-------------------------------------------------------------------------------------------------
	Ответ = "Интеграция.АгрегаторСоединение: Неизвестная ошибка при подключении";
	
	// Выполним попытку подключения
	//-------------------------------------------------------------------------------------------------
	Попытка
		Клиент = Новый COMОбъект("V85.COMConnector");
		
		СтрокаСоединения = "Srvr = 'MainAPPL';";
		СтрокаСоединения = СтрокаСоединения + "Ref = 'sys_agr';";
		СтрокаСоединения = СтрокаСоединения + "Usr = 'ВнешнееПриложение';";
		СтрокаСоединения = СтрокаСоединения + "Pwd = 'Luidor158851'";
		Ответ = Клиент.Connect(СтрокаСоединения);
	Исключение
		Ответ = "Интеграция.АгрегаторСоединение: " + СокрЛП(ОписаниеОшибки());
	КонецПопытки;
	
	Возврат (Ответ);
КонецФункции

Функция SrvDeskСоединение() Экспорт
	
	// Функция выполняет подключение к базе данных Service desk на сервере MainAPPL. В случае успеха
	// возвращает COM-объект типа "COMConnector". В случае ошибки возвращает строку с описанием ошибки
	//-------------------------------------------------------------------------------------------------
	Ответ = "Интеграция.SrvDeskСоединение: Неизвестная ошибка при подключении";
	
	// Выполним попытку подключения
	//-------------------------------------------------------------------------------------------------
	Попытка
		Клиент = Новый COMОбъект("V85.COMConnector");
		
		СтрокаСоединения = "Srvr = 'MainAPPL';";
		СтрокаСоединения = СтрокаСоединения + "Ref = 'srv_desk';";
		СтрокаСоединения = СтрокаСоединения + "Usr = 'ВнешнееПриложение';";
		СтрокаСоединения = СтрокаСоединения + "Pwd = 'Luidor184321'";
		Ответ = Клиент.Connect(СтрокаСоединения);
	Исключение
		Ответ = "Интеграция.SrvDeskСоединение: " + СокрЛП(ОписаниеОшибки());
	КонецПопытки;
	
	Возврат (Ответ);
КонецФункции

Функция ГарантСоединение() Экспорт
	
	// Функция возвращает соединение с базой данных Луидор-Гарант
	// В случае успеха возвращает COM-объект типа "COMConnector"
	// Если соединение не выполнено, то функция возвращает строку с сообщением об ошибке
	//-------------------------------------------------------------------------------------------------
	СтрокаСоединения = "Srvr = 'MainAppG';";
	СтрокаСоединения = СтрокаСоединения + "Ref = 'sto_oper';";
	Ответ = "Луидор-Гарант: Неизвестная ошибка соединения с базой данных";
	
	Попытка
		Клиент = Новый COMОбъект("V85.COMConnector");
		Возврат (Клиент.Connect(СтрокаСоединения));
	Исключение
		Ответ = "Луидор-Гарант: При попытке подключения к базе данных произошла ошибка: " + СокрЛП(ОписаниеОшибки());
	КонецПопытки;
	
	Возврат (Ответ);
КонецФункции

Процедура Пауза(КолСекунд) Экспорт
	
	// Процедура программно имитирует задержку (паузу) без загрузки процессора
	//-------------------------------------------------------------------------------------------------
	Доступно = (ТипЗнч(КолСекунд) = Тип("Число"));
	Доступно = Доступно И (Цел(КолСекунд) > 0);
	
	Если (Доступно = Истина) Тогда
		СтрКоманда = "Timeout /T " + СокрЛП(Формат(КолСекунд,"ЧГ=0")) + " /NoBreak";
		Клиент = Новый COMОбъект("WScript.Shell"); 
		Клиент.Run(СтрКоманда,0,-1);
	КонецЕсли;
КонецПроцедуры


//=================================================================================================
// Рассылка оповещений по запланированным на завтра машинозаездам
//=================================================================================================

Процедура СМСРассылкаЗавтраРемонт(Машинозаезд = Неопределено) Экспорт
	Запрос = Новый Запрос();
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Машинозаезд.ТочкаОформления КАК ТочкаОформления,
	|	Машинозаезд.Автомобиль КАК Автомобиль,
	|	Машинозаезд.СотрудникЗаявки КАК СотрудникЗаявки,
	|	Машинозаезд.КонтактныйТелефон КАК КонтактныйТелефон,
	|	МИНИМУМ(ЕСТЬNULL(Запись.ДатаНачала, ДАТАВРЕМЯ(1, 1, 1))) КАК ДатаЗаписи
	|ИЗ
	|	Документ.Машинозаезд КАК Машинозаезд
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ПланированиеРаботыПостов.ДокументПланирования КАК ДокументПланирования,
	|			МИНИМУМ(ПланированиеРаботыПостов.ДатаНачала) КАК ДатаНачала
	|		ИЗ
	|			РегистрСведений.ПланированиеРаботыПостов КАК ПланированиеРаботыПостов
	|		
	|		СГРУППИРОВАТЬ ПО
	|			ПланированиеРаботыПостов.ДокументПланирования) КАК Запись
	|		ПО (Запись.ДокументПланирования = Машинозаезд.Ссылка)
	|ГДЕ
	|	ЕСТЬNULL(Запись.ДатаНачала, ДАТАВРЕМЯ(1, 1, 1)) МЕЖДУ НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(&ТекущаяДата, ДЕНЬ, 1), ДЕНЬ) И КОНЕЦПЕРИОДА(ДОБАВИТЬКДАТЕ(&ТекущаяДата, ДЕНЬ, 1), ДЕНЬ)
	|	И Машинозаезд.Состояние = ЗНАЧЕНИЕ(Справочник.СтатусыДокументов.Заявка)
	|	И ИСТИНА
	|
	|СГРУППИРОВАТЬ ПО
	|	Машинозаезд.ТочкаОформления,
	|	Машинозаезд.Автомобиль,
	|	Машинозаезд.СотрудникЗаявки,
	|	Машинозаезд.КонтактныйТелефон";
	Запрос.УстановитьПараметр("ТекущаяДата", ЗначенияСервера.ТекущаяДатаСервер());
	
	Если Машинозаезд <> Неопределено Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ИСТИНА", "Док.Ссылка = &Ссылка");
		Запрос.УстановитьПараметр("Ссылка", Машинозаезд);
	КонецЕсли;
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		КонтактныйТелефон = ВРег(СокрЛП(Выборка.КонтактныйТелефон));
		Доступно = Конвертация.ТелефонЭтоМобильный(КонтактныйТелефон);
		Доступно = Доступно И ЗначениеЗаполнено(Выборка.СотрудникЗаявки);
		
		Если (Доступно = Ложь) Тогда
			Продолжить;
		КонецЕсли;
		
		ДатаЗаписи 	= Формат(Выборка.ДатаЗаписи, "ДФ=dd.MM.yyyy");
		ВремяЗаписи = Формат(Выборка.ДатаЗаписи, "ДФ=HH:mm");
		Адрес 		= СокрЛП(Выборка.ТочкаОформления.Адрес);
		Адрес 		= Прав(Адрес, СтрДлина(Адрес)-7);
		Текст 		= СтрШаблон("Добрый день, благодарим Вас за обращение в ГК Луидор! Мы ждем Вас %1 в %2 по адресу %3. Не забывайте с собой документы на автомобиль, доверенность, копию ПТС с отметкой о регистрации автомобиля, сервисную книжку. Тел. 8-800-200-24-02", ДатаЗаписи, ВремяЗаписи, Адрес);
		
		Стр = Новый Структура();		
		Стр.Вставить("Текст",Текст);
		Стр.Вставить("Подпись","Luidor");
		Стр.Вставить("Телефон",КонтактныйТелефон);
		Стр.Вставить("Оператор","РегламентТехцентрЛуидор");
		Стр.Вставить("Холдер",Выборка.СотрудникЗаявки.Холдер);
		Стр.Вставить("ТочкаОформления",Выборка.СотрудникЗаявки.ТочкаОформления);
		Стр.Вставить("ВидДеятельности",Выборка.СотрудникЗаявки.ВидДеятельности);
		Рез = ТелефонияСервер.СообщениеОтправить(Стр);
	КонецЦикла;
КонецПроцедуры

//=================================================================================================
// Функции для выгрузки данных на сайт
//=================================================================================================

Функция ВыгрузитьНоменклатуру(ВыгружатьКартинки,ГруппыНоменклатуры,ТочкаОформления,Контейнер = Неопределено) Экспорт
	//Формирует и возвращает xml с остатками картинкой и т.д. по определенной точке оформления и списку
//номенклатуры за исключением группы с названием "00 Импорт", картинки выгружаются при проставленной 
//галке в поле ВыгружатьКартинки


	ВремНач = ТекущаяДата();
	БазовыйКаталогКартинок = Константы.СТО_БиблиотекаФайловПуть.Получить();
	
	ТемпФайл = ПолучитьИмяВременногоФайла();
	
	ЗаписьXML = Новый ЗаписьXML;
	ЗаписьXML.ОткрытьФайл(ТемпФайл);
	ЗаписьXML.ЗаписатьОбъявлениеXML();    
  	ЗаписьXML.ЗаписатьНачалоЭлемента("Запасы");
	ЗаписьXML.ЗаписатьАтрибут("ТочкаОформления", ТочкаОформления.Наименование);
	
//Получаем остатки и цены все остальные поля из реквизитов справочника номенклатуры, 
//путь к картинке из регистра СТО_БиблиотекаФайлов

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОстаткиТоваровКомпанииОстатки.Номенклатура КАК Номенклатура,
		|	СУММА(ОстаткиТоваровКомпанииОстатки.КоличествоОстаток) КАК Количество,
		|	МАКСИМУМ(ЕСТЬNULL(Цены.Цена, 0)) КАК ЦенаРозничная
		|ПОМЕСТИТЬ ОстаткиЗапасов
		|ИЗ
		|	РегистрНакопления.ОстаткиТоваровКомпании.Остатки(
		|			,
		|			СкладКомпании.ТочкаОформления = &ТочкаОформления
		|				И &Условие1) КАК ОстаткиТоваровКомпанииОстатки
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныТоваровКомпании.СрезПоследних(, ТипЦены = ЗНАЧЕНИЕ(Справочник.типыЦен.ОсновнойТипЦенПродажи)) КАК Цены
		|		ПО ОстаткиТоваровКомпанииОстатки.Номенклатура = Цены.Номенклатура
		|			И ОстаткиТоваровКомпанииОстатки.СкладКомпании.ТочкаОформления = Цены.ТочкаОформления
		|
		|СГРУППИРОВАТЬ ПО
		|	ОстаткиТоваровКомпанииОстатки.Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СТО_БиблиотекаФайлов.Объект КАК Объект,
		|	СТО_БиблиотекаФайлов.Путь КАК Путь
		|ПОМЕСТИТЬ КартинкиВНоменклатуре
		|ИЗ
		|	РегистрСведений.СТО_БиблиотекаФайлов КАК СТО_БиблиотекаФайлов
		|ГДЕ
		|	СТО_БиблиотекаФайлов.Описание = ""Изображение""
		|	И СТО_БиблиотекаФайлов.ВидФайла = ЗНАЧЕНИЕ(Справочник.ВидыПрикрепляемыхФайлов.Номенклатура_Изображение)
		|	И СТО_БиблиотекаФайлов.Путь <> """"
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СпрНоменклатура.КорневаяГруппа.Наименование КАК КорневаяГруппаНаименование,
		|	СпрНоменклатура.НаименованиеПолное КАК НаименованиеПолное,
		|	СпрНоменклатура.КодКаталога КАК КодКаталога,
		|	СпрНоменклатура.Ссылка КАК СсылкаНоменклатуры,
		|	ОстаткиЗапасов.Количество КАК ОстатокКоличество,
		|	ОстаткиЗапасов.ЦенаРозничная КАК ЦенаРозничная,
		|	СпрНоменклатура.Применяемость.(
		|		МодельАвтомобиля КАК МодельАвтомобиля
		|	) КАК Применяемость,
		|	ЕСТЬNULL(КартинкиВНоменклатуре.Путь, """") КАК КраткийПутьККартинке,
		|	СпрНоменклатура.ТНВЭД.КодТНВЭД КАК КодТНВЭД
		|ИЗ
		|	Справочник.Номенклатура КАК СпрНоменклатура
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ОстаткиЗапасов КАК ОстаткиЗапасов
		|		ПО СпрНоменклатура.Ссылка = ОстаткиЗапасов.Номенклатура
		|		ЛЕВОЕ СОЕДИНЕНИЕ КартинкиВНоменклатуре КАК КартинкиВНоменклатуре
		|		ПО СпрНоменклатура.Ссылка = КартинкиВНоменклатуре.Объект
		|ГДЕ
		|	СпрНоменклатура.КорневаяГруппа <> ЗНАЧЕНИЕ(справочник.номенклатура.импорт)
		|	И &Условие2
		|
		|УПОРЯДОЧИТЬ ПО
		|	КорневаяГруппаНаименование";
	
	
	Если ГруппыНоменклатуры.Количество() > 0 тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"&Условие1", "Номенклатура В ИЕРАРХИИ(&ГруппыНоменклатуры)");	
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"&Условие2", "СпрНоменклатура.Ссылка В ИЕРАРХИИ(&ГруппыНоменклатуры)");	
		Запрос.УстановитьПараметр("ГруппыНоменклатуры", ГруппыНоменклатуры);
	иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"&Условие1", "ИСТИНА");	
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"&Условие2", "ИСТИНА");	
	КонецЕсли;
	
	Запрос.УстановитьПараметр("ТочкаОформления", ТочкаОформления);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ЗаписьXML.ЗаписатьНачалоЭлемента("Товар");
		ЗаписьXML.ЗаписатьАтрибут("КорневаяГруппа", ВыборкаДетальныеЗаписи.КорневаяГруппаНаименование);
		ЗаписьXML.ЗаписатьАтрибут("Наименование", ВыборкаДетальныеЗаписи.НаименованиеПолное);
		ЗаписьXML.ЗаписатьАтрибут("КодКаталога", ВыборкаДетальныеЗаписи.КодКаталога);
		ЗаписьXML.ЗаписатьАтрибут("Идентификатор", строка(ВыборкаДетальныеЗаписи.СсылкаНоменклатуры.УникальныйИдентификатор()));
		ЗаписьXML.ЗаписатьАтрибут("Остаток", Формат(ВыборкаДетальныеЗаписи.ОстатокКоличество,"ЧГ=0"));
		ЗаписьXML.ЗаписатьАтрибут("ЦенаРозничная", Формат(ВыборкаДетальныеЗаписи.ЦенаРозничная,"ЧГ=0"));  
		ЗаписьXML.ЗаписатьАтрибут("КодТНВЭД", ВыборкаДетальныеЗаписи.КодТНВЭД);  
			
		Если ВыгружатьКартинки и ВыборкаДетальныеЗаписи.КраткийПутьККартинке <> ""  тогда
			ПолныйПутьККартинке = СокрЛП(БазовыйКаталогКартинок) + СокрЛП(ВыборкаДетальныеЗаписи.КраткийПутьККартинке);
			ФайлОбъект = Новый Файл(ПолныйПутьККартинке);
			Если (ФайлОбъект.Существует() = Истина) тогда
				Попытка
					ЗаписьXML.ЗаписатьАтрибут("Картинка",  Base64Строка(Новый ДвоичныеДанные(ПолныйПутьККартинке)));
				Исключение
				КонецПопытки;
			КонецЕсли;
		КонецЕсли;                                                                                                        
		
		ВыборкаПрименяемость = ВыборкаДетальныеЗаписи.Применяемость.Выбрать();
		Пока ВыборкаПрименяемость.Следующий() цикл
			Если ВыборкаПрименяемость.СемействоАвтомобилей <> Справочники.СемействаАвтомобилей.ПустаяСсылка() тогда 
				ЗаписьXML.ЗаписатьНачалоЭлемента("Применяемость");
				ЗаписьXML.ЗаписатьАтрибут("МодельАвтомобиля", ВыборкаПрименяемость.МодельАвтомобиля.Наименование);
				ЗаписьXML.ЗаписатьКонецЭлемента(); // ПрименяемостьАвтомобили
			КонецЕсли;
		КонецЦикла;
		
		ЗаписьXML.ЗаписатьКонецЭлемента(); // Товар
	КонецЦикла;
	
    ЗаписьXML.ЗаписатьКонецЭлемента(); // Запасы
    ЗаписьXML.Закрыть();

	Сообщить("Время выгрузки в секундах : "+строка(ТекущаяДата()-ВремНач));
	
	бинарникФайла = Новый ДвоичныеДанные(ТемпФайл);
	Контейнер = ?(Контейнер = Истина,"",Контейнер);

	Возврат ПоместитьВоВременноеХранилище(бинарникФайла,Контейнер);  
	
КонецФункции


//=================================================================================================
// Процедуры и функции для обработки входящей почты от различных информационных систем
//=================================================================================================

Процедура DNM_ДанныеЗагрузить() Экспорт

// ИНФОТЕХ - УАЗ, ВАЗ
//-------------------------------------------------------------------------------------------------
	Обработки.Интеграция_ИНФОТЕХ.АвтоматОприходованияУАЗ_ПочтаОбработать();

// Система Электронных Паспортов (СЕП ЭлПТС, почтовый ящик: ELPTS@LUIDOR.RU)
//-------------------------------------------------------------------------------------------------
	РегистрыСведений.ВыпискиЭлПТС.ЭлПтсПочтаОбработать();

// МОСКВИЧ
//-------------------------------------------------------------------------------------------------
	Справочники.НЭГрафикОтгрузкиМосквич.ДанныеЗагрузить();
	Справочники.НЭМосквичСправочники.ОбновитьГруппу_Автоработы_OperCode();
КонецПроцедуры

Процедура DNM_ОтчетыОтправить() Экспорт

// МОСКВИЧ
//-------------------------------------------------------------------------------------------------
	Справочники.НЭМосквичОтчеты.ОтчетыОтправить();

// ПРАЙМКОРД
//-------------------------------------------------------------------------------------------------
	Документы.КСОЗаявкаПраймкорд.СостояниеОбновить();

// ИНФОТЕХ
//-------------------------------------------------------------------------------------------------
	Справочники.ИСИнфотехДанные.ГруппыЗаполнить();
	Справочники.ИСИнфотехОтчеты.ОтчетыОтправить();
КонецПроцедуры

Процедура ECLIENT_СделкиВыгрузить() Экспорт
	ОбработкаВыгрузки = Обработки.ВыгрузкаГАЗ.Создать();
	ОбработкаВыгрузки.ВыгрузитьДокументы();	
КонецПроцедуры

Процедура ОЧЕРЕДЬЗАДАНИЙ_Обработать() Экспорт

// Процедура запускает обработку системных очередей (справочник "ОчередьЗаданий")
//-------------------------------------------------------------------------------------------------
	Справочники.ОчередьЗаданий.ОчередьОбработать();
КонецПроцедуры


//=================================================================================================
// Процедуры и функции для работы с CRM ГАЗ
//=================================================================================================

&НаСервере
Функция ОтправитьЗапросНаСервер(ТекстЗапроса, ВыводитьСообщенияВЖурнал=Истина) Экспорт
	Сайт = "gaz-ecm3.slms.ru";
	
	РезультатЗапроса = Неопределено;                                           
	
	// Создание файла с текстом отправляемого запроса
	//-------------------------------------------------------------------------------------------------
	ТекстовыйДокумент = Новый ТекстовыйДокумент;
	ТекстовыйДокумент.ДобавитьСтроку("--JUSTSOMESCRAPSTRING");
	ТекстовыйДокумент.ДобавитьСтроку("Content-Disposition: form-data; name=""xml""");
	ТекстовыйДокумент.ДобавитьСтроку("Content-Type: text/plain" + Символы.ВК + Символы.ПС);
	ТекстовыйДокумент.ДобавитьСтроку(ТекстЗапроса);
	ТекстовыйДокумент.ДобавитьСтроку("--JUSTSOMESCRAPSTRING");
	
	// Создание пакета HTTPЗапрос
	//-------------------------------------------------------------------------------------------------
	Заголовки = Новый Соответствие();
	Заголовки.Вставить("Content-Type","multipart/form-data;boundary=JUSTSOMESCRAPSTRING");
	
	Запрос = Новый HTTPЗапрос("/api/gateway/",Заголовки);
	Запрос.УстановитьТелоИзСтроки(ТекстовыйДокумент.ПолучитьТекст(), КодировкаТекста.UTF8);
	
	ИмяФайлаОтвета = ПолучитьИмяВременногоФайла("XML");
	
	Соединение = Новый HTTPСоединение(Сайт);
	РезультатЗапроса = Соединение.ОтправитьДляОбработки(Запрос, ИмяФайлаОтвета);
	
	Если РезультатЗапроса.КодСостояния=200 ИЛИ РезультатЗапроса.КодСостояния=201 ИЛИ РезультатЗапроса.КодСостояния=202 Тогда
		Чтение = Новый ЧтениеXML;
		Чтение.ОткрытьФайл(ИмяФайлаОтвета);
		
		ПостроительDOM        = Новый ПостроительDOM;
		ДокументDOM            = ПостроительDOM.Прочитать(Чтение);
		Чтение.Закрыть();
		РазыменовательПИ    = Новый РазыменовательПространствИменDOM(ДокументDOM);
		
		Ошибка = Ложь;    
		
		СписокОшибок        = ДокументDOM.ВычислитьВыражениеXPath("//*[contains(name(),'error')]", ДокументDOM, РазыменовательПИ);
		текСтрока = СписокОшибок.ПолучитьСледующий();
		Пока текСтрока<>Неопределено Цикл
			Ошибка = Истина;
			
			номерОшибки = текСтрока.Атрибуты.ПолучитьИменованныйЭлемент("num").Значение;
			описаниеОшибки = текСтрока.ТекстовоеСодержимое;
			
			Если ВыводитьСообщенияВЖурнал=Истина Тогда
				ЗаписьЖурналаРегистрации("Выгрузка_ГАЗ", УровеньЖурналаРегистрации.Ошибка, , , "При выполнении запроса возникла ошибка: "+описаниеОшибки+"("+номерОшибки+") "+ТекстЗапроса);		
			КонецЕсли; 
			
			текСтрока = СписокОшибок.ПолучитьСледующий();
		КонецЦикла; 
		
		Если Ошибка Тогда
			РезультатЗапроса = Неопределено;
		Иначе
			РезультатЗапроса = ДокументDOM;
		КонецЕсли; 
		
		ДокументDOM = Неопределено;
	Иначе
		Если ВыводитьСообщенияВЖурнал=Истина Тогда
			ЗаписьЖурналаРегистрации("Выгрузка_ГАЗ", УровеньЖурналаРегистрации.Ошибка, , , "При выполнении запроса возникла ошибка: "+СокрЛП(РезультатЗапроса.КодСостояния));
		КонецЕсли;
	КонецЕсли; 
	
	Возврат РезультатЗапроса;	
КонецФункции

&НаСервере
Функция УстановитьПодключение(Логин, Пароль) Экспорт
	Если ЗначениеЗаполнено(Логин)=Ложь Тогда
		Возврат Неопределено;		
	КонецЕсли; 
	
	идСессии = Неопределено;
	
	Запрос = СформироватьНачалоЗапроса("Authorize");
	
	Запрос.ЗаписатьНачалоЭлемента("login");
	Запрос.ЗаписатьТекст(Логин);
	Запрос.ЗаписатьКонецЭлемента();
	
	Запрос.ЗаписатьНачалоЭлемента("password");
	Запрос.ЗаписатьТекст(Пароль);
	Запрос.ЗаписатьКонецЭлемента();
	
	РезультатЗапроса = ВыполнитьЗапрос(Запрос);
	
	идСессии = ПолучитьЗначениеПараметра(РезультатЗапроса, "session_id");
	
	Возврат идСессии;
КонецФункции

&НаСервере
Функция ПолучитьЗначениеПараметра(Результат, выбПараметр) Экспорт
	нЗначение = Неопределено;
	
	Если ТипЗнч(Результат)=Тип("ДокументDOM") Тогда
		РазыменовательПИ    = Новый РазыменовательПространствИменDOM(Результат);
		
		текСтрока = Результат.ВычислитьВыражениеXPath("//*[name()='"+СокрЛП(выбПараметр)+"']", Результат, РазыменовательПИ).ПолучитьСледующий();
		Если текСтрока<>Неопределено Тогда
			нЗначение = текСтрока.ТекстовоеСодержимое;
		КонецЕсли; 
	КонецЕсли;
	
	Возврат нЗначение;
КонецФункции

&НаСервере
Функция СформироватьНачалоЗапроса(имяМетода, идСессии=Неопределено) Экспорт 
	Запрос = Новый ЗаписьXML;
	Запрос.УстановитьСтроку("UTF-8");
	Запрос.ЗаписатьОбъявлениеXML();
	
	Запрос.ЗаписатьНачалоЭлемента("request");
	Запрос.ЗаписатьАтрибут("method",имяМетода);
	
	Если ЗначениеЗаполнено(идСессии)=Истина Тогда
		Запрос.ЗаписатьНачалоЭлемента("session_id");
		Запрос.ЗаписатьТекст(идСессии);
		Запрос.ЗаписатьКонецЭлемента();		
	КонецЕсли; 
	
	Возврат Запрос;		
КонецФункции

&НаСервере
Функция ВыполнитьЗапрос(Запрос, ВыводитьСообщенияВЖурнал=Истина) Экспорт 
	Запрос.ЗаписатьКонецЭлемента();
	ТекстЗапроса = Запрос.Закрыть();
	
	РезультатЗапроса = ОтправитьЗапросНаСервер(ТекстЗапроса, ВыводитьСообщенияВЖурнал);
	
	Возврат РезультатЗапроса;
КонецФункции

//=================================================================================================
// Процедуры и функции для Честный Знак
//=================================================================================================

// Преобразовывает текстовое представление статуса документа в значение перечисления и наоборот.
//
// Параметры:
// ЗначениеПоиска - ПеречислениеСсылка.СтатусыДокументовИСМП, Строка - значение для перекодировки
//
// Возвращаемое значение:
// ПеречислениеСсылка.СтатусыДокументовИСМП, Строка - статус документа.

//Функция СтатусДокументаИСМП(Знач ЗначениеПоиска) Экспорт
//	
//	Если ТипЗнч(ЗначениеПоиска) = Тип("Строка") Тогда
//		ЗначениеПоиска = ВРег(ЗначениеПоиска);
//		Если ЗначениеПоиска = "CHECKED_OK" Тогда
//			Возврат Перечисления.СтатусыДокументовИСМП.Проверен;
//		ИначеЕсли ЗначениеПоиска = "CHECKED_NOT_OK" Тогда
//			Возврат Перечисления.СтатусыДокументовИСМП.ЕстьОшибки;
//		ИначеЕсли ЗначениеПоиска = "IN_PROGRESS" Тогда
//			Возврат Перечисления.СтатусыДокументовИСМП.Обрабатывается;
//		ИначеЕсли ЗначениеПоиска = "PROCESSING_ERROR" Тогда
//			Возврат Перечисления.СтатусыДокументовИСМП.Ошибка;
//		ИначеЕсли ЗначениеПоиска = "UNDEFINED" Тогда
//			Возврат Перечисления.СтатусыДокументовИСМП.Неопределен;
//		ИначеЕсли ЗначениеПоиска = "WAIT_ACCEPTANCE" Тогда
//			Возврат Перечисления.СтатусыДокументовИСМП.ОжидаетсяПодтверждениеПоступления;
//		ИначеЕсли ЗначениеПоиска = "WAIT_PARTICIPANT_REGISTRATION" Тогда
//			Возврат Перечисления.СтатусыДокументовИСМП.ОжидаетРегистрациюУчастникаГИСМТ;
//		ИначеЕсли ЗначениеПоиска = "CANCELLED" Тогда
//			Возврат Перечисления.СтатусыДокументовИСМП.Отменен;
//		ИначеЕсли ЗначениеПоиска = "ACCEPTED" Тогда
//			Возврат Перечисления.СтатусыДокументовИСМП.Принят;
//		КонецЕсли;
//	Иначе
//		Если ЗначениеПоиска = Перечисления.СтатусыДокументовИСМП.Проверен Тогда
//			Возврат "CHECKED_OK";
//		ИначеЕсли ЗначениеПоиска = Перечисления.СтатусыДокументовИСМП.ЕстьОшибки Тогда
//			Возврат "CHECKED_NOT_OK";
//		ИначеЕсли ЗначениеПоиска = Перечисления.СтатусыДокументовИСМП.Обрабатывается Тогда
//			Возврат "IN_PROGRESS";
//		ИначеЕсли ЗначениеПоиска = Перечисления.СтатусыДокументовИСМП.Ошибка Тогда
//			Возврат "PROCESSING_ERROR";
//		ИначеЕсли ЗначениеПоиска = Перечисления.СтатусыДокументовИСМП.Неопределен Тогда
//			Возврат "UNDEFINED";
//		ИначеЕсли ЗначениеПоиска = Перечисления.СтатусыДокументовИСМП.ОжидаетсяПодтверждениеПоступления Тогда
//			Возврат "WAIT_ACCEPTANCE";
//		ИначеЕсли ЗначениеПоиска = Перечисления.СтатусыДокументовИСМП.ОжидаетРегистрациюУчастникаГИСМТ Тогда
//			Возврат "WAIT_PARTICIPANT_REGISTRATION";
//		ИначеЕсли ЗначениеПоиска = Перечисления.СтатусыДокументовИСМП.Отменен Тогда
//			Возврат "CANCELLED";
//		ИначеЕсли ЗначениеПоиска = Перечисления.СтатусыДокументовИСМП.Принят Тогда
//			Возврат "ACCEPTED";
//		КонецЕсли;
//	КонецЕсли;
//	
//	Возврат Неопределено;
//КонецФункции

//&НаСервере
//Функция ПроверкаКодовМаркировки(СтруктураЗапроса) Экспорт
//	//нужно поле: СтруктураЗапроса.Организация - нужно для любого запроса
//	//нужно поле: СтруктураЗапроса.КИЗ_товара - нужно для проверки валидности КИЗа (числится в обороте)
//	//нужно поле: СтруктураЗапроса.ПриходныйДокумент - нужно для получения КИЗов по документу из ЧЗ
//	
//	Ответ = Ложь;
//	СтруктураЗапроса.Вставить("Токен","");
//	Если ЗначениеЗаполнено(СтруктураЗапроса.Токен)=Ложь тогда
//		ЗаполнитьТокенНаСервере(СтруктураЗапроса);
//	КонецЕсли;
//	Если ЗначениеЗаполнено(СтруктураЗапроса.Токен)=Ложь тогда
//		ПолучитьТокенНаСервере(СтруктураЗапроса);
//	КонецЕсли;
//	Если ЗначениеЗаполнено(СтруктураЗапроса.Токен)=Истина тогда
//		Если СтруктураЗапроса.Свойство("КИЗ_товара") Тогда 
//			Ответ = ОтправитьЗапросПоКодуМаркировки(СтруктураЗапроса);
//		ИначеЕсли СтруктураЗапроса.Свойство("ПриходныйДокумент") Тогда  
//			Ответ = ОтправитьЗапросПоПриходномуДокументу(СтруктураЗапроса);
//		КонецЕсли;
//	КонецЕсли;
//	Возврат Ответ;
//КонецФункции

//&НаСервере
//Функция ОтправитьЗапросПоКодуМаркировки(СтруктураЗапроса)
//	
//	КИ_Валидный = Ложь;
//	ПреффиксAPI		 = "/api/v3/true-api/";
//	
//	СтрокаПараметров = "cises/listV2?cis="+СтруктураЗапроса.КИЗ_товара;
//	HTTPЗапрос = новый HTTPЗапрос(ПреффиксAPI + СтрокаПараметров);
//	HTTPЗапрос.Заголовки.Вставить("Authorization"	, "Bearer " + СтруктураЗапроса.Токен);
//	HTTPЗапрос.Заголовки.Вставить("Content-Type"	, "application/json; charset=UTF-8");
//	
//	СоединениеHTTP = ПолучитьHTTPСоединение();
//	
//	HTTPОтвет = СоединениеHTTP.Получить(HTTPЗапрос);	
//	
//	СтрокаJSON = HTTPОтвет.ПолучитьТелоКакСтроку();
//	
//	//ДокументJSON = СтрЗаменить(СтрокаJSON, """,""", """," + Символы.ПС + Символы.Таб + """");
//	
//	Если HTTPОтвет.КодСостояния = 401 тогда
//		ПолучитьТокенНаСервере(СтруктураЗапроса);	
//	КонецЕсли;
//	
//	Если HTTPОтвет.КодСостояния <> 200 Тогда
//		Сообщить(СтрокаJSON);
//		Возврат Ложь;
//	КонецЕсли;
//	
//	ЧтениеJSON = Новый ЧтениеJSON; 
//	ЧтениеJSON.УстановитьСтроку(СтрокаJSON);
//	ДанныеJSON = ПрочитатьJSON(ЧтениеJSON);
//	ЧтениеJSON.Закрыть();
//	
//	Если ТипЗнч(ДанныеJSON) = Тип("Структура") Тогда
//		Если ДанныеJSON.Свойство("results")
//			И ТипЗнч(ДанныеJSON.results) = Тип("Массив") Тогда
//			ОтветМассивДанных = ДанныеJSON.results;
//		КонецЕсли;
//	КонецЕсли;
//	
//	Если ОтветМассивДанных.Количество()>0 тогда
//		//	Статус товара/КИ:
//		//EMITTED – эмитирован. Выпущен;
//		//APPLIED – эмитирован. Получен;
//		//INTRODUCED – в обороте; Считаем подходящим только это состояние.
//		//WRITTEN_OFF – КИ списан;
//		//RETIRED – выбыл;
//		//DISAGGREGATION – расформирован (только для упаковок)
//		
//		Если ОтветМассивДанных[0].status = "INTRODUCED" тогда
//			КИ_Валидный = Истина;
//		КонецЕсли;
//	КонецЕсли;
//	
//	Возврат КИ_Валидный; 
//КонецФункции

//&НаСервере
//Функция ОтправитьЗапросПоПриходномуДокументу(СтруктураЗапроса)
//	
//	ГУИД_ЧЗ_Документа = "";
//	ПреффиксAPI		 = "/api/v3/true-api/";
//	ДокПриход = СтруктураЗапроса.ПриходныйДокумент; 
//	СтрокаПараметров = "doc/listV2?dateFrom="+Формат(ДокПриход.ВхДата,"ДФ=yyyy-MM-dd")+"T00%3A00%3A00.211Z&dateTo="+Формат(ДокПриход.ВхДата,"ДФ=yyyy-MM-dd")+"T23%3A59%3A59.211Z&inputFormat=true";
//	
//	HTTPЗапрос = новый HTTPЗапрос(ПреффиксAPI + СтрокаПараметров);
//	HTTPЗапрос.Заголовки.Вставить("Authorization"	, "Bearer " + СтруктураЗапроса.Токен);
//	HTTPЗапрос.Заголовки.Вставить("Content-Type"	, "application/json; charset=UTF-8");
//	
//	СоединениеHTTP = ПолучитьHTTPСоединение();
//	
//	HTTPОтвет = СоединениеHTTP.Получить(HTTPЗапрос);	
//	
//	СтрокаJSON = HTTPОтвет.ПолучитьТелоКакСтроку();
//	
//	//ДокументJSON = СтрЗаменить(СтрокаJSON, """,""", """," + Символы.ПС + Символы.Таб + """");
//	
//	Если HTTPОтвет.КодСостояния = 401 тогда
//		ПолучитьТокенНаСервере(СтруктураЗапроса);	
//	КонецЕсли;
//	
//	Если HTTPОтвет.КодСостояния <> 200 Тогда
//		Сообщить(СтрокаJSON);
//		Возврат Ложь;
//	КонецЕсли;
//	
//	ЧтениеJSON = Новый ЧтениеJSON; 
//	ЧтениеJSON.УстановитьСтроку(СтрокаJSON);
//	ДанныеJSON = ПрочитатьJSON(ЧтениеJSON);
//	ЧтениеJSON.Закрыть();
//	
//	Если ТипЗнч(ДанныеJSON) = Тип("Структура") Тогда
//		Если ДанныеJSON.Свойство("results")
//			И ТипЗнч(ДанныеJSON.results) = Тип("Массив") Тогда
//			ОтветМассивДанных = ДанныеJSON.results;
//		КонецЕсли;
//	КонецЕсли;
//	
//	Если ОтветМассивДанных.Количество()>0 тогда
//		МассивДокументовОтвет = Новый Массив;
//		Для Каждого ДокПостЧЗ из ОтветМассивДанных цикл 
//			Если ДокПостЧЗ.senderInn = СтруктураЗапроса.ПриходныйДокумент.Контрагент.ИНН тогда
//				ГУИД_ЧЗ_Документа = ДокПостЧЗ.number;
//			КонецЕсли;
//		КонецЦикла;
//	КонецЕсли;
//	
//	Если ЗначениеЗаполнено(ГУИД_ЧЗ_Документа) Тогда 
//		ПреффиксAPI		 = "/api/v3/true-api/";
//		СтрокаПараметров = "documents/"+ГУИД_ЧЗ_Документа+"/info";
//		HTTPЗапрос = новый HTTPЗапрос(ПреффиксAPI + СтрокаПараметров);
//		HTTPЗапрос.Заголовки.Вставить("Authorization"	, "Bearer " + СтруктураЗапроса.Токен);
//		HTTPЗапрос.Заголовки.Вставить("Content-Type"	, "application/json; charset=UTF-8");
//		СоединениеHTTP = ПолучитьHTTPСоединение();
//		HTTPОтвет = СоединениеHTTP.Получить(HTTPЗапрос);	
//		СтрокаJSON = HTTPОтвет.ПолучитьТелоКакСтроку();
//		
//		ЧтениеJSON = Новый ЧтениеJSON; 
//		ЧтениеJSON.УстановитьСтроку(СтрокаJSON);
//		ДанныеJSON = ПрочитатьJSON(ЧтениеJSON);
//		ЧтениеJSON.Закрыть();
//		
//		Если ТипЗнч(ДанныеJSON) = Тип("Структура") Тогда
//			Если ДанныеJSON.Свойство("results")
//				И ТипЗнч(ДанныеJSON.results) = Тип("Массив") Тогда
//				ОтветМассивДанных = ДанныеJSON.results;
//			КонецЕсли;
//		КонецЕсли;
//		
//		Если ОтветМассивДанных.Количество()>0 тогда
//			НовСтрукт = Новый Структура;
//			
//			Если ДанныеJSON.body.свойство("document_num") тогда 
//				НовСтрукт.Вставить("НомерДокумента",ДанныеJSON.body.document_num);
//				НовСтрукт.Вставить("ДатаДокумента",дата(СтрЗаменить(Лев(ДанныеJSON.body.document_date,10),"-","")));
//				Товары = Новый ТаблицаЗначений;
//				Товары.Колонки.Добавить("Номенклатура");
//				Товары.Колонки.Добавить("КИЗ");
//				Товары.Колонки.Добавить("Цена");
//				Товары.Колонки.Добавить("ЦенаНалог");
//				Для Каждого ЭлМасс из ДанныеJSON.body.products цикл
//					НС_Товары = Товары.Добавить();
//					НС_Товары.Номенклатура = ЭлМасс.product_description;
//					НС_Товары.КИЗ = ЭлМасс.uit_code;
//					НС_Товары.Цена = ЭлМасс.product_cost/100;
//					НС_Товары.ЦенаНалог = ЭлМасс.product_tax/100;
//				КонецЦикла;
//				НовСтрукт.Вставить("Товары",Товары);
//			Иначе 
//				
//				ЧтениеXML = Новый ЧтениеXML;
//				ЧтениеXML.УстановитьСтроку(ДанныеJSON.content);
//				Фабрика=Новый ФабрикаXDTO;
//				ОбXDTO=Фабрика.ПрочитатьXML(ЧтениеXML);
//				
//				НовСтрукт.Вставить("НомерДокумента",ОбXDTO.Документ.СвСчФакт.НомерСчФ);
//				НовСтрукт.Вставить("ДатаДокумента",Дата(Сред(ОбXDTO.Документ.СвСчФакт.ДатаСчФ,7,4)+Сред(ОбXDTO.Документ.СвСчФакт.ДатаСчФ,4,2)+Сред(ОбXDTO.Документ.СвСчФакт.ДатаСчФ,0,2)));
//				Товары = Новый ТаблицаЗначений;         
//				Товары.Колонки.Добавить("Номенклатура");
//				Товары.Колонки.Добавить("КИЗ");
//				Товары.Колонки.Добавить("Цена");
//				Товары.Колонки.Добавить("ЦенаНалог");
//				Для Каждого ЭлМассТовар из ОбXDTO.Документ.ТаблСчФакт.СведТов цикл 
//					Для Каждого ЭлМассКИЗ из ЭлМассТовар.ДопСведТов.НомСредИдентТов.КИЗ цикл
//						НС_Товары = Товары.Добавить();
//						НС_Товары.Номенклатура = ЭлМассТовар.НаимТов;
//						НС_Товары.КИЗ = ЭлМассКИЗ;
//						НС_Товары.Цена = Число(ЭлМассТовар.СтТовУчНал)/Число(ЭлМассТовар.КолТов);
//						НС_Товары.ЦенаНалог = Число(ЭлМассТовар.СумНал.СумНал)/Число(ЭлМассТовар.КолТов);		
//					КонецЦикла;                                                                 
//				КонецЦикла;
//				НовСтрукт.Вставить("Товары",Товары);
//			КонецЕсли;	
//		КонецЕсли;
//	КонецЕсли;
//	
//	Возврат НовСтрукт; 
//КонецФункции

//&НаСервере
//Процедура ЗаполнитьТокенНаСервере(СтруктураЗапроса)
//	
//	ТекЗапись = РегистрыСведений.ТокеныЧЗ.СоздатьМенеджерЗаписи();
//	ТекЗапись.Организация = СтруктураЗапроса.Организация;
//	ТекЗапись.Прочитать();
//	
//	Если (ТекЗапись.Выбран() = Истина) Тогда
//		СтруктураЗапроса.Токен = ТекЗапись.Токен;
//		СтруктураЗапроса.HexСтрокаОтпечаткаСертификата = ТекЗапись.HexСтрокаОтпечаткаСертификата;
//	КонецЕсли;
//	
//КонецПроцедуры

&НаСервере
Функция ПолучитьСертификатПоОтпечатку(ОтпечатокСтрокаHEX)
	
	НайденныйСертификат = Неопределено; // Найденный сертификат (Com-объект)
	
	CAPICOM_CURRENT_USER_STORE	 = 2; 		//2 - Искать сертификат в ветке "Личное" хранилища.
	CAPICOM_MY_STORE			 = "My";	//Указываем, что ветку "Личное" берем из хранилища текущего пользователя
	CAPICOM_STORE_OPEN_READ_ONLY = 0; 		//Открыть хранилище только на чтение
	
	oStore = Новый COMОбъект("CAdESCOM.Store"); // Объект описывает хранилище сертификатов
	oStore.Open(CAPICOM_CURRENT_USER_STORE, CAPICOM_MY_STORE, CAPICOM_STORE_OPEN_READ_ONLY); // Открыть хранилище сертификатов
	
	//1 вариант: поиск сертификата по отпечатку
	CAPICOM_CERTIFICATE_FIND_SHA1_HASH = 0;
	
	Certificates = oStore.Certificates.Find(CAPICOM_CERTIFICATE_FIND_SHA1_HASH, ОтпечатокСтрокаHEX);
	НайденныйСертификат = Certificates.Item(1);
	
	oStore.Close(); //Закрыть хранилище сертификатов и освободить объект 61
	
	Возврат НайденныйСертификат;
	
КонецФункции

//&НаСервере
//Функция ПодписатьЭЦП(ТекстBase64, ОтпечатокСертификатаBase64, Откреплённая,СтруктураЗапроса)
//	//Код имени Романа Вениаминовича #ГИСМТ #Честный_Знак #ЭЦП
//	HexСтрокаОтпечаткаСертификата = ЗаполнитьHexСтрокаОтпечаткаСертификата(СтруктураЗапроса);
//	
//	Если HexСтрокаОтпечаткаСертификата<>"" тогда 
//		CADESCOM_BASE64_TO_BINARY		 = 1; //Входные данные пришли в Base64
//		CADESCOM_CADES_TYPE				 = 1; //Тип усовершенствованной подписи
//		EncodingType					 = 0;
//		
//		//Объект, задающий параметры создания и содержащий информацию об усовершенствованной подписи.
//		oSigner = Новый COMОбъект("CAdESCOM.CPSigner");
//		oSigner.Certificate = ПолучитьСертификатПоОтпечатку(HexСтрокаОтпечаткаСертификата);
//		
//		//Объект CadesSignedData предоставляет свойства и методы для работы с усовершенствованной подписью.
//		oSignedData = Новый COMОбъект("CAdESCOM.CadesSignedData");
//		oSignedData.ContentEncoding	 = CADESCOM_BASE64_TO_BINARY;
//		oSignedData.Content			 = ТекстBase64;
//		
//		sSignedMessage = oSignedData.SignCades(oSigner, CADESCOM_CADES_TYPE, Откреплённая, EncodingType);
//		
//		Возврат sSignedMessage; //Подпись в формате Base64
//	Иначе 
//		Возврат "";
//	КонецЕсли;
//КонецФункции

//&НаСервере
//Функция ПолучитьHTTPСоединение()
//	
//	//Сервер 		   = "markirovka.crpt.ru";
//	Сервер				 = "int01.gismt.crpt.tech";
//	СоединениеHTTP = Новый HTTPСоединение(Сервер, 443,,,,, Новый ЗащищенноеСоединениеOpenSSL);
//	Возврат СоединениеHTTP
//	
//КонецФункции

//&НаСервере
//Процедура ПолучитьТокенНаСервере(СтруктураЗапроса)
//	
//	//1. Получение данных для получения токена
//	ПреффиксAPI		 = "/api/v3/true-api/";
//	HTTPЗапрос = новый HTTPЗапрос(ПреффиксAPI + "auth/key");
//	
//	СоединениеHTTP = ПолучитьHTTPСоединение();
//	
//	HTTPОтвет = СоединениеHTTP.Получить(HTTPЗапрос);
//	СтрокаОтвета = HTTPОтвет.ПолучитьТелоКакСтроку("UTF-8"); 
//	
//	ЧтениеJSON = Новый ЧтениеJSON; 
//	ЧтениеJSON.УстановитьСтроку(СтрокаОтвета); 
//	ДанныеJSON = ПрочитатьJSON(ЧтениеJSON); 
//	ЧтениеJSON.Закрыть();
//	
//	УИД				 = ДанныеJSON.uuid;
//	СлучайныеДанные	 = ДанныеJSON.data;
//	
//	
//	//2. Подписание данных для получения токена
//	СлучайныеДанныеДД		 = ПолучитьДвоичныеДанныеИзСтроки(СлучайныеДанные);
//	СлучайныеДанныеBase64	 = Base64Строка(СлучайныеДанныеДД);
//	
//	//ЗаполнитьHexСтрокаОтпечаткаСертификата();
//	//
//	//Если HexСтрокаОтпечаткаСертификата = "" тогда
//	//	Возврат;
//	//КонецЕсли;
//	
//	ДанныеДляПолученияТокена = ПодписатьЭЦП(СлучайныеДанныеBase64, Неопределено, Ложь,СтруктураЗапроса);
//	
//	Если ДанныеДляПолученияТокена="" тогда
//		Возврат ;
//	КонецЕсли;
//	
//	//3. Получение токена с использованием подписанных данных
//	ДанныеДляЗапроса = Новый Структура;
//	ДанныеДляЗапроса.Вставить("uuid", УИД);
//	ДанныеДляЗапроса.Вставить("data", ДанныеДляПолученияТокена);	
//	
//	ЗаписьJSON = Новый ЗаписьJSON;
//	ЗаписьJSON.УстановитьСтроку();
//	ЗаписатьJSON(ЗаписьJSON, ДанныеДляЗапроса);
//	СтрокаДляЗапроса = ЗаписьJSON.Закрыть();
//	
//	Заголовки = Новый Соответствие;
//	Заголовки.Вставить("Content-Type"	, "application/json; charset=UTF-8");
//	Заголовки.Вставить("Accept"			, "application/json");
//	
//	HTTPЗапрос = Новый HTTPЗапрос(ПреффиксAPI + "auth/simpleSignIn", Заголовки);
//	HTTPЗапрос.УстановитьТелоИзСтроки(СтрокаДляЗапроса, КодировкаТекста.UTF8, ИспользованиеByteOrderMark.НеИспользовать);
//	
//	СоединениеHTTP = ПолучитьHTTPСоединение();
//	
//	//4. Обработка ответа
//	HTTPОтвет = СоединениеHTTP.ОтправитьДляОбработки(HTTPЗапрос);
//	
//	ЧтениеJSON = Новый ЧтениеJSON;
//	ЧтениеJSON.УстановитьСтроку(HTTPОтвет.ПолучитьТелоКакСтроку());
//	
//	HTTPОтвет = ПрочитатьJSON(ЧтениеJSON, Ложь);
//	
//	Если HTTPОтвет.Свойство("token") Тогда
//		Токен = HTTPОтвет.token;
//		
//		СтруктураЗапроса.Токен = Токен;
//		НовЗапись = РегистрыСведений.ТокеныЧЗ.СоздатьМенеджерЗаписи();
//		ЗаполнитьЗначенияСвойств(НовЗапись,СтруктураЗапроса);
//		НовЗапись.Записать(Истина);
//	Иначе	
//		Сообщить(HTTPОтвет.code);
//	КонецЕсли;
//	
//КонецПроцедуры

//&НаСервере
//Функция ЗаполнитьHexСтрокаОтпечаткаСертификата(СтруктураЗапроса) 
//	//Код имени Романа Вениаминовича #ГИСМТ #Честный_Знак #ЭЦП
//	
//	ТекЗапись = РегистрыСведений.ТокеныЧЗ.СоздатьМенеджерЗаписи();
//	ТекЗапись.Организация = СтруктураЗапроса.Организация;
//	ТекЗапись.Прочитать();
//	
//	Если (ТекЗапись.Выбран() = Ложь) Тогда
//		Попытка
//			МенеджерКриптографии = Новый МенеджерКриптографии("", "", 80);
//		Исключение
//			ВызватьИсключение("Не удалось создать менеджер криптографии (тип 80)");
//		КонецПопытки;
//		
//		//Получаем сертификаты для каждого типа хранилища сертификатов
//		Хранилище = МенеджерКриптографии.ПолучитьХранилищеСертификатов(ТипХранилищаСертификатовКриптографии.ПерсональныеСертификаты);
//		
//		//Выбираем все сертификаты
//		СертификатыХранилища = Хранилище.ПолучитьВсе();
//		ТекущаяДата = ТекущаяДата();
//		Для Каждого ТекСертификат Из СертификатыХранилища Цикл
//			Если  ТекСертификат.ДатаОкончания < ТекущаяДата Тогда 
//				Продолжить;
//			КонецЕсли;
//			
//			Если СтрЧислоВхождений(ТекСертификат.Субъект.OID1_2_643_3_131_1_1,СтруктураЗапроса.Организация.ИНН) = 0 Тогда 
//				Продолжить;
//			КонецЕсли;
//			HexСтрокаОтпечаткаСертификата  = ПолучитьHexСтрокуИзДвоичныхДанных(ТекСертификат.Отпечаток);
//			СтруктураЗапроса.HexСтрокаОтпечаткаСертификата = HexСтрокаОтпечаткаСертификата;
//			НовЗапись = РегистрыСведений.ТокеныЧЗ.СоздатьМенеджерЗаписи();
//			ЗаполнитьЗначенияСвойств(НовЗапись,СтруктураЗапроса);
//			НовЗапись.Записать(Истина);
//			Прервать;
//		КонецЦикла;
//	Иначе 
//		HexСтрокаОтпечаткаСертификата = ТекЗапись.HexСтрокаОтпечаткаСертификата;
//	КонецЕсли;
//	Возврат HexСтрокаОтпечаткаСертификата;
//КонецФункции

//&НаСервере
//Процедура ПодтвердитьПолучениеТоваров(ПриемкаТоваровИСМП,Решение) Экспорт 
//	Если ЗначениеЗаполнено(ПриемкаТоваровИСМП)Тогда 
//		
//		СтруктураЗапроса = Новый Структура;
//		СтруктураЗапроса.Вставить("Организация",ПриемкаТоваровИСМП.Организация); 
//		СтруктураЗапроса.Вставить("HexСтрокаОтпечаткаСертификата","");
//		СтруктураЗапроса.Вставить("Токен","");
//		
//		Если ЗначениеЗаполнено(СтруктураЗапроса.Токен)=Ложь тогда
//			ЗаполнитьТокенНаСервере(СтруктураЗапроса);
//		КонецЕсли;
//		Если ЗначениеЗаполнено(СтруктураЗапроса.Токен)=Ложь тогда
//			ПолучитьТокенНаСервере(СтруктураЗапроса);
//		КонецЕсли;
//		
//		ДокументГИСМТ = ЗапонитьСтруктуруПолучения(ПриемкаТоваровИСМП,Решение);
//		ТипДокумента = "LP_ACCEPT_GOODS";
//		
//		HTTPЗапрос = ПолучитьHTTPЗапросСозданияДокумента(ТипДокумента, ДокументГИСМТ, СтруктураЗапроса);
//		
//		СоединениеHTTP = ПолучитьHTTPСоединение();
//		
//		HTTPОтвет = СоединениеHTTP.ОтправитьДляОбработки(HTTPЗапрос);	
//		
//		Если HTTPОтвет.КодСостояния <> 200 и HTTPОтвет.КодСостояния <> 201 Тогда
//			Сообщить(HTTPОтвет.КодСостояния);
//			Сообщить(HTTPОтвет.ПолучитьТелоКакСтроку());
//			
//			ЗаписьJSON = Новый ЗаписьJSON;
//			ЗаписьJSON.УстановитьСтроку(Новый ПараметрыЗаписиJSON(, Символы.Таб));
//			ЗаписатьJSON(ЗаписьJSON, ДокументГИСМТ);
//			ДокументJSON = ЗаписьJSON.Закрыть();
//		ИначеЕсли HTTPОтвет.КодСостояния = 201 тогда
//			ДокПриемкаТоваровИСМП = ПриемкаТоваровИСМП.ПолучитьОбъект();
//			ДокПриемкаТоваровИСМП.ДатаПриемки = НачалоДня(ТекущаяДата());
//			ДокПриемкаТоваровИСМП.СтатусДокумента = ?(Решение=Истина,Перечисления.СтатусыДокументовИСМП.Принят,Перечисления.СтатусыДокументовИСМП.Отменен);
//			ДокПриемкаТоваровИСМП.Записать();
//		КонецЕсли;
//		
//	КонецЕсли;
//	
//КонецПроцедуры

//&НаСервере
//Процедура ПодтвердитьПолучениеТоваровЭДОЛайт(ПриемкаТоваровИСМП,Решение) Экспорт 
//	ПутьТП_XML = СформироватьXMLТитулПокупателя(ПриемкаТоваровИСМП,Решение);
//	Сформировать_BAT_SIG(ПриемкаТоваровИСМП,ПутьТП_XML);
//	СформироватьSIG(ПутьТП_XML);
//	ОтправитьXML_в_ЭДО_Лайт(ПриемкаТоваровИСМП,ПутьТП_XML,Решение);
//КонецПроцедуры

//&НаСервере
//Функция СформироватьXMLТитулПокупателя(Док_ПриемкаТоваровИСМП,РезультатПриёма)
//	
//	КТФ = КаталогВременныхФайлов();
//	
//	ГУИД_ЧЗ_ДокументаПоставщика = Док_ПриемкаТоваровИСМП.ГУИДДокумента;
//	
//	СтруктураЗапроса = Новый Структура;
//	СтруктураЗапроса.Вставить("Организация",Док_ПриемкаТоваровИСМП.Организация);
//	СтруктураЗапроса.Вставить("HexСтрокаОтпечаткаСертификата","");
//	СтруктураЗапроса.Вставить("Токен","");
//	Если ЗначениеЗаполнено(СтруктураЗапроса.Токен)=Ложь тогда
//		ЗаполнитьТокенНаСервере(СтруктураЗапроса);
//	КонецЕсли;
//	Если ЗначениеЗаполнено(СтруктураЗапроса.Токен)=Ложь тогда
//		ПолучитьТокенНаСервере(СтруктураЗапроса);
//	КонецЕсли;
//	
//	СоединениеHTTP = Новый HTTPСоединение("int.edo.crpt.tech", 443,,,,, Новый ЗащищенноеСоединениеOpenSSL);
//	HTTPЗапрос = новый HTTPЗапрос("/api/v1/incoming-documents/"+ГУИД_ЧЗ_ДокументаПоставщика+"/events/112");
//	HTTPЗапрос.Заголовки.Вставить("Authorization"	, "Bearer " + СтруктураЗапроса.Токен);
//	HTTPОтвет = СоединениеHTTP.Получить(HTTPЗапрос);
//	ОтветJSON = ПолучитьДанныеJSON(HTTPОтвет.ПолучитьТелоКакСтроку());
//	event_id = ОтветJSON.items[0].key.event_id;
//	document_id = ОтветJSON.items[0].key.document_id;
//	
//	HTTPЗапрос = новый HTTPЗапрос("/api/v1/incoming-documents/"+document_id+"/events/"+event_id+"/content");
//	HTTPЗапрос.Заголовки.Вставить("Authorization"	, "Bearer " + СтруктураЗапроса.Токен);
//	HTTPОтвет = СоединениеHTTP.Получить(HTTPЗапрос);
//	ОтветXML112  = ПолучитьДанныеXML(HTTPОтвет.ПолучитьТелоКакСтроку("windows-1251"));
//	
//	HTTPЗапрос = новый HTTPЗапрос("/api/v1/incoming-documents/"+ГУИД_ЧЗ_ДокументаПоставщика+"/content");
//	HTTPЗапрос.Заголовки.Вставить("Authorization"	, "Bearer " + СтруктураЗапроса.Токен);
//	HTTPОтвет = СоединениеHTTP.Получить(HTTPЗапрос);
//	ОтветXML0 = ПолучитьДанныеXML(HTTPОтвет.ПолучитьТелоКакСтроку("windows-1251"));
//	
//	ГУИД_Док = Новый УникальныйИдентификатор;
//	
//	ИдФайл="ON_NSCHFDOPPOKMARK_"+ОтветXML112.Документ.СвОтпрДок.ИдУчастЭДО+"_"+ОтветXML112.Документ.СвПолДок.ИдУчастЭДО+"_"+Формат(ТекущаяДата(),"ДФ=yyyyMMdd")+"_"+Строка(ГУИД_Док);
//	
//	ТП_XML = Новый ЗаписьXML;
//	ПараметрыЗаписиXML = Новый ПараметрыЗаписиXML("windows-1251", "1.0", Ложь); 
//	ПутьТП_XML = КТФ+ИдФайл+".xml";      
//	ТП_XML.ОткрытьФайл(ПутьТП_XML, ПараметрыЗаписиXML); 
//	ТП_XML.ЗаписатьОбъявлениеXML(); 
//	ТП_XML.ЗаписатьБезОбработки(Символы.ПС);
//	ТП_XML.ЗаписатьНачалоЭлемента("Файл"); 
//	ТП_XML.ЗаписатьАтрибут("ИдФайл", ИдФайл); 
//	ТП_XML.ЗаписатьАтрибут("ВерсФорм", "5.01"); 
//	ТП_XML.ЗаписатьАтрибут("ВерсПрог", "EDOLite 1.0"); 
//	ТП_XML.ЗаписатьБезОбработки(Символы.ПС);
//	ТП_XML.ЗаписатьБезОбработки(Символы.Таб);
//	ТП_XML.ЗаписатьНачалоЭлемента("СвУчДокОбор"); 
//	ТП_XML.ЗаписатьАтрибут("ИдОтпр", ОтветXML112.Документ.СвПолДок.ИдУчастЭДО); 
//	ТП_XML.ЗаписатьАтрибут("ИдПол", ОтветXML112.Документ.СвОтпрДок.ИдУчастЭДО); 
//	ТП_XML.ЗаписатьБезОбработки(Символы.ПС);
//	ТП_XML.ЗаписатьБезОбработки(Символы.Таб+Символы.Таб);
//	ТП_XML.ЗаписатьНачалоЭлемента("СвОЭДОтпр"); 
//	ТП_XML.ЗаписатьАтрибут("НаимОрг", ОтветXML112.Документ.ОперЭДО.НаимОрг);//СтрЗаменить(ОтветXML112.Документ.ОперЭДО.НаимОрг,"""","&quot;") 
//	ТП_XML.ЗаписатьАтрибут("ИННЮЛ", ОтветXML112.Документ.ОперЭДО.ИННЮЛ); 
//	ТП_XML.ЗаписатьАтрибут("ИдЭДО", ОтветXML112.Документ.ОперЭДО.ИдОперЭДО); 
//	ТП_XML.ЗаписатьКонецЭлемента();//СвОЭДОтпр 
//	ТП_XML.ЗаписатьБезОбработки(Символы.ПС);
//	ТП_XML.ЗаписатьБезОбработки(Символы.Таб);
//	ТП_XML.ЗаписатьКонецЭлемента();//СвУчДокОбор 
//	ТП_XML.ЗаписатьБезОбработки(Символы.ПС);
//	ТП_XML.ЗаписатьБезОбработки(Символы.Таб);
//	ТП_XML.ЗаписатьНачалоЭлемента("ИнфПок"); 
//	ТП_XML.ЗаписатьАтрибут("КНД", "1115132"); 
//	ТП_XML.ЗаписатьАтрибут("ДатаИнфПок", Формат(ТекущаяДата(),"ДФ=dd.MM.yyyy")); 
//	ТП_XML.ЗаписатьАтрибут("ВремИнфПок", Формат(ТекущаяДата(),"ДФ=hh.mm.ss")); 
//	ТП_XML.ЗаписатьАтрибут("НаимЭконСубСост", ОтветXML112.Документ.СвПолДок.ОтпрЮЛ.НаимОрг+", ИНН: "+ОтветXML112.Документ.СвПолДок.ОтпрЮЛ.ИННЮЛ); 
//	ТП_XML.ЗаписатьБезОбработки(Символы.ПС);
//	ТП_XML.ЗаписатьБезОбработки(Символы.Таб+Символы.Таб);
//	ТП_XML.ЗаписатьНачалоЭлемента("ИдИнфПрод"); 
//	ТП_XML.ЗаписатьАтрибут("ИдФайлИнфПр", ОтветXML112.Документ.СведПодтв.СведОтпрФайл.ИмяПостФайла); 
//	ТП_XML.ЗаписатьАтрибут("ДатаФайлИнфПр", ОтветXML112.Документ.СведПодтв.ДатаОтпр); 
//	ТП_XML.ЗаписатьАтрибут("ВремФайлИнфПр", ОтветXML112.Документ.СведПодтв.ВремяОтпр); 
//	ТП_XML.ЗаписатьБезОбработки(Символы.ПС);
//	ТП_XML.ЗаписатьБезОбработки(Символы.Таб+Символы.Таб+Символы.Таб);
//	ТП_XML.ЗаписатьНачалоЭлемента("ЭП"); 
//	ТП_XML.ЗаписатьТекст(ОтветXML112.Документ.СведПодтв.СведОтпрФайл.ЭЦППолФайл); 
//	ТП_XML.ЗаписатьКонецЭлемента();//ЭП 
//	ТП_XML.ЗаписатьБезОбработки(Символы.ПС);
//	ТП_XML.ЗаписатьБезОбработки(Символы.Таб+Символы.Таб);
//	ТП_XML.ЗаписатьКонецЭлемента();//ИдИнфПрод 
//	ТП_XML.ЗаписатьБезОбработки(Символы.ПС);
//	ТП_XML.ЗаписатьБезОбработки(Символы.Таб+Символы.Таб);
//	ТП_XML.ЗаписатьНачалоЭлемента("СодФХЖ4"); 
//	ТП_XML.ЗаписатьАтрибут("НаимДокОпрПр", ОтветXML0.Документ.НаимДокОпр); 
//	ТП_XML.ЗаписатьАтрибут("Функция", ОтветXML0.Документ.Функция); 
//	ТП_XML.ЗаписатьАтрибут("НомСчФИнфПр", ОтветXML0.Документ.СвСчФакт.НомерСчФ); 
//	ТП_XML.ЗаписатьАтрибут("ДатаСчФИнфПр", ОтветXML0.Документ.СвСчФакт.ДатаСчФ); 
//	ТП_XML.ЗаписатьБезОбработки(Символы.ПС);
//	ТП_XML.ЗаписатьБезОбработки(Символы.Таб+Символы.Таб+Символы.Таб);
//	ТП_XML.ЗаписатьНачалоЭлемента("СвПрин"); 
//	ТП_XML.ЗаписатьБезОбработки(Символы.ПС);
//	ТП_XML.ЗаписатьБезОбработки(Символы.Таб+Символы.Таб+Символы.Таб+Символы.Таб);
//	ТП_XML.ЗаписатьНачалоЭлемента("КодСодОпер"); 
//	ТП_XML.ЗаписатьАтрибут("КодИтога",?(РезультатПриёма=Истина,"1","3")); // 1 - принято всё, 3 - не принято всё, 2 - принято с изменениями, не используй!
//	ТП_XML.ЗаписатьКонецЭлемента();//КодСодОпер 
//	ТП_XML.ЗаписатьБезОбработки(Символы.ПС);
//	ТП_XML.ЗаписатьБезОбработки(Символы.Таб+Символы.Таб+Символы.Таб);
//	ТП_XML.ЗаписатьКонецЭлемента();//СвПрин 
//	ТП_XML.ЗаписатьБезОбработки(Символы.ПС);
//	ТП_XML.ЗаписатьБезОбработки(Символы.Таб+Символы.Таб);
//	ТП_XML.ЗаписатьКонецЭлемента();//СодФХЖ4 
//	ТП_XML.ЗаписатьБезОбработки(Символы.ПС);
//	ТП_XML.ЗаписатьБезОбработки(Символы.Таб+Символы.Таб);
//	ТП_XML.ЗаписатьНачалоЭлемента("Подписант"); 
//	ТП_XML.ЗаписатьАтрибут("ОблПолн", "2"); 
//	ТП_XML.ЗаписатьАтрибут("Статус", "5"); 
//	ТП_XML.ЗаписатьАтрибут("ОснПолн", "Должностные обязанности"); 
//	ТП_XML.ЗаписатьБезОбработки(Символы.ПС);
//	ТП_XML.ЗаписатьБезОбработки(Символы.Таб+Символы.Таб+Символы.Таб);
//	ТП_XML.ЗаписатьНачалоЭлемента("ЮЛ"); 
//	ТП_XML.ЗаписатьАтрибут("ИННЮЛ", ОтветXML112.Документ.СвПолДок.ОтпрЮЛ.ИННЮЛ); 
//	
//	МенеджерКриптографии = Новый МенеджерКриптографии("", "", 80);
//	Хранилище = МенеджерКриптографии.ПолучитьХранилищеСертификатов(ТипХранилищаСертификатовКриптографии.ПерсональныеСертификаты);
//	СертификатыХранилища = Хранилище.ПолучитьВсе();
//	Для Каждого ТекСертификат Из СертификатыХранилища Цикл
//		HexСтрокаОтпечаткаСертификата  = ПолучитьHexСтрокуИзДвоичныхДанных(ТекСертификат.Отпечаток);
//		Если HexСтрокаОтпечаткаСертификата = СтруктураЗапроса.HexСтрокаОтпечаткаСертификата Тогда 
//			Должность = ТекСертификат.Субъект.OID2_5_4_12;
//			Фамилия = ТекСертификат.Субъект.OID2_5_4_4;
//			Имя = СтрРазделить(ТекСертификат.Субъект.OID2_5_4_42," ")[0];
//			Отчество = СтрРазделить(ТекСертификат.Субъект.OID2_5_4_42," ")[1];
//			Прервать;
//		КонецЕсли;
//	КонецЦикла;
//	
//	ТП_XML.ЗаписатьАтрибут("Должн", Должность); 
//	ТП_XML.ЗаписатьБезОбработки(Символы.ПС);
//	ТП_XML.ЗаписатьБезОбработки(Символы.Таб+Символы.Таб+Символы.Таб+Символы.Таб);
//	ТП_XML.ЗаписатьНачалоЭлемента("ФИО"); 
//	ТП_XML.ЗаписатьАтрибут("Фамилия", Фамилия); 
//	ТП_XML.ЗаписатьАтрибут("Имя", Имя); 
//	ТП_XML.ЗаписатьАтрибут("Отчество", Отчество); 
//	ТП_XML.ЗаписатьКонецЭлемента();//ФИО 
//	ТП_XML.ЗаписатьБезОбработки(Символы.ПС);
//	ТП_XML.ЗаписатьБезОбработки(Символы.Таб+Символы.Таб+Символы.Таб);
//	ТП_XML.ЗаписатьКонецЭлемента();//ЮЛ 
//	ТП_XML.ЗаписатьБезОбработки(Символы.ПС);
//	ТП_XML.ЗаписатьБезОбработки(Символы.Таб+Символы.Таб);
//	ТП_XML.ЗаписатьКонецЭлемента();//Подписант 
//	ТП_XML.ЗаписатьБезОбработки(Символы.ПС);
//	ТП_XML.ЗаписатьБезОбработки(Символы.Таб);
//	ТП_XML.ЗаписатьКонецЭлемента();//ИнфПок 
//	ТП_XML.ЗаписатьБезОбработки(Символы.ПС);
//	ТП_XML.ЗаписатьКонецЭлемента();//Файл 
//	ТП_XML.Закрыть();          
//	
//	Возврат ПутьТП_XML;
//КонецФункции

//&НаСервере
//Функция Сформировать_BAT_SIG(Док_ПриемкаТоваровИСМП,ПутьТП_XML)
//	
//	КТФ = КаталогВременныхФайлов();
//	
//	СтруктураЗапроса = Новый Структура;
//	СтруктураЗапроса.Вставить("Организация",Док_ПриемкаТоваровИСМП.Организация);
//	СтруктураЗапроса.Вставить("HexСтрокаОтпечаткаСертификата","");
//	СтруктураЗапроса.Вставить("Токен","");
//	Если ЗначениеЗаполнено(СтруктураЗапроса.Токен)=Ложь тогда
//		ЗаполнитьТокенНаСервере(СтруктураЗапроса);
//	КонецЕсли;
//	
//	ЧтениеXML = новый ЧтениеТекста;
//	ЧтениеXML.Открыть(ПутьТП_XML);
//	ТелоДокумента = ЧтениеXML.Прочитать();
//	
//	КодКавычки = КодСимвола("""");
//	СКав = Символ(34);
//	
//	ТелоДокументаДД		 = ПолучитьДвоичныеДанныеИзСтроки(ТелоДокумента);
//	ТелоДокументаBase64	 = Base64Строка(ТелоДокументаДД);
//	ТелоДокументаBase64	 = ОтформатироватьСтрокуBase64(ТелоДокументаBase64);
//	
//	ПописьBase64 = ПодписатьЭЦП(ТелоДокументаBase64, Неопределено, Истина, СтруктураЗапроса);
//	ПописьBase64 = ОтформатироватьСтрокуBase64(ПописьBase64); 
//	
//	Отпечаток = ЗаполнитьHexСтрокаОтпечаткаСертификата(СтруктураЗапроса);
//	
//	ФайлBat = новый ТекстовыйДокумент;
//	ФайлBat.Очистить();
//	ФайлBat.ДобавитьСтроку(СКав+"C:\Program Files (x86)\Crypto Pro\CSP\csptest.exe"+СКав+" -sfsign -sign -detached -in "+ ПутьТП_XML + " -out " + ПутьТП_XML +".sig" + " -my " + Отпечаток + " -base64 -add");
//	ФайлBat.Записать(ПутьТП_XML+"_SIG.bat", КодировкаТекста.ANSI);
//	
//КонецФункции

//&НаСервере
//Функция СформироватьSIG(ПутьТП_XML)
//	
//	КТФ = КаталогВременныхФайлов();
//	
//	ЗапуститьПриложение(ПутьТП_XML+"_SIG.bat",,Истина);
//КонецФункции

//&НаСервере
//Функция ОтправитьXML_в_ЭДО_Лайт(Док_ПриемкаТоваровИСМП,ПутьТП_XML,Решение)
//	
//	КТФ = КаталогВременныхФайлов();
//	
//	СтруктураЗапроса = Новый Структура;
//	СтруктураЗапроса.Вставить("Организация",Док_ПриемкаТоваровИСМП.Организация);
//	СтруктураЗапроса.Вставить("HexСтрокаОтпечаткаСертификата","");
//	СтруктураЗапроса.Вставить("Токен","");
//	Если ЗначениеЗаполнено(СтруктураЗапроса.Токен)=Ложь тогда
//		ЗаполнитьТокенНаСервере(СтруктураЗапроса);
//	КонецЕсли;
//	
//	ГУИД_ЧЗ_ДокументаПоставщика = Док_ПриемкаТоваровИСМП.ГУИДДокумента;
//	
//	СКав = Символ(34);
//	
//	ФайлПодписи = новый ТекстовыйДокумент;
//	ФайлПодписи.Прочитать(ПутьТП_XML +".sig");
//	ТелоПодписи = УбратьСимволы1013(ФайлПодписи.ПолучитьТекст());
//	
//	cURLСтрока = "c:\temp\curl\curl -o "+КТФ+"log_curl.txt -L -X POST "+ СКав + "https://int.edo.crpt.tech/api/v1/incoming-documents/xml/upd/title"+""""+" \ -H "+СКав+"Authorization: Bearer ";
//	cURLСтрока = cURLСтрока + СтруктураЗапроса.Токен; 
//	cURLСтрока = cURLСтрока +  СКав +" \ -F "+СКав+"doc_id="+СКав+ГУИД_ЧЗ_ДокументаПоставщика+СКав+СКав+" \ -F "+СКав+"signature="+СКав+ТелоПодписи+СКав+СКав+"  \ -F "+СКав+"content=@"+СКав+ПутьТП_XML+СКав+СКав;
//	ЗапуститьПриложение(cURLСтрока);
//	
//	ЧтениеЛОГ = новый ЧтениеТекста;
//	ЧтениеЛОГ.Открыть(КТФ+"log_curl.txt","UTF-8");
//	ОтветИзЭДО  = ПолучитьДанныеJSON(ЧтениеЛОГ.Прочитать());
//	Если ОтветИзЭДО.свойство("errors") тогда
//		Для Каждого СтрОшибка из ОтветИзЭДО.errors цикл
//			Сообщить("Ошибка: "+СтрОшибка.error_message);
//		КонецЦикла;
//	ИначеЕсли ОтветИзЭДО.свойство("id") тогда
//		ДокПриемкаТоваровИСМП = Док_ПриемкаТоваровИСМП.ПолучитьОбъект();
//		ДокПриемкаТоваровИСМП.ДатаПриемки = НачалоДня(ТекущаяДата());
//		ДокПриемкаТоваровИСМП.СтатусДокумента = ?(Решение=Истина,Перечисления.СтатусыДокументовИСМП.Принят,Перечисления.СтатусыДокументовИСМП.Отменен);
//		ДокПриемкаТоваровИСМП.Записать();
//	КонецЕсли;
//КонецФункции

&НаСервере
Функция УбратьСимволы1013(Строка)
	Возврат СтрЗаменить(СтрЗаменить(Строка, Символы.ПС, ""), Символы.ВК, ""); // Ещё бывают символы "77u/", при необходимости удалять и их.
КонецФункции

&НаСервере
Функция ПолучитьДанныеJSON(Парам)
	
	ЧтениеJSON = Новый ЧтениеJSON; 
	ЧтениеJSON.УстановитьСтроку(Парам);
	ДанныеJSON = ПрочитатьJSON(ЧтениеJSON);
	ЧтениеJSON.Закрыть();
	
	Возврат ДанныеJSON;
	
КонецФункции

&НаСервере
Функция ПолучитьДанныеXML(Парам)
	ЧтениеXML = Новый ЧтениеXML;
	ЧтениеXML.УстановитьСтроку(Парам);
	Фабрика=Новый ФабрикаXDTO;
	ОбXDTO=Фабрика.ПрочитатьXML(ЧтениеXML);
	Возврат ОбXDTO;
КонецФункции

&НаСервере
Функция ЗапонитьСтруктуруПолучения(ПриемкаТоваровИСМП,Решение)
	ДокПриемкаТоваровИСМП = ПриемкаТоваровИСМП;
	
	СтруктураОтвет = Новый Структура;
	СтруктураОтвет.Вставить("release_order_number",ДокПриемкаТоваровИСМП.ГУИДДокумента);
	СтруктураОтвет.Вставить("document_number",ДокПриемкаТоваровИСМП.НомерПервичногоДокумента);
	СтруктураОтвет.Вставить("document_date",Формат(ДокПриемкаТоваровИСМП.ДатаПервичногоДокумента,"ДФ=yyyy-MM-ddTHH:mm:ssZ"));
	СтруктураОтвет.Вставить("transfer_date",Формат(ДокПриемкаТоваровИСМП.ДатаОтгрузки,"ДФ=yyyy-MM-ddTHH:mm:ssZ"));
	СтруктураОтвет.Вставить("acceptance_date",Формат(НачалоДня(ТекущаяДата()),"ДФ=yyyy-MM-ddTHH:mm:ssZ"));
	СтруктураОтвет.Вставить("trade_sender_inn",ДокПриемкаТоваровИСМП.ИННОтправителя);
	СтруктураОтвет.Вставить("trade_recipient_inn",ДокПриемкаТоваровИСМП.Организация.ИНН);
	СтруктураОтвет.Вставить("turnover_type","SELLING");
	Если Решение = Истина тогда
		СтруктураОтвет.Вставить("accept_all","true");
	ИначеЕсли Решение = Ложь тогда
		СтруктураОтвет.Вставить("reject_all","true");
	КонецЕсли;
	
	Возврат СтруктураОтвет;
КонецФункции

//&НаСервере
//Функция ПолучитьHTTPЗапросСозданияДокумента(ТипДокумента, ДанныеДокумента,СтруктураЗапроса) 
//	//Код имени Романа Вениаминовича #ГИСМТ #Честный_Знак
//	
//	Если ТипЗнч(ДанныеДокумента) = Тип("Структура") Тогда
//		
//		ЗаписьJSON = Новый ЗаписьJSON;
//		ЗаписьJSON.УстановитьСтроку(Новый ПараметрыЗаписиJSON(, Символы.Таб));
//		ЗаписатьJSON(ЗаписьJSON, ДанныеДокумента);
//		ТелоДокумента = ЗаписьJSON.Закрыть();
//		
//	ИначеЕсли ТипЗнч(ДанныеДокумента) = Тип("Строка") Тогда
//		ТелоДокумента = ДанныеДокумента
//	КонецЕсли;
//	
//	ТелоДокументаДД		 = ПолучитьДвоичныеДанныеИзСтроки(ТелоДокумента);
//	ТелоДокументаBase64	 = Base64Строка(ТелоДокументаДД);
//	ТелоДокументаBase64	 = ОтформатироватьСтрокуBase64(ТелоДокументаBase64);
//	
//	ПописьBase64 = ПодписатьЭЦП(ТелоДокументаBase64, Неопределено, Истина, СтруктураЗапроса);
//	ПописьBase64 = ОтформатироватьСтрокуBase64(ПописьBase64);
//	
//	ДокументГИСМТ = Новый Структура;
//	ДокументГИСМТ.Вставить("document_format"	, "MANUAL");
//	ДокументГИСМТ.Вставить("product_document"	, ТелоДокументаBase64);
//	ДокументГИСМТ.Вставить("type"				, ТипДокумента);
//	ДокументГИСМТ.Вставить("signature"			, ПописьBase64);
//	
//	ЗаписьJSON = Новый ЗаписьJSON;
//	ЗаписьJSON.УстановитьСтроку(Новый ПараметрыЗаписиJSON(, Символы.Таб));
//	ЗаписатьJSON(ЗаписьJSON, ДокументГИСМТ);
//	ДокументГИСМТJSON = ЗаписьJSON.Закрыть();
//	
//	ПреффиксAPI		 = "/api/v3/true-api/";
//	HTTPЗапрос = новый HTTPЗапрос(ПреффиксAPI + "lk/documents/create?pg=tires");
//	HTTPЗапрос.Заголовки.Вставить("Authorization"	, "Bearer " + СтруктураЗапроса.Токен);
//	HTTPЗапрос.Заголовки.Вставить("Content-Type"	, "application/json; charset=UTF-8");
//	HTTPЗапрос.УстановитьТелоИзСтроки(ДокументГИСМТJSON, КодировкаТекста.UTF8, ИспользованиеByteOrderMark.НеИспользовать); 
//	
//	Возврат HTTPЗапрос
//	
//КонецФункции

//&НаСервере
//Функция ОтформатироватьСтрокуBase64(СтрокаBase64)
//	
//	Значение = СтрЗаменить(СтрокаBase64, Символы.ВК, "");
//	Значение = СтрЗаменить(Значение, Символы.ПС, "");
//	
//	Возврат Значение;
//	
//КонецФункции

//&НаСервере
//Процедура ПередатьДанныеОтгрузкиВ_ЧЗ(ОтгрузкаТоваровИСМП) Экспорт
//	СтруктураЗапроса = Новый Структура;
//	СтруктураЗапроса.Вставить("Организация",ОтгрузкаТоваровИСМП.Организация); 
//	СтруктураЗапроса.Вставить("HexСтрокаОтпечаткаСертификата","");
//	СтруктураЗапроса.Вставить("Токен","");
//	
//	Если ЗначениеЗаполнено(СтруктураЗапроса.Токен)=Ложь тогда
//		ЗаполнитьТокенНаСервере(СтруктураЗапроса);
//	КонецЕсли;
//	Если ЗначениеЗаполнено(СтруктураЗапроса.Токен)=Ложь тогда
//		ПолучитьТокенНаСервере(СтруктураЗапроса);
//	КонецЕсли;
//	
//	ДокументГИСМТ = ЗапонитьСтруктуруОтгрузкаТоваров(ОтгрузкаТоваровИСМП);
//	ТипДокумента = "LP_SHIP_GOODS";
//	
//	HTTPЗапрос = ПолучитьHTTPЗапросСозданияДокумента(ТипДокумента, ДокументГИСМТ, СтруктураЗапроса);
//	
//	СоединениеHTTP = ПолучитьHTTPСоединение();
//	
//	HTTPОтвет = СоединениеHTTP.ОтправитьДляОбработки(HTTPЗапрос);	
//	
//	Если HTTPОтвет.КодСостояния <> 200 и HTTPОтвет.КодСостояния <> 201 Тогда
//		Сообщить(HTTPОтвет.КодСостояния);
//		Сообщить(HTTPОтвет.ПолучитьТелоКакСтроку());
//		
//		ЗаписьJSON = Новый ЗаписьJSON;
//		ЗаписьJSON.УстановитьСтроку(Новый ПараметрыЗаписиJSON(, Символы.Таб));
//		ЗаписатьJSON(ЗаписьJSON, ДокументГИСМТ);
//		ДокументJSON = ЗаписьJSON.Закрыть();
//		
//	ИначеЕсли HTTPОтвет.КодСостояния = 201 тогда
//		ГУИД_ЧЗ_Документа = HTTPОтвет.ПолучитьТелоКакСтроку();
//		
//		СтрокаПараметров = "documents/"+ГУИД_ЧЗ_Документа+"/info";
//		HTTPЗапрос = новый HTTPЗапрос("/api/v3/true-api/" + СтрокаПараметров);
//		HTTPЗапрос.Заголовки.Вставить("Authorization"	, "Bearer " + СтруктураЗапроса.Токен);
//		HTTPЗапрос.Заголовки.Вставить("Content-Type"	, "application/json; charset=UTF-8");
//		СоединениеHTTP = ПолучитьHTTPСоединение();
//		HTTPОтвет = СоединениеHTTP.Получить(HTTPЗапрос);	
//		СтрокаJSON = HTTPОтвет.ПолучитьТелоКакСтроку();
//		
//		status = Интеграция.СтатусДокументаИСМП(ПолучитьДанныеJSON(СтрокаJSON).status);
//		Если status = Перечисления.СтатусыДокументовИСМП.ОжидаетсяПодтверждениеПоступления тогда
//			ДокОтгрузкаТоваровИСМП = ОтгрузкаТоваровИСМП.ПолучитьОбъект();
//			ДокОтгрузкаТоваровИСМП.ДатаОтгрузки = НачалоДня(ТекущаяДата());
//			ДокОтгрузкаТоваровИСМП.СтатусДокумента = Интеграция.СтатусДокументаИСМП(ПолучитьДанныеJSON(СтрокаJSON).status);
//			ДокОтгрузкаТоваровИСМП.ГУИДДокумента = HTTPОтвет.ПолучитьТелоКакСтроку();
//			ДокОтгрузкаТоваровИСМП.Записать();
//		КонецЕсли;
//	КонецЕсли;
//	
//	
//КонецПроцедуры

//&НаСервере
//Функция  ЗапонитьСтруктуруОтгрузкаТоваров(ОтгрузкаТоваровИСМП)
//	ДокОтгрузкаТоваровИСМП = ОтгрузкаТоваровИСМП;
//	
//	СтруктураОтвет = Новый Структура;
//	СтруктураОтвет.Вставить("document_num",ДокОтгрузкаТоваровИСМП.НомерПервичногоДокумента);
//	СтруктураОтвет.Вставить("document_date",Формат(ДокОтгрузкаТоваровИСМП.ДатаПервичногоДокумента,"ДФ=yyyy-MM-ddTHH:mm:ssZ"));
//	СтруктураОтвет.Вставить("transfer_date",Формат(ДокОтгрузкаТоваровИСМП.ДатаПервичногоДокумента,"ДФ=yyyy-MM-ddTHH:mm:ssZ"));
//	СтруктураОтвет.Вставить("receiver_inn",ДокОтгрузкаТоваровИСМП.Контрагент.ИНН);
//	СтруктураОтвет.Вставить("sender_inn",ДокОтгрузкаТоваровИСМП.Организация.ИНН);
//	СтруктураОтвет.Вставить("to_not_participant",?(ДокОтгрузкаТоваровИСМП.ОтгрузкаНеучастнику,"true","false"));
//	СтруктураОтвет.Вставить("turnover_type","SELLING");
//	МассивТоваров = Новый Массив;
//	Для Каждого Стр_ШтрихкодыУпаковок из ДокОтгрузкаТоваровИСМП.ШтрихкодыУпаковок Цикл 
//		НовСтрук =  Новый Структура;
//		НовСтрук.Вставить("product_description",Стр_ШтрихкодыУпаковок.Номенклатура.Наименование);
//		НовСтрук.Вставить("uit_code",Стр_ШтрихкодыУпаковок.ЗначениеШтрихкода);
//		МассивТоваров.Добавить(НовСтрук);
//	КонецЦикла;
//	СтруктураОтвет.Вставить("products",МассивТоваров);
//	
//	Возврат СтруктураОтвет;
//КонецФункции

//======================================================================================================================
// ИнфПолФХЖ1 — дополнительные информационные поля факта хозяйственной жизни
//======================================================================================================================

Функция ДопПоляИнфПолФХЖ1Получить(Контрагент) Экспорт
	// Возвращает дополнительные поля ИнфПолФХЖ1, заданные в карточке контрагента (ТЧ "Данные")
	// строками с ИД = "Файл-Документ---ИнфПолФХЖ1" и Значением вида "<Идентиф>=<Значен>",  
	// Возврат: Массив структур с полями "Идентиф" и "Значен". При некорректном аргументе — пустой Массив.

	
	Результат = Новый Массив;

	Доступно = ТипЗнч(Контрагент) = Тип("СправочникСсылка.Контрагенты") И ЗначениеЗаполнено(Контрагент);
	Если Не Доступно Тогда
		Возврат Доступно;
	КонецЕсли;

	Якорь = "Файл-Документ---ИнфПолФХЖ1";
	Для Каждого i Из Контрагент.Данные Цикл
		Если СокрЛП(i.ИД) <> Якорь Тогда
			Продолжить;
		КонецЕсли;

		СтрокаЗначения = СокрЛП(Строка(i.Значение));
		ПозицияРавно = СтрНайти(СтрокаЗначения, "=");
		Если ПозицияРавно = 0 Тогда
			Продолжить;
		КонецЕсли;

		Идентиф = СокрЛП(Лев(СтрокаЗначения, ПозицияРавно - 1));
		Значен  = СокрЛП(Сред(СтрокаЗначения, ПозицияРавно + 1));
		Если Не (ЗначениеЗаполнено(Идентиф) И ЗначениеЗаполнено(Значен)) Тогда
			Продолжить;
		КонецЕсли;

		Результат.Добавить(Новый Структура("Идентиф, Значен", Идентиф, Значен));
	КонецЦикла;

	Возврат Результат;
КонецФункции

Функция ЗаписатьТекстИнфМассив(ЗаписьXML, МассивПарИдентифЗначен)
	// Пишет элементы <ТекстИнф> по переданному массиву пар {Идентиф, Значен}.
	// Например возвращает <ТекстИнф Идентиф="ПризнакОЗ" Значен="ОЗ"/>
	// Возврат "" при успехе / "ошибка: ..." при некорректных аргументах.

	Доступно = ТипЗнч(ЗаписьXML) = Тип("ЗаписьXML") И ТипЗнч(МассивПарИдентифЗначен) = Тип("Массив");
	Если Не Доступно Тогда
		Возврат "ошибка: неверные параметры";
	КонецЕсли;

	Для Каждого i Из МассивПарИдентифЗначен Цикл
		ЗаписьXML.ЗаписатьНачалоЭлемента("ТекстИнф");
		ЗаписьXML.ЗаписатьАтрибут("Идентиф", i.Идентиф);
		ЗаписьXML.ЗаписатьАтрибут("Значен",  i.Значен);
		ЗаписьXML.ЗаписатьКонецЭлемента();
	КонецЦикла;

	Возврат "";
КонецФункции


Функция ЗаписатьИнфПолФХЖ1(ЗаписьXML, Контрагент)
	// Пишет блок <ИнфПолФХЖ1> целиком (открытие/закрытие) с доп.полями контрагента,
	// но только если такие поля заданы. Для генераторов без собственного ИнфПолФХЖ1.
	// Например для Контрагента у которого в табл.части Данные есть строка с Ид: "Файл-Документ---ИнфПолФХЖ1"
	// и Значение: "ПризнакОЗ=ОЗ" получим <ИнфПолФХЖ1><ТекстИнф Идентиф="ПризнакОЗ" Значен="ОЗ"/></ИнфПолФХЖ1>
	// Возврат "" при успехе / "ошибка: ..." при некорректных аргументах.

	Доступно = ТипЗнч(ЗаписьXML) = Тип("ЗаписьXML");
	Если Не Доступно Тогда
		Возврат "ошибка: неверные параметры";
	КонецЕсли;

	МассивДопПолей = ДопПоляИнфПолФХЖ1Получить(Контрагент);
	Если МассивДопПолей.Количество() = 0 Тогда
		Возврат "";
	КонецЕсли;

	ЗаписьXML.ЗаписатьНачалоЭлемента("ИнфПолФХЖ1");
	ЗаписатьТекстИнфМассив(ЗаписьXML, МассивДопПолей);
	ЗаписьXML.ЗаписатьКонецЭлемента();
	Возврат "";
КонецФункции

//======================================================================================================================
// XML для выгрузки в файл
//======================================================================================================================

Функция Реализация_СформироватьXML(ДокВыгрузки) Экспорт
	ЗаписьXML = Новый ЗаписьXML;   
	
	ЗаписьXML.УстановитьСтроку();
	ЗаписьXML.ЗаписатьОбъявлениеXML(); 
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("Документ"); 
	ЗаписьXML.ЗаписатьНачалоЭлемента("ВидОперации"); ЗаписьXML.ЗаписатьТекст("продажа, комиссия");ЗаписьXML.ЗаписатьКонецЭлемента(); 
	ЗаписьXML.ЗаписатьНачалоЭлемента("Номер"); ЗаписьXML.ЗаписатьТекст(ДокВыгрузки.Номер);ЗаписьXML.ЗаписатьКонецЭлемента(); 
	ЗаписьXML.ЗаписатьНачалоЭлемента("НомерСчетФактуры"); ЗаписьXML.ЗаписатьТекст(ДокВыгрузки.НомерСчф);ЗаписьXML.ЗаписатьКонецЭлемента(); 
	ЗаписьXML.ЗаписатьНачалоЭлемента("ДатаСчетФактуры"); ЗаписьXML.ЗаписатьТекст(Формат(ДокВыгрузки.Дата,"ДФ=dd.MM.yy"));ЗаписьXML.ЗаписатьКонецЭлемента(); 
	ЗаписьXML.ЗаписатьНачалоЭлемента("Валюта"); ЗаписьXML.ЗаписатьТекст("руб.");ЗаписьXML.ЗаписатьКонецЭлемента(); 
	ЗаписьXML.ЗаписатьНачалоЭлемента("Курс"); ЗаписьXML.ЗаписатьТекст("1");ЗаписьXML.ЗаписатьКонецЭлемента(); 
	ЗаписьXML.ЗаписатьНачалоЭлемента("УчитыватьНДС"); ЗаписьXML.ЗаписатьТекст(?(НЕ ЗначенияСервера.БезНДС(ДокВыгрузки.Организация,,ДокВыгрузки.Дата,ДокВыгрузки.ТочкаОформления),"Истина","Ложь"));ЗаписьXML.ЗаписатьКонецЭлемента(); 
	ЗаписьXML.ЗаписатьНачалоЭлемента("СуммаВключаетНДС"); ЗаписьXML.ЗаписатьТекст(?(НЕ ЗначенияСервера.БезНДС(ДокВыгрузки.Организация,,ДокВыгрузки.Дата,ДокВыгрузки.ТочкаОформления),"Истина","Ложь"));ЗаписьXML.ЗаписатьКонецЭлемента(); 
	ЗаписьXML.ЗаписатьНачалоЭлемента("СуммаДокумента"); ЗаписьXML.ЗаписатьТекст(Формат(ДокВыгрузки.СуммаДокумента,"ЧГ="));ЗаписьXML.ЗаписатьКонецЭлемента(); 
	ЗаписьXML.ЗаписатьНачалоЭлемента("СуммаНДС"); ЗаписьXML.ЗаписатьТекст(Формат(ДокВыгрузки.Товары.Итог("СуммаНДС"),"ЧГ="));ЗаписьXML.ЗаписатьКонецЭлемента(); 
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("Контрагенты");//Контрагенты 
	ЗаписьXML.ЗаписатьНачалоЭлемента("Контрагент");//Контрагент 
	ЗаписьXML.ЗаписатьНачалоЭлемента("ИНН"); ЗаписьXML.ЗаписатьТекст(ДокВыгрузки.Организация.ИНН);ЗаписьXML.ЗаписатьКонецЭлемента(); 
	ЗаписьXML.ЗаписатьНачалоЭлемента("ПолноеНаименование"); ЗаписьXML.ЗаписатьТекст(ДокВыгрузки.Организация.НаименованиеПолное);ЗаписьXML.ЗаписатьКонецЭлемента(); 
	ЗаписьXML.ЗаписатьНачалоЭлемента("Наименование"); ЗаписьXML.ЗаписатьТекст(ДокВыгрузки.Организация.Наименование);ЗаписьXML.ЗаписатьКонецЭлемента(); 
	ЗаписьXML.ЗаписатьНачалоЭлемента("Роль"); ЗаписьXML.ЗаписатьТекст("Продавец");ЗаписьXML.ЗаписатьКонецЭлемента(); 
	ЗаписьXML.ЗаписатьКонецЭлемента();//Контрагент 
	ЗаписьXML.ЗаписатьНачалоЭлемента("Контрагент");//Контрагент 
	ЗаписьXML.ЗаписатьНачалоЭлемента("ИНН"); ЗаписьXML.ЗаписатьТекст(ДокВыгрузки.Контрагент.ИНН);ЗаписьXML.ЗаписатьКонецЭлемента(); 
	ЗаписьXML.ЗаписатьНачалоЭлемента("ПолноеНаименование"); ЗаписьXML.ЗаписатьТекст(ДокВыгрузки.Контрагент.НаименованиеПолное);ЗаписьXML.ЗаписатьКонецЭлемента(); 
	ЗаписьXML.ЗаписатьНачалоЭлемента("Наименование"); ЗаписьXML.ЗаписатьТекст(ДокВыгрузки.Контрагент.Наименование);ЗаписьXML.ЗаписатьКонецЭлемента(); 
	ЗаписьXML.ЗаписатьНачалоЭлемента("Роль"); ЗаписьXML.ЗаписатьТекст("Покупатель");ЗаписьXML.ЗаписатьКонецЭлемента(); 
	ЗаписьXML.ЗаписатьКонецЭлемента();//Контрагент 
	ЗаписьXML.ЗаписатьКонецЭлемента();//Контрагенты 
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("Товары");//Товары 
	Для Каждого стрТовар из ДокВыгрузки.Товары цикл
		ЗаписьXML.ЗаписатьНачалоЭлемента("Row");//Row 
		ЗаписьXML.ЗаписатьНачалоЭлемента("ЭтоТара"); ЗаписьXML.ЗаписатьТекст("Ложь");ЗаписьXML.ЗаписатьКонецЭлемента(); 
		ЗаписьXML.ЗаписатьНачалоЭлемента("Номенклатура"); ЗаписьXML.ЗаписатьТекст(стрТовар.Номенклатура.Наименование);ЗаписьXML.ЗаписатьКонецЭлемента(); 
		ЗаписьXML.ЗаписатьНачалоЭлемента("КодДЗЧ"); ЗаписьXML.ЗаписатьТекст(стрТовар.Номенклатура.Артикул);ЗаписьXML.ЗаписатьКонецЭлемента(); 
		ЗаписьXML.ЗаписатьНачалоЭлемента("КодСПС"); ЗаписьXML.ЗаписатьТекст(стрТовар.Номенклатура.КодКаталога);ЗаписьXML.ЗаписатьКонецЭлемента(); 
		ЗаписьXML.ЗаписатьНачалоЭлемента("ЕдиницаИзмерения"); ЗаписьXML.ЗаписатьТекст(стрТовар.Номенклатура.ЕдиницаИзмерения.Наименование);ЗаписьXML.ЗаписатьКонецЭлемента(); 
		ЗаписьXML.ЗаписатьНачалоЭлемента("Количество"); ЗаписьXML.ЗаписатьТекст(Формат(стрТовар.Количество,"ЧГ="));ЗаписьXML.ЗаписатьКонецЭлемента(); 
		ЗаписьXML.ЗаписатьНачалоЭлемента("Цена"); ЗаписьXML.ЗаписатьТекст(Формат(стрТовар.Цена,"ЧГ="));ЗаписьXML.ЗаписатьКонецЭлемента(); 
		ЗаписьXML.ЗаписатьНачалоЭлемента("Сумма"); ЗаписьXML.ЗаписатьТекст(Формат(стрТовар.Сумма,"ЧГ="));ЗаписьXML.ЗаписатьКонецЭлемента(); 
		ЗаписьXML.ЗаписатьНачалоЭлемента("СтавкаНДС"); ЗаписьXML.ЗаписатьТекст(стрТовар.СтавкаНДС.Наименование);ЗаписьXML.ЗаписатьКонецЭлемента(); 
		ЗаписьXML.ЗаписатьНачалоЭлемента("СуммаНДС"); ЗаписьXML.ЗаписатьТекст(Формат(стрТовар.СуммаНДС,"ЧГ="));ЗаписьXML.ЗаписатьКонецЭлемента(); 
		ЗаписьXML.ЗаписатьНачалоЭлемента("СуммаСНДС"); ЗаписьXML.ЗаписатьТекст(Формат(стрТовар.Сумма,"ЧГ="));ЗаписьXML.ЗаписатьКонецЭлемента(); 
		ЗаписьXML.ЗаписатьНачалоЭлемента("Покупные"); ЗаписьXML.ЗаписатьТекст("Ложь");ЗаписьXML.ЗаписатьКонецЭлемента(); 
		ЗаписьXML.ЗаписатьНачалоЭлемента("ЕдиницаИзмеренияВеса"); ЗаписьXML.ЗаписатьТекст("кг");ЗаписьXML.ЗаписатьКонецЭлемента(); 
		ЗаписьXML.ЗаписатьНачалоЭлемента("Нетто"); ЗаписьXML.ЗаписатьТекст("0");ЗаписьXML.ЗаписатьКонецЭлемента(); 
		ЗаписьXML.ЗаписатьКонецЭлемента();//Row 
	КонецЦикла;
	
	ЗаписьXML.ЗаписатьКонецЭлемента();//Товары 
	ЗаписьXML.ЗаписатьКонецЭлемента();//Документ
	
	Возврат ЗаписьXML.Закрыть();
КонецФункции 

&НаСервере
Функция Реализация_СформироватьXML_УПД(ДокВыгрузки) Экспорт
	ИдОтпр = "2BK-0000000000-0000000";
	ИдПол = "2BK-0000000000-0000000000000";  
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПрослеживаемыеТовары.Номенклатура КАК Номенклатура,
	|	ПрослеживаемыеТовары.РНПТ КАК РНПТ,
	|	ПрослеживаемыеТовары.Количество КАК Количество,
	|	ПрослеживаемыеТовары.КоличествоПрослеживаемости КАК КоличествоПрослеживаемости,
	|	ПрослеживаемыеТовары.СтранаПроисхождения КАК СтранаПроисхождения
	|ИЗ
	|	РегистрНакопления.ПрослеживаемыеТовары КАК ПрослеживаемыеТовары
	|ГДЕ
	|	ПрослеживаемыеТовары.Регистратор = &Регистратор";
	
	Запрос.УстановитьПараметр("Регистратор", ДокВыгрузки);
	СведенияОПрослеживаемости = Запрос.Выполнить().Выгрузить();
	
	Если СведенияОПрослеживаемости.Количество() > 0 тогда 
		ВыводитьРНПТ = Истина;
	Иначе
		ВыводитьРНПТ = Ложь;	
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
 |	ЗначенияСвойствКонтрагентов.Значение КАК Значение
 |ИЗ
 |	РегистрСведений.ЗначенияСвойствКонтрагентов КАК ЗначенияСвойствКонтрагентов
 |ГДЕ
 |	ЗначенияСвойствКонтрагентов.Контрагент = &Контрагент
 |	И ЗначенияСвойствКонтрагентов.Свойство = &Свойство";
 
   Запрос.УстановитьПараметр("Контрагент", ДокВыгрузки.Контрагент); 
   Запрос.УстановитьПараметр("Свойство", Справочники.ЗначенияСвойствОбъектов.ГрузотправительПрочерк); 
   СвойствоПрочерк = Запрос.Выполнить().Выгрузить();
	
	Если СвойствоПрочерк.Количество() > 0 тогда 
		ВыводитьПрочерк = Истина;
	Иначе
		ВыводитьПрочерк = Ложь;	
	КонецЕсли;

 
 
 
	
	Если (ДокВыгрузки.Контрагент.ТипКонтрагента=Перечисления.ТипКонтрагента.Ип) ИЛИ (ДокВыгрузки.Контрагент.ТипКонтрагента=Перечисления.ТипКонтрагента.Фл ) Тогда
		КонтрИП = Истина;
	КонецЕсли;
	
	Если ТипЗнч(ДокВыгрузки) = Тип("ДокументСсылка.ЗаказНаряд") Тогда 
		ДатаУПД = ДокВыгрузки.ДатаЗакрытия;
	Иначе
		ДатаУПД = ДокВыгрузки.Дата;
	КонецЕсли;
	
	
	
	ОргИП = Ложь;
	БанковскийСчетКонтрагента = ДокВыгрузки.Контрагент.РасчСчет;
	БанковскийСчетФирмы = ДокВыгрузки.Организация.РасчСчет;
	СведенияОПоставщике = ЗначенияСервера.СведенияОЮрФизЛице(ДокВыгрузки.Организация, ДатаУПД);
	СведенияОПокупателе = ЗначенияСервера.СведенияОЮРФизЛице(ДокВыгрузки.Контрагент, ДатаУПД);
	
	Если ДокВыгрузки.Метаданные().Реквизиты.Найти("Получатель")<>Неопределено И ЗначениеЗаполнено(ДокВыгрузки.Получатель) и ТипЗнч(ДокВыгрузки.Получатель) = Тип("СправочникСсылка.Контрагенты") тогда
		СведенияОГрузополучателе  = ЗначенияСервера.СведенияОЮрФизЛице(ДокВыгрузки.Получатель,  ДатаУПД);
		ПолучательПоДокументу = ДокВыгрузки.Получатель;
	Иначе
		СведенияОГрузополучателе  = СведенияОПокупателе;
		ПолучательПоДокументу = ДокВыгрузки.Контрагент;
	КонецЕсли;  
	
	СведенияОГрузоотправитель = СведенияОПоставщике;
	
	НовыйУникальныйИдентификатор = Новый УникальныйИдентификатор;
	ДатаДляИндифик = ТекущаяДата();
	Год   = Строка(Формат(ДатаДляИндифик, "ДФ=гггг")); // Год
	Месяц = Строка(Формат(ДатаДляИндифик, "ДФ=ММ"));   // Месяц
	День  = Строка(Формат(ДатаДляИндифик, "ДФ=дд"));   // День
	
	ДатаПреобразоваянная = Год + Месяц + День;
	
	ЗаписьXML = Новый ЗаписьXML;
	
	ЗаписьXML.УстановитьСтроку();
	ЗаписьXML.ЗаписатьОбъявлениеXML();
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("Файл");
	ЗаписьXML.ЗаписатьСоответствиеПространстваИмен("xsd","http://www.w3.org/2001/XMLSchema");
	ЗаписьXML.ЗаписатьСоответствиеПространстваИмен("xsi","http://www.w3.org/2001/XMLSchema-instance");
	
	ЗаписьXML.ЗаписатьАтрибут("ИдФайл", "ON_NSCHFDOPPR_" + ИдПол + "_" + ИдОтпр + "_" + ДатаПреобразоваянная + "_" + НовыйУникальныйИдентификатор);	
	ЗаписьXML.ЗаписатьАтрибут("ВерсФорм", "5.01");
	ЗаписьXML.ЗаписатьАтрибут("ВерсПрог", "1.0");
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("СвУчДокОбор");
	ЗаписьXML.ЗаписатьАтрибут("ИдОтпр", ИдОтпр);
	ЗаписьXML.ЗаписатьАтрибут("ИдПол", ИдПол);	
	ЗаписьXML.ЗаписатьНачалоЭлемента("СвОЭДОтпр");
	ЗаписьXML.ЗаписатьАтрибут("ИННЮЛ", "7728168971");	
	ЗаписьXML.ЗаписатьАтрибут("ИдЭДО", "2BM");
	ЗаписьXML.ЗаписатьАтрибут("НаимОрг", "АО ""ПФ ""СКБ Контур""");
	
	ЗаписьXML.ЗаписатьКонецЭлемента();
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("Документ");	
	ЗаписьXML.ЗаписатьАтрибут("КНД", "1115131"); 	
	ЗаписьXML.ЗаписатьАтрибут("ПоФактХЖ", "Документ об отгрузке товаров (выполнении работ), передаче имущественных прав (документ об оказании услуг)");
	ЗаписьXML.ЗаписатьАтрибут("НаимДокОпр", "Счет-фактура и документ об отгрузке товаров (выполнении работ), передаче имущественных прав (документ об оказании услуг)");
	ЗаписьXML.ЗаписатьАтрибут("ДатаИнфПр", Формат(ДатаУПД, "ДЛФ=Д"));
	ЗаписьXML.ЗаписатьАтрибут("ВремИнфПр", "00.00.00");
	ЗаписьXML.ЗаписатьАтрибут("НаимЭконСубСост", ДокВыгрузки.Организация.НаименованиеПолное);
	ЗаписьXML.ЗаписатьАтрибут("Функция", "СЧФДОП");
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("СвСчФакт");
	ЗаписьXML.ЗаписатьАтрибут("НомерСчФ", ?(ЗначениеЗаполнено(ДокВыгрузки.НомерСчф),ДокВыгрузки.НомерСчф,ДокВыгрузки.Номер));
	Если ТипЗнч(ДокВыгрузки) = Тип("ДокументСсылка.ЗаказНаряд") Тогда 
		ЗаписьXML.ЗаписатьАтрибут("ДатаСчФ", Формат(ДокВыгрузки.ДатаЗакрытия, "ДЛФ=Д"));
	Иначе
		ЗаписьXML.ЗаписатьАтрибут("ДатаСчФ", Формат(ДокВыгрузки.Дата, "ДЛФ=Д"));
	КонецЕсли;
	ЗаписьXML.ЗаписатьАтрибут("КодОКВ", "643");
	
	//Продавец
	ЗаписьXML.ЗаписатьНачалоЭлемента("СвПрод");
	ЗаписьXML.ЗаписатьНачалоЭлемента("ИдСв");
	ЗаписьXML.ЗаписатьНачалоЭлемента("СвЮЛУч");  
	ЗаписьXML.ЗаписатьАтрибут("КПП", ДокВыгрузки.Организация.КПП);
	ЗаписьXML.ЗаписатьАтрибут("НаимОрг", ДокВыгрузки.Организация.НаименованиеПолное);
	ЗаписьXML.ЗаписатьАтрибут("ИННЮЛ", ДокВыгрузки.Организация.ИНН);
	ЗаписьXML.ЗаписатьКонецЭлемента();
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("Адрес");
	ЗаписьXML.ЗаписатьНачалоЭлемента("АдрРФ");
	
	Если ЗначениеЗаполнено(СведенияОПоставщике.ЮридическийАдрес.postal_code) Тогда
		ЗаписьXML.ЗаписатьАтрибут("Индекс", СокрЛП(СведенияОПоставщике.ЮридическийАдрес.postal_code));
	КонецЕсли;
	Если ДокВыгрузки.Организация.Страна.ЭтоСтрана=Ложь тогда
		Если Лев(СокрЛП(ДокВыгрузки.Организация.Страна.Код),1)= "0" тогда
			ЗаписьXML.ЗаписатьАтрибут("КодРегион",Сред(СокрЛП(ДокВыгрузки.Организация.Страна.Код),2));	
		Иначе	
			ЗаписьXML.ЗаписатьАтрибут("КодРегион",СокрЛП(ДокВыгрузки.Организация.Страна.Код));
		КонецЕсли;	
	Иначе 	
		ЗаписьXML.ЗаписатьАтрибут("КодРегион",СокрЛП(ДокВыгрузки.Организация.Страна.КодОКСМ));	
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СведенияОПоставщике.ЮридическийАдрес.city_district_with_type) Тогда
		ЗаписьXML.ЗаписатьАтрибут("Район",СокрЛП(СведенияОПоставщике.ЮридическийАдрес.city_district_with_type));
	КонецЕсли;
	Если ЗначениеЗаполнено(СведенияОПоставщике.ЮридическийАдрес.city_with_type) Тогда
		ЗаписьXML.ЗаписатьАтрибут("Город", СокрЛП(СведенияОПоставщике.ЮридическийАдрес.city_with_type));
	КонецЕсли;
	Если ЗначениеЗаполнено(СведенияОПоставщике.ЮридическийАдрес.settlement_with_type) Тогда
		ЗаписьXML.ЗаписатьАтрибут("НаселПункт", СокрЛП(СведенияОПоставщике.ЮридическийАдрес.settlement_with_type));
	КонецЕсли;
	Если ЗначениеЗаполнено(СведенияОПоставщике.ЮридическийАдрес.street_with_type) Тогда
		ЗаписьXML.ЗаписатьАтрибут("Улица", СокрЛП(СведенияОПоставщике.ЮридическийАдрес.street_with_type));
	КонецЕсли;
	Если ЗначениеЗаполнено(СведенияОПоставщике.ЮридическийАдрес.house) Тогда
		ЗаписьXML.ЗаписатьАтрибут("Дом", СокрЛП(СведенияОПоставщике.ЮридическийАдрес.house));
	КонецЕсли;
	Если ЗначениеЗаполнено(СведенияОПоставщике.ЮридическийАдрес.flat) Тогда
		ЗаписьXML.ЗаписатьАтрибут("Кварт", СокрЛП(СведенияОПоставщике.ЮридическийАдрес.flat));
	КонецЕсли;
	
	ЗаписьXML.ЗаписатьКонецЭлемента();
	ЗаписьXML.ЗаписатьКонецЭлемента();
	Если ЗначениеЗаполнено(СведенияОПоставщике.НомерСчета) Тогда 
		ЗаписьXML.ЗаписатьНачалоЭлемента("БанкРекв");
		ЗаписьXML.ЗаписатьАтрибут("НомерСчета", Строка(СведенияОПоставщике.НомерСчета));
		ЗаписьXML.ЗаписатьНачалоЭлемента("СвБанк");
		ЗаписьXML.ЗаписатьАтрибут("НаимБанк", СведенияОПоставщике.Банк.Наименование);
		ЗаписьXML.ЗаписатьАтрибут("КорСчет", Строка(СведенияОПоставщике.КоррСчет));
		ЗаписьXML.ЗаписатьАтрибут("БИК", Строка(СведенияОПоставщике.БИК));
		ЗаписьXML.ЗаписатьКонецЭлемента();
		ЗаписьXML.ЗаписатьКонецЭлемента();
	КонецЕсли; 	
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	//Продавец	
	
	//ГрузОтпр
	ЗаписьXML.ЗаписатьНачалоЭлемента("ГрузОт");
	ЗаписьXML.ЗаписатьНачалоЭлемента("ГрузОтпр");
	ЗаписьXML.ЗаписатьНачалоЭлемента("ИдСв");
	ЗаписьXML.ЗаписатьНачалоЭлемента("СвЮЛУч");  
	ЗаписьXML.ЗаписатьАтрибут("КПП", ДокВыгрузки.Организация.КПП);
	ЗаписьXML.ЗаписатьАтрибут("НаимОрг", ДокВыгрузки.Организация.НаименованиеПолное);
	ЗаписьXML.ЗаписатьАтрибут("ИННЮЛ", ДокВыгрузки.Организация.ИНН);
	ЗаписьXML.ЗаписатьКонецЭлемента();
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("Адрес");
	ЗаписьXML.ЗаписатьНачалоЭлемента("АдрРФ");
	//Если ДокВыгрузки.Метаданные().Имя <> "ЗаказНаряд" Тогда       
	Если НЕ ВыводитьПрочерк Тогда
	Если ЗначениеЗаполнено(СведенияОПоставщике.ЮридическийАдрес.postal_code) Тогда
			ЗаписьXML.ЗаписатьАтрибут("Индекс", СокрЛП(СведенияОПоставщике.ЮридическийАдрес.postal_code));
		КонецЕсли;
		Если ДокВыгрузки.Организация.Страна.ЭтоСтрана=Ложь тогда
			Если Лев(СокрЛП(ДокВыгрузки.Организация.Страна.Код),1)= "0" тогда
				ЗаписьXML.ЗаписатьАтрибут("КодРегион",Сред(СокрЛП(ДокВыгрузки.Организация.Страна.Код),2));	
			Иначе	
				ЗаписьXML.ЗаписатьАтрибут("КодРегион",СокрЛП(ДокВыгрузки.Организация.Страна.Код));
			КонецЕсли;	
		Иначе 	
			ЗаписьXML.ЗаписатьАтрибут("КодРегион",СокрЛП(ДокВыгрузки.Организация.Страна.КодОКСМ));	
		КонецЕсли;
		Если ЗначениеЗаполнено(СведенияОПоставщике.ЮридическийАдрес.city_district_with_type) Тогда
			ЗаписьXML.ЗаписатьАтрибут("Район",СокрЛП(СведенияОПоставщике.ЮридическийАдрес.city_district_with_type));
		КонецЕсли;
		Если ЗначениеЗаполнено(СведенияОПоставщике.ЮридическийАдрес.city_with_type) Тогда
			ЗаписьXML.ЗаписатьАтрибут("Город", СокрЛП(СведенияОПоставщике.ЮридическийАдрес.city_with_type));
		КонецЕсли;
		Если ЗначениеЗаполнено(СведенияОПоставщике.ЮридическийАдрес.settlement_with_type) Тогда
			ЗаписьXML.ЗаписатьАтрибут("НаселПункт", СокрЛП(СведенияОПоставщике.ЮридическийАдрес.settlement_with_type));
		КонецЕсли;
		Если ЗначениеЗаполнено(СведенияОПоставщике.ЮридическийАдрес.street_with_type) Тогда
			ЗаписьXML.ЗаписатьАтрибут("Улица", СокрЛП(СведенияОПоставщике.ЮридическийАдрес.street_with_type));
		КонецЕсли;
		Если ЗначениеЗаполнено(СведенияОПоставщике.ЮридическийАдрес.house) Тогда
			ЗаписьXML.ЗаписатьАтрибут("Дом", СокрЛП(СведенияОПоставщике.ЮридическийАдрес.house));
		КонецЕсли;  
		Если ЗначениеЗаполнено(СведенияОГрузополучателе.ЮридическийАдрес.block) Тогда
			ЗаписьXML.ЗаписатьАтрибут("Корпус", СведенияОГрузополучателе.ЮридическийАдрес.block);
		КонецЕсли;
		Если ЗначениеЗаполнено(СведенияОПоставщике.ЮридическийАдрес.flat) Тогда
			ЗаписьXML.ЗаписатьАтрибут("Кварт", СокрЛП(СведенияОПоставщике.ЮридическийАдрес.flat));
		КонецЕсли;
	//Пишем прочерк 
	Иначе
		Если ЗначениеЗаполнено(СведенияОПоставщике.ЮридическийАдрес.postal_code) Тогда
			ЗаписьXML.ЗаписатьАтрибут("Индекс", "-");
		КонецЕсли;
		Если ДокВыгрузки.Организация.Страна.ЭтоСтрана=Ложь тогда
			Если Лев(СокрЛП(ДокВыгрузки.Организация.Страна.Код),1)= "0" тогда
				ЗаписьXML.ЗаписатьАтрибут("КодРегион","");	
			Иначе	
				ЗаписьXML.ЗаписатьАтрибут("КодРегион","");
			КонецЕсли;	
		Иначе 	
			ЗаписьXML.ЗаписатьАтрибут("КодРегион","");	
		КонецЕсли;
		Если ЗначениеЗаполнено(СведенияОПоставщике.ЮридическийАдрес.city_district_with_type) Тогда
			ЗаписьXML.ЗаписатьАтрибут("Район","");
		КонецЕсли;
		Если ЗначениеЗаполнено(СведенияОПоставщике.ЮридическийАдрес.city_with_type) Тогда
			ЗаписьXML.ЗаписатьАтрибут("Город", "");
		КонецЕсли;
		Если ЗначениеЗаполнено(СведенияОПоставщике.ЮридическийАдрес.settlement_with_type) Тогда
			ЗаписьXML.ЗаписатьАтрибут("НаселПункт", "");
		КонецЕсли;
		Если ЗначениеЗаполнено(СведенияОПоставщике.ЮридическийАдрес.street_with_type) Тогда
			ЗаписьXML.ЗаписатьАтрибут("Улица", "");
		КонецЕсли;
		Если ЗначениеЗаполнено(СведенияОПоставщике.ЮридическийАдрес.house) Тогда
			ЗаписьXML.ЗаписатьАтрибут("Дом","");
		КонецЕсли;  
		Если ЗначениеЗаполнено(СведенияОГрузополучателе.ЮридическийАдрес.block) Тогда
			ЗаписьXML.ЗаписатьАтрибут("Корпус","");
		КонецЕсли;
		Если ЗначениеЗаполнено(СведенияОПоставщике.ЮридическийАдрес.flat) Тогда
			ЗаписьXML.ЗаписатьАтрибут("Кварт", "");
		КонецЕсли;
	КонецЕсли;
	ЗаписьXML.ЗаписатьКонецЭлемента();
	ЗаписьXML.ЗаписатьКонецЭлемента(); 
	
	Если ЗначениеЗаполнено(СведенияОПоставщике.НомерСчета) Тогда 
		ЗаписьXML.ЗаписатьНачалоЭлемента("БанкРекв");
		ЗаписьXML.ЗаписатьАтрибут("НомерСчета", Строка(СведенияОПоставщике.НомерСчета));
		ЗаписьXML.ЗаписатьНачалоЭлемента("СвБанк");
		ЗаписьXML.ЗаписатьАтрибут("НаимБанк", СведенияОПоставщике.Банк.Наименование);
		ЗаписьXML.ЗаписатьАтрибут("КорСчет", Строка(СведенияОПоставщике.КоррСчет));
		ЗаписьXML.ЗаписатьАтрибут("БИК", Строка(СведенияОПоставщике.БИК));
		ЗаписьXML.ЗаписатьКонецЭлемента();
		ЗаписьXML.ЗаписатьКонецЭлемента();
	КонецЕсли; 	
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.ЗаписатьКонецЭлемента(); 
	// конец ГрузОтпр	
	
	//ГрузПолуч
	ЗаписьXML.ЗаписатьНачалоЭлемента("ГрузПолуч");
	ЗаписьXML.ЗаписатьНачалоЭлемента("ИдСв");
	ЗаписьXML.ЗаписатьНачалоЭлемента("СвЮЛУч");  
	ЗаписьXML.ЗаписатьАтрибут("КПП", ПолучательПоДокументу.КПП);
	ЗаписьXML.ЗаписатьАтрибут("НаимОрг", ПолучательПоДокументу.НаименованиеПолное);
	ЗаписьXML.ЗаписатьАтрибут("ИННЮЛ", ПолучательПоДокументу.ИНН);
	ЗаписьXML.ЗаписатьКонецЭлемента();
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("Адрес");
	ВыгружатьАдресаКакИностранные = ВыгружатьАдресаКакИностранные(ДокВыгрузки.Организация, ПолучательПоДокументу);
	
	доступно = СведенияОГрузополучателе.ЮридическийАдрес.house  = неопределено;
	доступно = доступно или СведенияОГрузополучателе.ЮридическийАдрес.flat = неопределено;
	доступно = доступно или ВыгружатьАдресаКакИностранные;
	
	Если доступно тогда
		ЗаписьXML.ЗаписатьНачалоЭлемента("АдрИнф");
		ЗаписьXML.ЗаписатьАтрибут("КодСтр", "643");	
		ЗаписьXML.ЗаписатьАтрибут("АдрТекст", СокрЛП(СведенияОГрузополучателе.ФактическийАдрес.ИсходныйАдрес));	
		
		ЗаписьXML.ЗаписатьКонецЭлемента();	
		
	Иначе	
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("АдрРФ");
		//Если ДокВыгрузки.Метаданные().Имя <> "ЗаказНаряд" Тогда 
		Если НЕ ВыводитьПрочерк Тогда
			Если ЗначениеЗаполнено(СведенияОГрузополучателе.ФактическийАдрес.postal_code) Тогда
				ЗаписьXML.ЗаписатьАтрибут("Индекс", СокрЛП(СведенияОГрузополучателе.ФактическийАдрес.postal_code));
			КонецЕсли;
			Если ПолучательПоДокументу.Страна.ЭтоСтрана=Ложь тогда
				Если Лев(СокрЛП(ПолучательПоДокументу.Страна.Код),1)= "0" тогда
					ЗаписьXML.ЗаписатьАтрибут("КодРегион",Сред(СокрЛП(ПолучательПоДокументу.Страна.Код),2));	
				Иначе	
					ЗаписьXML.ЗаписатьАтрибут("КодРегион",СокрЛП(ПолучательПоДокументу.Страна.Код));
				КонецЕсли;	
			Иначе 	
				ЗаписьXML.ЗаписатьАтрибут("КодРегион",СокрЛП(ДокВыгрузки.Получатель.Страна.КодОКСМ));	
			КонецЕсли;
			Если ЗначениеЗаполнено(СведенияОГрузополучателе.ФактическийАдрес.city_district_with_type) Тогда
				ЗаписьXML.ЗаписатьАтрибут("Район",СокрЛП(СведенияОГрузополучателе.ФактическийАдрес.city_district_with_type));
			КонецЕсли;
			Если ЗначениеЗаполнено(СведенияОГрузополучателе.ФактическийАдрес.city_with_type) Тогда
				ЗаписьXML.ЗаписатьАтрибут("Город", СокрЛП(СведенияОГрузополучателе.ФактическийАдрес.city_with_type));
			КонецЕсли;
			Если ЗначениеЗаполнено(СведенияОГрузополучателе.ФактическийАдрес.settlement_with_type) Тогда
				ЗаписьXML.ЗаписатьАтрибут("НаселПункт", СокрЛП(СведенияОГрузополучателе.ФактическийАдрес.settlement_with_type));
			КонецЕсли;
			Если ЗначениеЗаполнено(СведенияОГрузополучателе.ФактическийАдрес.street_with_type) Тогда
				ЗаписьXML.ЗаписатьАтрибут("Улица", СокрЛП(СведенияОГрузополучателе.ФактическийАдрес.street_with_type));
			КонецЕсли;
			Если ЗначениеЗаполнено(СведенияОГрузополучателе.ФактическийАдрес.house) Тогда
				ЗаписьXML.ЗаписатьАтрибут("Дом", СокрЛП(СведенияОГрузополучателе.ФактическийАдрес.house));
			КонецЕсли;
			Если ЗначениеЗаполнено(СведенияОГрузополучателе.ФактическийАдрес.block) Тогда
				ЗаписьXML.ЗаписатьАтрибут("Корпус", СведенияОГрузополучателе.ФактическийАдрес.block);
			КонецЕсли;
			Если ЗначениеЗаполнено(СведенияОГрузополучателе.ФактическийАдрес.flat) Тогда
				ЗаписьXML.ЗаписатьАтрибут("Кварт", СокрЛП(СведенияОГрузополучателе.ФактическийАдрес.flat));
			КонецЕсли;
		//пишем прочерк 
		Иначе 
			Если ЗначениеЗаполнено(СведенияОГрузополучателе.ФактическийАдрес.postal_code) Тогда
				ЗаписьXML.ЗаписатьАтрибут("Индекс", "-");
			КонецЕсли;
			Если ПолучательПоДокументу.Страна.ЭтоСтрана=Ложь тогда
				Если Лев(СокрЛП(ПолучательПоДокументу.Страна.Код),1)= "0" тогда
					ЗаписьXML.ЗаписатьАтрибут("КодРегион","");	
				Иначе	
					ЗаписьXML.ЗаписатьАтрибут("КодРегион","");
				КонецЕсли;	
			Иначе 	
				ЗаписьXML.ЗаписатьАтрибут("КодРегион","");	
			КонецЕсли;
			Если ЗначениеЗаполнено(СведенияОГрузополучателе.ФактическийАдрес.city_district_with_type) Тогда
				ЗаписьXML.ЗаписатьАтрибут("Район","");
			КонецЕсли;
			Если ЗначениеЗаполнено(СведенияОГрузополучателе.ФактическийАдрес.city_with_type) Тогда
				ЗаписьXML.ЗаписатьАтрибут("Город", "");
			КонецЕсли;
			Если ЗначениеЗаполнено(СведенияОГрузополучателе.ФактическийАдрес.settlement_with_type) Тогда
				ЗаписьXML.ЗаписатьАтрибут("НаселПункт", "");
			КонецЕсли;
			Если ЗначениеЗаполнено(СведенияОГрузополучателе.ФактическийАдрес.street_with_type) Тогда
				ЗаписьXML.ЗаписатьАтрибут("Улица", "");
			КонецЕсли;
			Если ЗначениеЗаполнено(СведенияОГрузополучателе.ФактическийАдрес.house) Тогда
				ЗаписьXML.ЗаписатьАтрибут("Дом", "");
			КонецЕсли;
			Если ЗначениеЗаполнено(СведенияОГрузополучателе.ФактическийАдрес.block) Тогда
				ЗаписьXML.ЗаписатьАтрибут("Корпус", "");
			КонецЕсли;
			Если ЗначениеЗаполнено(СведенияОГрузополучателе.ФактическийАдрес.flat) Тогда
				ЗаписьXML.ЗаписатьАтрибут("Кварт", "");
			КонецЕсли;
			
		КонецЕсли;
		ЗаписьXML.ЗаписатьКонецЭлемента();
	КонецЕсли;
	ЗаписьXML.ЗаписатьКонецЭлемента();  
	
	Если ЗначениеЗаполнено(СведенияОПокупателе.НомерСчета) Тогда 
		ЗаписьXML.ЗаписатьНачалоЭлемента("БанкРекв");
		ЗаписьXML.ЗаписатьАтрибут("НомерСчета", Строка(СведенияОПокупателе.НомерСчета));
		ЗаписьXML.ЗаписатьНачалоЭлемента("СвБанк");
		ЗаписьXML.ЗаписатьАтрибут("НаимБанк", СведенияОПокупателе.Банк.Наименование);
		ЗаписьXML.ЗаписатьАтрибут("КорСчет", Строка(СведенияОПокупателе.КоррСчет));
		ЗаписьXML.ЗаписатьАтрибут("БИК", Строка(СведенияОПокупателе.БИК));
		ЗаписьXML.ЗаписатьКонецЭлемента();
		ЗаписьXML.ЗаписатьКонецЭлемента();
	КонецЕсли; 	
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	// конец Грузопол	 
	
	//СвПокуп
	ЗаписьXML.ЗаписатьНачалоЭлемента("СвПокуп");
	ЗаписьXML.ЗаписатьНачалоЭлемента("ИдСв");
	ЗаписьXML.ЗаписатьНачалоЭлемента("СвЮЛУч");
	
	КПП = ДокВыгрузки.Контрагент.КПП;	//значение по умолчанию  
	//Доступно = 	ДокВыгрузки.Контрагент <> ПолучательПоДокументу
	//			И	ДокВыгрузки.Контрагент.ИНН = ПолучательПоДокументу.ИНН
	//			И	ДокВыгрузки.Контрагент.КПП <> ПолучательПоДокументу.КПП;
	//Если Доступно Тогда  
	//	//Это обособленное подразделение				
	//	КПП = ПолучательПоДокументу.КПП;	
	//КонецЕсли; 
	ЗаписьXML.ЗаписатьАтрибут("КПП", КПП); 
	
	ЗаписьXML.ЗаписатьАтрибут("НаимОрг", ДокВыгрузки.Контрагент.НаименованиеПолное);
	ЗаписьXML.ЗаписатьАтрибут("ИННЮЛ", ДокВыгрузки.Контрагент.ИНН);
	ЗаписьXML.ЗаписатьКонецЭлемента();
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("Адрес");
	ВыгружатьАдресаКакИностранные = ВыгружатьАдресаКакИностранные(ДокВыгрузки.Организация, ДокВыгрузки.Контрагент);
	
	доступно = СведенияОПокупателе.ЮридическийАдрес.house  = неопределено;
	доступно = доступно или СведенияОПокупателе.ЮридическийАдрес.flat = неопределено;
	доступно = доступно или ВыгружатьАдресаКакИностранные;
	
	Если доступно тогда
		ЗаписьXML.ЗаписатьНачалоЭлемента("АдрИнф");
		ЗаписьXML.ЗаписатьАтрибут("КодСтр", "643");	
		ЗаписьXML.ЗаписатьАтрибут("АдрТекст", СокрЛП(СведенияОПокупателе.ЮридическийАдрес.ИсходныйАдрес));	
		
		ЗаписьXML.ЗаписатьКонецЭлемента();	
		
	Иначе	
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("АдрРФ");
		
		Если ЗначениеЗаполнено(СведенияОПокупателе.ЮридическийАдрес.postal_code) Тогда
			ЗаписьXML.ЗаписатьАтрибут("Индекс", СокрЛП(СведенияОПокупателе.ЮридическийАдрес.postal_code));
		КонецЕсли;
		Если ДокВыгрузки.Контрагент.Страна.ЭтоСтрана=Ложь тогда
			Если Лев(СокрЛП(ДокВыгрузки.Контрагент.Страна.Код),1)= "0" тогда
				ЗаписьXML.ЗаписатьАтрибут("КодРегион",Сред(СокрЛП(ДокВыгрузки.Контрагент.Страна.Код),2));	
			Иначе	
				ЗаписьXML.ЗаписатьАтрибут("КодРегион",СокрЛП(ДокВыгрузки.Контрагент.Страна.Код));
			КонецЕсли;	
		Иначе 	
			ЗаписьXML.ЗаписатьАтрибут("КодРегион",СокрЛП(ДокВыгрузки.Контрагент.Страна.КодОКСМ));	
		КонецЕсли;
		Если ЗначениеЗаполнено(СведенияОПокупателе.ЮридическийАдрес.city_district_with_type) Тогда
			ЗаписьXML.ЗаписатьАтрибут("Район",СокрЛП(СведенияОПокупателе.ЮридическийАдрес.city_district_with_type));
		КонецЕсли;
		Если ЗначениеЗаполнено(СведенияОПокупателе.ЮридическийАдрес.city_with_type) Тогда
			ЗаписьXML.ЗаписатьАтрибут("Город", СокрЛП(СведенияОПокупателе.ЮридическийАдрес.city_with_type));
		КонецЕсли;
		Если ЗначениеЗаполнено(СведенияОПокупателе.ЮридическийАдрес.settlement_with_type) Тогда
			ЗаписьXML.ЗаписатьАтрибут("НаселПункт", СокрЛП(СведенияОПокупателе.ЮридическийАдрес.settlement_with_type));
		КонецЕсли;
		Если ЗначениеЗаполнено(СведенияОПокупателе.ЮридическийАдрес.street_with_type) Тогда
			ЗаписьXML.ЗаписатьАтрибут("Улица", СокрЛП(СведенияОПокупателе.ЮридическийАдрес.street_with_type));
		КонецЕсли;
		Если ЗначениеЗаполнено(СведенияОПокупателе.ЮридическийАдрес.house) Тогда
			ЗаписьXML.ЗаписатьАтрибут("Дом", СокрЛП(СведенияОПокупателе.ЮридическийАдрес.house));
		КонецЕсли;
		Если ЗначениеЗаполнено(СведенияОПокупателе.ФактическийАдрес.block) Тогда
			ЗаписьXML.ЗаписатьАтрибут("Корпус", СведенияОПокупателе.ФактическийАдрес.block);
		КонецЕсли;
		Если ЗначениеЗаполнено(СведенияОПокупателе.ЮридическийАдрес.flat) Тогда
			ЗаписьXML.ЗаписатьАтрибут("Кварт", СокрЛП(СведенияОПокупателе.ЮридическийАдрес.flat));
		КонецЕсли;
		
		ЗаписьXML.ЗаписатьКонецЭлемента();
	КонецЕсли;
	
	ЗаписьXML.ЗаписатьКонецЭлемента();        
	
	Если ЗначениеЗаполнено(СведенияОПокупателе.НомерСчета) Тогда 
		ЗаписьXML.ЗаписатьНачалоЭлемента("БанкРекв");
		ЗаписьXML.ЗаписатьАтрибут("НомерСчета", Строка(СведенияОПокупателе.НомерСчета));
		ЗаписьXML.ЗаписатьНачалоЭлемента("СвБанк");
		ЗаписьXML.ЗаписатьАтрибут("НаимБанк", СведенияОПокупателе.Банк.Наименование);
		ЗаписьXML.ЗаписатьАтрибут("КорСчет", Строка(СведенияОПокупателе.КоррСчет));
		ЗаписьXML.ЗаписатьАтрибут("БИК", Строка(СведенияОПокупателе.БИК));
		ЗаписьXML.ЗаписатьКонецЭлемента();
		ЗаписьXML.ЗаписатьКонецЭлемента();
	КонецЕсли; 	
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	// конец СвПокуп	
	
	//ЗаписьXML.ЗаписатьНачалоЭлемента("ДопСвФХЖ1");
	//ЗаписьXML.ЗаписатьАтрибут("НаимОКВ", Строка("Российский рубль"));
	//ЗаписьXML.ЗаписатьКонецЭлемента();
	
	//<Документ об отгрузке>
	ЗаписьXML.ЗаписатьНачалоЭлемента("ДокПодтвОтгр");  
	ЗаписьXML.ЗаписатьАтрибут("НаимДокОтгр",	"УПД");
	ЗаписьXML.ЗаписатьАтрибут("НомДокОтгр",		ДокВыгрузки.НомерСчФ);
	ЗаписьXML.ЗаписатьАтрибут("ДатаДокОтгр",	Формат(ДатаУПД, "ДЛФ=Д"));
	ЗаписьXML.ЗаписатьКонецЭлемента();
	//</Документ об отгрузке>
	
	//Если ЗначениеЗаполнено(НазДопДок) ИЛИ ЗначениеЗаполнено(НомерДопДок) Тогда
	//	ЗаписьXML.ЗаписатьНачалоЭлемента("ИнфПолФХЖ1");
	//	ЗаписьXML.ЗаписатьНачалоЭлемента("ТекстИнф");
	//	ЗаписьXML.ЗаписатьАтрибут("Идентиф", Строка(НазДопДок));
	//	ЗаписьXML.ЗаписатьАтрибут("Значен", Строка(НомерДопДок));
	//	ЗаписьXML.ЗаписатьКонецЭлемента();
	//	ЗаписьXML.ЗаписатьКонецЭлемента();
	//КонецЕсли;
	
	ЗаписьXML.ЗаписатьКонецЭлемента(); 
	
	//Табличная часть
	ЗаписьXML.ЗаписатьНачалоЭлемента("ТаблСчФакт");
	НомерСтроки = 0;
	ИтогКолМест = 0;
	ИтогБрутто = 0;
	ИтогНетто = 0;
	ИтогСумБезНДС = 0;
	ИтогСумНДС = 0;
	ИтогСумУчНДС = 0;  
	
	Если ТипЗнч(ДокВыгрузки)=Тип("ДокументСсылка.ЗаказНаряд") Тогда
		ДанныеТоваров = Новый Массив; 
		
		УчетнаяДата = ?(ЗначениеЗаполнено(ДокВыгрузки.ДатаЗакрытия),ДокВыгрузки.ДатаЗакрытия,ДокВыгрузки.Дата);
		ДокДата = СокрЛП(Формат(УчетнаяДата,"ДЛФ=DD"));
		
		НаименованиеУслуги = "Оказание услуг по ремонту и обслуживанию автотранспортного средства " + СокрЛП(ПечатныеФормы.СформироватьМодельАвтомобиляДляПечатнойФормы(ДокВыгрузки.ДокументОснование.Автомобиль));
		НаименованиеУслуги = НаименованиеУслуги + ", по заказ-наряду № " + ВРег(СокрЛП(ДокВыгрузки.Номер)) + " от " + ДокДата;
		
		стрТовар = Новый Структура;
		стрТовар.Вставить("Номенклатура", НаименованиеУслуги);
		стрТовар.Вставить("Количество", 1); 
		стрТовар.Вставить("Сумма", ДокВыгрузки.СуммаДокумента);
		стрТовар.Вставить("СуммаНДС", ДокВыгрузки.СуммаНДС);
		стрТовар.Вставить("СтавкаНДС", ДокВыгрузки.СтавкаНДС);
		
		ДанныеТоваров.Добавить(стрТовар);
	Иначе
		ДанныеТоваров = ДокВыгрузки.Товары.Выгрузить();
	КонецЕсли;
	
	Для Каждого стрТовар из ДанныеТоваров цикл
		//РНПТ
		СтранаПроисхождения = "";
		СтранаКод = "";
		Если ВыводитьРНПТ тогда
			СведенияОРНПТ = СведенияОПрослеживаемости.НайтиСтроки(Новый Структура("Номенклатура", СтрТовар.Номенклатура));
			Если СведенияОРНПТ.Количество() >0 тогда   
				СтранаПроисхождения = СокрЛП(СтрТовар.Номенклатура.Страна);
				Если Справочники.Страны.НайтиПоНаименованию(СтранаПроисхождения)<> Справочники.Страны.ПустаяСсылка() тогда
					СтранаКод = Справочники.Страны.НайтиПоНаименованию(СтранаПроисхождения).КодОКСМ;
				Иначе
					СтранаКод = "";
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;	
		//РНПТ		
		ХарактеристикаДляПоиска = "";
		НомерСтроки = НомерСтроки + 1; 
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("СведТов");
		ЗаписьXML.ЗаписатьАтрибут("НомСтр", Строка(НомерСтроки));
		СтавкаКоэффициент = ЗначенияСервера.ПреобразуемСтавкиНДС(СтрТовар.СтавкаНДС);
		
		Если ЗначениеЗаполнено(СтрТовар.Сумма) И ЗначениеЗаполнено(СтрТовар.СтавкаНДС) Тогда		
			СуммаБезНДС = СтрТовар.Сумма - СтрТовар.СуммаНДС;
			СуммаНДСдоОкругления = СтрТовар.Сумма - СуммаБезНДС;
			СуммаНДСизСуммы = Окр(СуммаНДСдоОкругления, 2);
		КонецЕсли;
		Если ЗначениеЗаполнено(СуммаБезНДС) И ЗначениеЗаполнено(СтрТовар.Количество) Тогда		
			Цена = СуммаБезНДС / СтрТовар.Количество;
		КонецЕсли;
		
		Если ТипЗнч(СтрТовар.Номенклатура)=Тип("СправочникСсылка.Номенклатура") Тогда
			ЗаписьXML.ЗаписатьАтрибут("НаимТов", СтрТовар.Номенклатура.Наименование); 
			ЗаписьXML.ЗаписатьАтрибут("ОКЕИ_Тов", СокрЛП(СтрТовар.Номенклатура.ЕдиницаИзмерения.Код));  
		Иначе
			ЗаписьXML.ЗаписатьАтрибут("НаимТов", СокрЛП(СтрТовар.Номенклатура)); 
			ЗаписьXML.ЗаписатьАтрибут("ОКЕИ_Тов", "796");  
		КонецЕсли;
		
		ЗаписьXML.ЗаписатьАтрибут("КолТов", Строка(СтрЗаменить(СтрТовар.Количество, Символы.НПП,"")));
		ЗаписьXML.ЗаписатьАтрибут("ЦенаТов",Строка(Формат(Цена,"ЧДЦ=2; ЧГ=0; ЧРД=.")));
		ЗаписьXML.ЗаписатьАтрибут("НалСт", СтавкаКоэффициент.Ставка);  
		ЗаписьXML.ЗаписатьАтрибут("СтТовБезНДС", Строка(Формат(СуммаБезНДС,"ЧДЦ=2; ЧГ=0; ЧРД=.")));
		ЗаписьXML.ЗаписатьАтрибут("СтТовУчНал", Строка(Формат(СтрТовар.Сумма,"ЧДЦ=2; ЧГ=0; ЧРД=.")));	    
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("Акциз");
		ЗаписьXML.ЗаписатьНачалоЭлемента("БезАкциз");
		ЗаписьXML.ЗаписатьТекст("без акциза");
		ЗаписьXML.ЗаписатьКонецЭлемента();
		ЗаписьXML.ЗаписатьКонецЭлемента();
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("СумНал"); 
		
		Если СуммаНДСизСуммы > 0 Тогда
			ЗаписьXML.ЗаписатьНачалоЭлемента("СумНал");
			ЗаписьXML.ЗаписатьТекст(Строка(Формат(СуммаНДСизСуммы,"ЧДЦ=2; ЧГ=0; ЧРД=.")));
		ИначеЕсли СуммаНДСизСуммы = 0 Тогда		
			ЗаписьXML.ЗаписатьНачалоЭлемента("БезНДС");
			ЗаписьXML.ЗаписатьТекст("без НДС");
		КонецЕсли;
		ЗаписьXML.ЗаписатьКонецЭлемента();
		ЗаписьXML.ЗаписатьКонецЭлемента();
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("СвТД");
		ЗаписьXML.ЗаписатьАтрибут("НомерТД", "-");
		Если СтранаКод <> "" тогда
			ЗаписьXML.ЗаписатьАтрибут("КодПроисх", СтранаКод);	
		Иначе	
			ЗаписьXML.ЗаписатьАтрибут("КодПроисх", "643");
		КонецЕсли;
		ЗаписьXML.ЗаписатьКонецЭлемента();
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("ДопСведТов");
		
		ЗаписьXML.ЗаписатьАтрибут("ПрТовРаб", "1");
		ЗаписьXML.ЗаписатьАтрибут("НадлОтп", Строка(СтрЗаменить(СтрТовар.Количество, Символы.НПП,"")));
		Если СтранаПроисхождения <>"" тогда
			ЗаписьXML.ЗаписатьАтрибут("КрНаимСтрПр", СтранаПроисхождения);			
		Иначе	
			ЗаписьXML.ЗаписатьАтрибут("КрНаимСтрПр", "Россия");
		КонецЕсли;
		
		Если ТипЗнч(СтрТовар.Номенклатура)=Тип("СправочникСсылка.Номенклатура") Тогда
			ЗаписьXML.ЗаписатьАтрибут("НаимЕдИзм", СтрТовар.Номенклатура.ЕдиницаИзмерения.Наименование);
			
			//В поле Артикул всегда выгружаем артикул
			Если НЕ СтрТовар.Номенклатура.Артикул = "" Тогда
				ЗаписьXML.ЗаписатьАтрибут("АртикулТов", Строка(СтрТовар.Номенклатура.Артикул));
			КонецЕсли;
			
			//В поле КодТов выгрузка зависит от настроек:
			//1. В карточке заполнено
			//1.1. В карточке выбран ЧертежныйНомер , то приоритеты в порядке убывания: 	1. Чертежный номер	2. КодКаталога
			//1.2. В карточке выбран Артикул, 		  то приоритеты в порядке убывания: 	1. Артикул,			2. КодКаталога;
			//1.3  В карточке выбран КодКаталога, 	  то приоритеты в порядке убывания:		1. КодКаталога		2. ЧертежныйНомер
			//2. В карточке не заполнено. 			  приоритеты в порядке убывания: 		1. Чертежный номер 	2. Артикул, 		3.КодКаталога. 
			
			КодТов = "";
			Если ДокВыгрузки.Контрагент.ЗаполнениеКодаТовара = "КодКаталога" тогда
				КодТов = ?(ЗначениеЗаполнено(СокрЛП(СтрТовар.Номенклатура.КодКаталога)), СокрЛП(СтрТовар.Номенклатура.КодКаталога), СтрТовар.Номенклатура.ЧертежныйНомер);
			ИначеЕсли ДокВыгрузки.Контрагент.ЗаполнениеКодаТовара = "Артикул" тогда
				КодТов = ?(ЗначениеЗаполнено(СокрЛП(СтрТовар.Номенклатура.Артикул)), СокрЛП(СтрТовар.Номенклатура.Артикул), СтрТовар.Номенклатура.КодКаталога);	
			ИначеЕсли ДокВыгрузки.Контрагент.ЗаполнениеКодаТовара = "ЧертежныйНомер" тогда
				КодТов = ?(ЗначениеЗаполнено(СокрЛП(СтрТовар.Номенклатура.Артикул)), СокрЛП(СтрТовар.Номенклатура.Артикул), СокрЛП(СтрТовар.Номенклатура.КодКаталога));
				КодТов = ?(ЗначениеЗаполнено(СокрЛП(СтрТовар.Номенклатура.ЧертежныйНомер)),СокрЛП(СтрТовар.Номенклатура.ЧертежныйНомер), КодТов);	
			Иначе
				КодТов = ?(ЗначениеЗаполнено(СокрЛП(СтрТовар.Номенклатура.Артикул)), СокрЛП(СтрТовар.Номенклатура.Артикул), СокрЛП(СтрТовар.Номенклатура.КодКаталога));
				КодТов = ?(ЗначениеЗаполнено(СокрЛП(СтрТовар.Номенклатура.ЧертежныйНомер)),СокрЛП(СтрТовар.Номенклатура.ЧертежныйНомер), КодТов);
			КонецЕсли;
			Если КодТов <> "" тогда
				ЗаписьXML.ЗаписатьАтрибут("КодТов", КодТов);   
			КонецЕсли;
		Иначе
			ЗаписьXML.ЗаписатьАтрибут("НаимЕдИзм", "шт");
			//ЗаписьXML.ЗаписатьАтрибут("АртикулТов", "");
			//ЗаписьXML.ЗаписатьАтрибут("КодТов", "");   
		КонецЕсли;
		Если ВыводитьРНПТ тогда
			СведенияОРНПТ = СведенияОПрослеживаемости.НайтиСтроки(Новый Структура("Номенклатура", СтрТовар.Номенклатура));
			Если СведенияОРНПТ.Количество() >0 тогда   
				Для ИндексСтроки = 0 По СведенияОРНПТ.Количество() - 1 Цикл	
					ЗаписьXML.ЗаписатьНачалоЭлемента("СведПрослеж");
					ЗаписьXML.ЗаписатьАтрибут("НомТовПрослеж", СведенияОРНПТ[ИндексСтроки].РНПТ.Код);
					ЗаписьXML.ЗаписатьАтрибут("ЕдИзмПрослеж", СтрТовар.Номенклатура.ЕдиницаИзмерения.Код);
					ЗаписьXML.ЗаписатьАтрибут("НаимЕдИзмПрослеж", СтрТовар.Номенклатура.ЕдиницаИзмерения.Наименование);
					ЗаписьXML.ЗаписатьАтрибут("КолВЕдПрослеж", Строка(Формат(СведенияОРНПТ[ИндексСтроки].Количество,"ЧДЦ=2; ЧГ=0; ЧРД=.")));
					//	ЗаписьXML.ЗаписатьАтрибут("КолВЕдПрослеж", Строка(Формат(СведенияОРНПТ[ИндексСтроки].Количество)),"ЧДЦ=2; ЧГ=0; ЧРД=."); 
					ЗаписьXML.ЗаписатьКонецЭлемента(); //"СведПрослеж"	Строка(Формат(Цена,"ЧДЦ=2; ЧГ=0; ЧРД=."))
				КонецЦикла;
			КонецЕсли;
		КонецЕсли;
		ЗаписьXML.ЗаписатьКонецЭлемента(); 
		ЗаписьXML.ЗаписатьКонецЭлемента();
		
		ИтогКолМест = ИтогКолМест + СтрТовар.Количество; 
		ИтогНетто = ИтогНетто + СтрТовар.Количество;
		ИтогСумБезНДС = ИтогСумБезНДС + СуммаБезНДС;
		ИтогСумНДС = ИтогСумНДС + СтрТовар.СуммаНДС;	
		ИтогСумУчНДС = ИтогСумУчНДС + СтрТовар.Сумма;
	КонецЦикла;
	
	// Конец табличной части
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("ВсегоОпл");
	//ЗаписьXML.ЗаписатьАтрибут("КолМестВс", Строка(Формат(ИтогНетто, "ЧГ=")));
	//	//ЗаписьXML.ЗаписатьАтрибут("БруттоВс", Строка(Формат(ИтогБрутто,"ЧДЦ=2; ЧГ=0; ЧРД=.")));
	//	ЗаписьXML.ЗаписатьАтрибут("НеттоВс", Строка(Формат(ИтогНетто,"ЧДЦ=2; ЧГ=0; ЧРД=.")));
	ЗаписьXML.ЗаписатьАтрибут("СтТовБезНДСВсего", Строка(Формат(ИтогСумБезНДС,"ЧДЦ=2; ЧГ=0; ЧРД=.")));
	ЗаписьXML.ЗаписатьАтрибут("СтТовУчНалВсего", Строка(Формат(ИтогСумУчНДС,"ЧДЦ=2; ЧГ=0; ЧРД=.")));
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("СумНалВсего");
	ЗаписьXML.ЗаписатьНачалоЭлемента("СумНал");
	ЗаписьXML.ЗаписатьТекст(Строка(Формат(ИтогСумНДС,"ЧДЦ=2; ЧГ=0; ЧРД=.")));
	ЗаписьXML.ЗаписатьКонецЭлемента();
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("КолНеттоВс");
	ЗаписьXML.ЗаписатьТекст(Строка(Формат(ИтогНетто,"ЧДЦ=2; ЧГ=0; ЧРД=.")));
	ЗаписьXML.ЗаписатьКонецЭлемента();	
	ЗаписьXML.ЗаписатьКонецЭлемента();
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("СвПродПер");
	ЗаписьXML.ЗаписатьНачалоЭлемента("СвПер");
	ЗаписьXML.ЗаписатьАтрибут("СодОпер", "Товары переданы");
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("ОснПер");
	Если Найти(ДокВыгрузки.ДоговорВзаиморасчетов.Номер,"Оферта")>0 тогда      
		ЗаписьXML.ЗаписатьАтрибут("НаимОсн", "Оферта");
		ЗаписьXML.ЗаписатьАтрибут("НомОсн", Строка(Сред(ДокВыгрузки.ДоговорВзаиморасчетов.Номер,8)));
	Иначе
		ЗаписьXML.ЗаписатьАтрибут("НаимОсн", "Договор");                                     
		ЗаписьXML.ЗаписатьАтрибут("НомОсн", Строка(ДокВыгрузки.ДоговорВзаиморасчетов.Номер));
	КонецЕсли;
	ЗаписьXML.ЗаписатьАтрибут("ДатаОсн", Строка(Формат(ДокВыгрузки.ДоговорВзаиморасчетов.НачПериода, "ДЛФ=Д")));
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	Если ТипЗнч(ДокВыгрузки) = Тип("ДокументСсылка.ЗаказНаряд")
		И ДокВыгрузки.Контрагент.ШаблонСтрокиДанныеТранспортировки = 1 Тогда 
		ЗаписьXML.ЗаписатьНачалоЭлемента("ТранГруз");
		ДатаТранГруз = ?(ЗначениеЗаполнено(ДокВыгрузки.ДатаЗакрытия),ДокВыгрузки.ДатаЗакрытия,ДокВыгрузки.Дата); 
		СтрТранГруз = "Заказ-наряд № "+СокрЛП(ДокВыгрузки.Номер)+" от "+Формат(ДатаТранГруз,"ДЛФ=Д")+" г.";
		ЗаписьXML.ЗаписатьАтрибут("СвТранГруз", СтрТранГруз);
		ЗаписьXML.ЗаписатьКонецЭлемента();
	КонецЕсли;
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("СвПерВещи");
	ЗаписьXML.ЗаписатьКонецЭлемента();
	ЗаписьXML.ЗаписатьКонецЭлемента();
	ЗаписьXML.ЗаписатьНачалоЭлемента("ИнфПолФХЖ3");
	ЗаписьXML.ЗаписатьКонецЭлемента();
	ЗаписьXML.ЗаписатьКонецЭлемента();
	//Подписант
	ЗаписьXML.ЗаписатьНачалоЭлемента("Подписант");
	ЗаписьXML.ЗаписатьАтрибут("ОснПолн", "Должностные обязанности");
	ЗаписьXML.ЗаписатьАтрибут("ОблПолн", "1");
	ЗаписьXML.ЗаписатьАтрибут("Статус", "1");	
	ЗаписьXML.ЗаписатьНачалоЭлемента("ЮЛ");
	
	Если ЗначениеЗаполнено(ДокВыгрузки.Организация.ИНН) Тогда
		ЗаписьXML.ЗаписатьАтрибут("ИННЮЛ", ДокВыгрузки.Организация.ИНН);		
	Иначе 		
		ЗаписьXML.ЗаписатьАтрибут("ИННЮЛ", "0101010108");
	КонецЕсли;
	
	//ПодписантОветственный = "";
	РукФ = "";
	РукИ = "";
	РукО = "";
	Если ЗначениеЗаполнено(ДокВыгрузки.Организация.Руководитель) Тогда
		РукФИО = СтрЗаменить(ДокВыгрузки.Организация.Руководитель, " ", Символы.ПС);
		Если СтрЧислоСтрок(РукФИО) = 3 Тогда
			РукФ = СокрЛП(СтрПолучитьСтроку(РукФИО, 1));
			РукИ = СокрЛП(СтрПолучитьСтроку(РукФИО, 2));
			РукО = СокрЛП(СтрПолучитьСтроку(РукФИО, 3));
		КонецЕсли;			
	КонецЕсли;
	
	ЗаписьXML.ЗаписатьАтрибут("Должн", "Директор");
	ЗаписьXML.ЗаписатьНачалоЭлемента("ФИО");
	ЗаписьXML.ЗаписатьАтрибут("Фамилия", ?(ЗначениеЗаполнено(РукФ),РукФ,"Ф"));
	ЗаписьXML.ЗаписатьАтрибут("Имя", ?(ЗначениеЗаполнено(РукИ),РукИ,"И"));	
	ЗаписьXML.ЗаписатьАтрибут("Отчество", ?(ЗначениеЗаполнено(РукО),РукО,"О"));
	
	ЗаписьXML.ЗаписатьКонецЭлемента();
	ЗаписьXML.ЗаписатьКонецЭлемента();
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.ЗаписатьКонецЭлемента();
	ЗаписьXML.ЗаписатьКонецЭлемента(); 
	
	Возврат ЗаписьXML.Закрыть();
КонецФункции

&НаСервере
Функция Реализация_СформироватьXML_УПДкамаз(ДокВыгрузки) Экспорт
	ИдОтпр = "2BK-0000000000-0000000";
	ИдПол = "2BK-0000000000-0000000000000";  
	ВыводитьПрочерк = Истина;
	ВыводитьРНПТ = Ложь;
	
	Если (ДокВыгрузки.Контрагент.ТипКонтрагента=Перечисления.ТипКонтрагента.Ип) ИЛИ (ДокВыгрузки.Контрагент.ТипКонтрагента=Перечисления.ТипКонтрагента.Фл ) Тогда
		КонтрИП = Истина;
	КонецЕсли;
	
	Если ТипЗнч(ДокВыгрузки) = Тип("ДокументСсылка.ЗаказНаряд") Тогда 
		ДатаУПД = ДокВыгрузки.ДатаЗакрытия;
	Иначе
		ДатаУПД = ДокВыгрузки.Дата;
	КонецЕсли;
	
	
	
	ОргИП = Ложь;
	БанковскийСчетКонтрагента = ДокВыгрузки.Контрагент.РасчСчет;
	БанковскийСчетФирмы = ДокВыгрузки.Организация.РасчСчет;
	СведенияОПоставщике = ЗначенияСервера.СведенияОЮрФизЛице(ДокВыгрузки.Организация, ДатаУПД);
	СведенияОПокупателе = ЗначенияСервера.СведенияОЮРФизЛице(ДокВыгрузки.Контрагент, ДатаУПД);
	
	Если ДокВыгрузки.Метаданные().Реквизиты.Найти("Получатель")<>Неопределено И ЗначениеЗаполнено(ДокВыгрузки.Получатель) и ТипЗнч(ДокВыгрузки.Получатель) = Тип("СправочникСсылка.Контрагенты") тогда
		СведенияОГрузополучателе  = ЗначенияСервера.СведенияОЮрФизЛице(ДокВыгрузки.Получатель,  ДатаУПД);
		ПолучательПоДокументу = ДокВыгрузки.Получатель;
	Иначе
		СведенияОГрузополучателе  = СведенияОПокупателе;
		ПолучательПоДокументу = ДокВыгрузки.Контрагент;
	КонецЕсли;  
	
	СведенияОГрузоотправитель = СведенияОПоставщике;
	
	НовыйУникальныйИдентификатор = Новый УникальныйИдентификатор;
	ДатаДляИндифик = ТекущаяДата();
	Год   = Строка(Формат(ДатаДляИндифик, "ДФ=гггг")); // Год
	Месяц = Строка(Формат(ДатаДляИндифик, "ДФ=ММ"));   // Месяц
	День  = Строка(Формат(ДатаДляИндифик, "ДФ=дд"));   // День
	
	ДатаПреобразоваянная = Год + Месяц + День;
	
	ЗаписьXML = Новый ЗаписьXML;
	
	ЗаписьXML.УстановитьСтроку();
	ЗаписьXML.ЗаписатьОбъявлениеXML();
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("Файл");
	ЗаписьXML.ЗаписатьСоответствиеПространстваИмен("xsd","http://www.w3.org/2001/XMLSchema");
	ЗаписьXML.ЗаписатьСоответствиеПространстваИмен("xsi","http://www.w3.org/2001/XMLSchema-instance");
	
	ЗаписьXML.ЗаписатьАтрибут("ИдФайл", "ON_NSCHFDOPPR_" + ИдПол + "_" + ИдОтпр + "_" + ДатаПреобразоваянная + "_" + НовыйУникальныйИдентификатор);	
	ЗаписьXML.ЗаписатьАтрибут("ВерсФорм", "5.01");
	ЗаписьXML.ЗаписатьАтрибут("ВерсПрог", "1.0");
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("СвУчДокОбор");
	ЗаписьXML.ЗаписатьАтрибут("ИдОтпр", ИдОтпр);
	ЗаписьXML.ЗаписатьАтрибут("ИдПол", ИдПол);	
	ЗаписьXML.ЗаписатьНачалоЭлемента("СвОЭДОтпр");
	ЗаписьXML.ЗаписатьАтрибут("ИННЮЛ", "7728168971");	
	ЗаписьXML.ЗаписатьАтрибут("ИдЭДО", "2BM");
	ЗаписьXML.ЗаписатьАтрибут("НаимОрг", "АО ""ПФ ""СКБ Контур""");
	
	ЗаписьXML.ЗаписатьКонецЭлемента();
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("Документ");	
	ЗаписьXML.ЗаписатьАтрибут("КНД", "1115131"); 	
	ЗаписьXML.ЗаписатьАтрибут("ПоФактХЖ", "Документ об отгрузке товаров (выполнении работ), передаче имущественных прав (документ об оказании услуг)");
	ЗаписьXML.ЗаписатьАтрибут("НаимДокОпр", "Счет-фактура и документ об отгрузке товаров (выполнении работ), передаче имущественных прав (документ об оказании услуг)");
	ЗаписьXML.ЗаписатьАтрибут("ДатаИнфПр", Формат(ДатаУПД, "ДЛФ=Д"));
	ЗаписьXML.ЗаписатьАтрибут("ВремИнфПр", "00.00.00");
	ЗаписьXML.ЗаписатьАтрибут("НаимЭконСубСост", ДокВыгрузки.Организация.НаименованиеПолное);
	ЗаписьXML.ЗаписатьАтрибут("Функция", "СЧФДОП");
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("СвСчФакт");
	ЗаписьXML.ЗаписатьАтрибут("НомерСчФ", ?(ЗначениеЗаполнено(ДокВыгрузки.НомерСчф),ДокВыгрузки.НомерСчф,ДокВыгрузки.Номер));
	Если ТипЗнч(ДокВыгрузки) = Тип("ДокументСсылка.ЗаказНаряд") Тогда 
		ЗаписьXML.ЗаписатьАтрибут("ДатаСчФ", Формат(ДокВыгрузки.ДатаЗакрытия, "ДЛФ=Д"));
	Иначе
		ЗаписьXML.ЗаписатьАтрибут("ДатаСчФ", Формат(ДокВыгрузки.Дата, "ДЛФ=Д"));
	КонецЕсли;
	ЗаписьXML.ЗаписатьАтрибут("КодОКВ", "643");
	
	//Продавец
	ЗаписьXML.ЗаписатьНачалоЭлемента("СвПрод");
	ЗаписьXML.ЗаписатьНачалоЭлемента("ИдСв");
	ЗаписьXML.ЗаписатьНачалоЭлемента("СвЮЛУч");  
	ЗаписьXML.ЗаписатьАтрибут("КПП", ДокВыгрузки.Организация.КПП);
	ЗаписьXML.ЗаписатьАтрибут("НаимОрг", ДокВыгрузки.Организация.НаименованиеПолное);
	ЗаписьXML.ЗаписатьАтрибут("ИННЮЛ", ДокВыгрузки.Организация.ИНН);
	ЗаписьXML.ЗаписатьКонецЭлемента();
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("Адрес");
	ЗаписьXML.ЗаписатьНачалоЭлемента("АдрРФ");
	
	Если ЗначениеЗаполнено(СведенияОПоставщике.ЮридическийАдрес.postal_code) Тогда
		ЗаписьXML.ЗаписатьАтрибут("Индекс", СокрЛП(СведенияОПоставщике.ЮридическийАдрес.postal_code));
	КонецЕсли;
	Если ДокВыгрузки.Организация.Страна.ЭтоСтрана=Ложь тогда
		Если Лев(СокрЛП(ДокВыгрузки.Организация.Страна.Код),1)= "0" тогда
			ЗаписьXML.ЗаписатьАтрибут("КодРегион",Сред(СокрЛП(ДокВыгрузки.Организация.Страна.Код),2));	
		Иначе	
			ЗаписьXML.ЗаписатьАтрибут("КодРегион",СокрЛП(ДокВыгрузки.Организация.Страна.Код));
		КонецЕсли;	
	Иначе 	
		ЗаписьXML.ЗаписатьАтрибут("КодРегион",СокрЛП(ДокВыгрузки.Организация.Страна.КодОКСМ));	
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СведенияОПоставщике.ЮридическийАдрес.city_district_with_type) Тогда
		ЗаписьXML.ЗаписатьАтрибут("Район",СокрЛП(СведенияОПоставщике.ЮридическийАдрес.city_district_with_type));
	КонецЕсли;
	Если ЗначениеЗаполнено(СведенияОПоставщике.ЮридическийАдрес.city_with_type) Тогда
		ЗаписьXML.ЗаписатьАтрибут("Город", СокрЛП(СведенияОПоставщике.ЮридическийАдрес.city_with_type));
	КонецЕсли;
	Если ЗначениеЗаполнено(СведенияОПоставщике.ЮридическийАдрес.settlement_with_type) Тогда
		ЗаписьXML.ЗаписатьАтрибут("НаселПункт", СокрЛП(СведенияОПоставщике.ЮридическийАдрес.settlement_with_type));
	КонецЕсли;
	Если ЗначениеЗаполнено(СведенияОПоставщике.ЮридическийАдрес.street_with_type) Тогда
		ЗаписьXML.ЗаписатьАтрибут("Улица", СокрЛП(СведенияОПоставщике.ЮридическийАдрес.street_with_type));
	КонецЕсли;
	Если ЗначениеЗаполнено(СведенияОПоставщике.ЮридическийАдрес.house) Тогда
		ЗаписьXML.ЗаписатьАтрибут("Дом", СокрЛП(СведенияОПоставщике.ЮридическийАдрес.house));
	КонецЕсли;
	Если ЗначениеЗаполнено(СведенияОПоставщике.ЮридическийАдрес.flat) Тогда
		ЗаписьXML.ЗаписатьАтрибут("Кварт", СокрЛП(СведенияОПоставщике.ЮридическийАдрес.flat));
	КонецЕсли;
	
	ЗаписьXML.ЗаписатьКонецЭлемента();
	ЗаписьXML.ЗаписатьКонецЭлемента();
	Если ЗначениеЗаполнено(СведенияОПоставщике.НомерСчета) Тогда 
		ЗаписьXML.ЗаписатьНачалоЭлемента("БанкРекв");
		ЗаписьXML.ЗаписатьАтрибут("НомерСчета", Строка(СведенияОПоставщике.НомерСчета));
		ЗаписьXML.ЗаписатьНачалоЭлемента("СвБанк");
		ЗаписьXML.ЗаписатьАтрибут("НаимБанк", СведенияОПоставщике.Банк.Наименование);
		ЗаписьXML.ЗаписатьАтрибут("КорСчет", Строка(СведенияОПоставщике.КоррСчет));
		ЗаписьXML.ЗаписатьАтрибут("БИК", Строка(СведенияОПоставщике.БИК));
		ЗаписьXML.ЗаписатьКонецЭлемента();
		ЗаписьXML.ЗаписатьКонецЭлемента();
	КонецЕсли; 	
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	//Продавец	
	
	//СвПокуп
	ЗаписьXML.ЗаписатьНачалоЭлемента("СвПокуп");
	ЗаписьXML.ЗаписатьНачалоЭлемента("ИдСв");
	ЗаписьXML.ЗаписатьНачалоЭлемента("СвЮЛУч");
	
	КПП = ДокВыгрузки.Контрагент.КПП;	//значение по умолчанию  
	ЗаписьXML.ЗаписатьАтрибут("КПП", КПП); 
	
	ЗаписьXML.ЗаписатьАтрибут("НаимОрг", ДокВыгрузки.Контрагент.НаименованиеПолное);
	ЗаписьXML.ЗаписатьАтрибут("ИННЮЛ", ДокВыгрузки.Контрагент.ИНН);
	ЗаписьXML.ЗаписатьКонецЭлемента();
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("Адрес");
	ВыгружатьАдресаКакИностранные = ВыгружатьАдресаКакИностранные(ДокВыгрузки.Организация, ДокВыгрузки.Контрагент);
	
	доступно = СведенияОПокупателе.ЮридическийАдрес.house  = неопределено;
	доступно = доступно или СведенияОПокупателе.ЮридическийАдрес.flat = неопределено;
	доступно = доступно или ВыгружатьАдресаКакИностранные;
	
	Если доступно тогда
		ЗаписьXML.ЗаписатьНачалоЭлемента("АдрИнф");
		ЗаписьXML.ЗаписатьАтрибут("КодСтр", "643");	
		ЗаписьXML.ЗаписатьАтрибут("АдрТекст", СокрЛП(СведенияОПокупателе.ЮридическийАдрес.ИсходныйАдрес));	
		
		ЗаписьXML.ЗаписатьКонецЭлемента();	
		
	Иначе	
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("АдрРФ");
		
		Если ЗначениеЗаполнено(СведенияОПокупателе.ЮридическийАдрес.postal_code) Тогда
			ЗаписьXML.ЗаписатьАтрибут("Индекс", СокрЛП(СведенияОПокупателе.ЮридическийАдрес.postal_code));
		КонецЕсли;
		Если ДокВыгрузки.Контрагент.Страна.ЭтоСтрана=Ложь тогда
			Если Лев(СокрЛП(ДокВыгрузки.Контрагент.Страна.Код),1)= "0" тогда
				ЗаписьXML.ЗаписатьАтрибут("КодРегион",Сред(СокрЛП(ДокВыгрузки.Контрагент.Страна.Код),2));	
			Иначе	
				ЗаписьXML.ЗаписатьАтрибут("КодРегион",СокрЛП(ДокВыгрузки.Контрагент.Страна.Код));
			КонецЕсли;	
		Иначе 	
			ЗаписьXML.ЗаписатьАтрибут("КодРегион",СокрЛП(ДокВыгрузки.Контрагент.Страна.КодОКСМ));	
		КонецЕсли;
		Если ЗначениеЗаполнено(СведенияОПокупателе.ЮридическийАдрес.city_district_with_type) Тогда
			ЗаписьXML.ЗаписатьАтрибут("Район",СокрЛП(СведенияОПокупателе.ЮридическийАдрес.city_district_with_type));
		КонецЕсли;
		Если ЗначениеЗаполнено(СведенияОПокупателе.ЮридическийАдрес.city_with_type) Тогда
			ЗаписьXML.ЗаписатьАтрибут("Город", СокрЛП(СведенияОПокупателе.ЮридическийАдрес.city_with_type));
		КонецЕсли;
		Если ЗначениеЗаполнено(СведенияОПокупателе.ЮридическийАдрес.settlement_with_type) Тогда
			ЗаписьXML.ЗаписатьАтрибут("НаселПункт", СокрЛП(СведенияОПокупателе.ЮридическийАдрес.settlement_with_type));
		КонецЕсли;
		Если ЗначениеЗаполнено(СведенияОПокупателе.ЮридическийАдрес.street_with_type) Тогда
			ЗаписьXML.ЗаписатьАтрибут("Улица", СокрЛП(СведенияОПокупателе.ЮридическийАдрес.street_with_type));
		КонецЕсли;
		Если ЗначениеЗаполнено(СведенияОПокупателе.ЮридическийАдрес.house) Тогда
			ЗаписьXML.ЗаписатьАтрибут("Дом", СокрЛП(СведенияОПокупателе.ЮридическийАдрес.house));
		КонецЕсли;
		Если ЗначениеЗаполнено(СведенияОПокупателе.ФактическийАдрес.block) Тогда
			ЗаписьXML.ЗаписатьАтрибут("Корпус", СведенияОПокупателе.ФактическийАдрес.block);
		КонецЕсли;
		Если ЗначениеЗаполнено(СведенияОПокупателе.ЮридическийАдрес.flat) Тогда
			ЗаписьXML.ЗаписатьАтрибут("Кварт", СокрЛП(СведенияОПокупателе.ЮридическийАдрес.flat));
		КонецЕсли;
		
		ЗаписьXML.ЗаписатьКонецЭлемента();
	КонецЕсли;
	
	ЗаписьXML.ЗаписатьКонецЭлемента();        
	
	Если ЗначениеЗаполнено(СведенияОПокупателе.НомерСчета) Тогда 
		ЗаписьXML.ЗаписатьНачалоЭлемента("БанкРекв");
		ЗаписьXML.ЗаписатьАтрибут("НомерСчета", Строка(СведенияОПокупателе.НомерСчета));
		ЗаписьXML.ЗаписатьНачалоЭлемента("СвБанк");
		ЗаписьXML.ЗаписатьАтрибут("НаимБанк", СведенияОПокупателе.Банк.Наименование);
		ЗаписьXML.ЗаписатьАтрибут("КорСчет", Строка(СведенияОПокупателе.КоррСчет));
		ЗаписьXML.ЗаписатьАтрибут("БИК", Строка(СведенияОПокупателе.БИК));
		ЗаписьXML.ЗаписатьКонецЭлемента();
		ЗаписьXML.ЗаписатьКонецЭлемента();
	КонецЕсли; 	
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	// конец СвПокуп	
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("ДопСвФХЖ1");
	ЗаписьXML.ЗаписатьАтрибут("НаимОКВ", Строка("Российский рубль"));
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	//<Документ об отгрузке>
	ЗаписьXML.ЗаписатьНачалоЭлемента("ДокПодтвОтгр");  
	ЗаписьXML.ЗаписатьАтрибут("НаимДокОтгр",	"УПД");
	ЗаписьXML.ЗаписатьАтрибут("НомДокОтгр",		ДокВыгрузки.Номер);
	ЗаписьXML.ЗаписатьАтрибут("ДатаДокОтгр",	Формат(ДатаУПД, "ДЛФ=Д"));
	ЗаписьXML.ЗаписатьКонецЭлемента();
	//</Документ об отгрузке>
	
	
	ЗаписьXML.ЗаписатьКонецЭлемента(); 
	
	//Табличная часть
	ЗаписьXML.ЗаписатьНачалоЭлемента("ТаблСчФакт");
	НомерСтроки = 0;
	ИтогКолМест = 0;
	ИтогБрутто = 0;
	ИтогНетто = 0;
	ИтогСумБезНДС = 0;
	ИтогСумНДС = 0;
	ИтогСумУчНДС = 0;  
	
	Если ТипЗнч(ДокВыгрузки)=Тип("ДокументСсылка.ЗаказНаряд") Тогда
		ДанныеТоваров = Новый Массив; 
		
		УчетнаяДата = ?(ЗначениеЗаполнено(ДокВыгрузки.ДатаЗакрытия),ДокВыгрузки.ДатаЗакрытия,ДокВыгрузки.Дата);
		ДокДата = СокрЛП(Формат(УчетнаяДата,"ДЛФ=DD"));
		
		НаименованиеУслуги = "Услуги/работы по проведению ремонта автотехники КАМАЗ №";
		НаименованиеУслуги = НаименованиеУслуги +  ВРег(СокрЛП(ДокВыгрузки.Номер)) + " от " + ДокДата;
		
		
		стрТовар = Новый Структура;
		стрТовар.Вставить("Номенклатура", НаименованиеУслуги);
		стрТовар.Вставить("Количество", 0); 
		стрТовар.Вставить("Сумма", ДокВыгрузки.СуммаДокумента);
		стрТовар.Вставить("СуммаНДС", ДокВыгрузки.СуммаНДС);
		стрТовар.Вставить("СтавкаНДС", ДокВыгрузки.СтавкаНДС);
		
		ДанныеТоваров.Добавить(стрТовар);
	Иначе
		ДанныеТоваров = ДокВыгрузки.Товары.Выгрузить();
	КонецЕсли;
	
	Для Каждого стрТовар из ДанныеТоваров цикл
		//РНПТ
		СтранаПроисхождения = "";
		СтранаКод = "";
		ХарактеристикаДляПоиска = "";
		НомерСтроки = НомерСтроки + 1; 
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("СведТов");
		ЗаписьXML.ЗаписатьАтрибут("НомСтр", Строка(НомерСтроки));
		СтавкаКоэффициент = ЗначенияСервера.ПреобразуемСтавкиНДС(СтрТовар.СтавкаНДС);
		
		Если ЗначениеЗаполнено(СтрТовар.Сумма) И ЗначениеЗаполнено(СтрТовар.СтавкаНДС) Тогда		
			СуммаБезНДС = СтрТовар.Сумма - СтрТовар.СуммаНДС;
			СуммаНДСдоОкругления = СтрТовар.Сумма - СуммаБезНДС;
			СуммаНДСизСуммы = Окр(СуммаНДСдоОкругления, 2);
		КонецЕсли;
		Если ЗначениеЗаполнено(СуммаБезНДС) И ЗначениеЗаполнено(СтрТовар.Количество) Тогда		
			Цена = СуммаБезНДС / СтрТовар.Количество;
		КонецЕсли;
		
		ЗаписьXML.ЗаписатьАтрибут("НаимТов", СокрЛП(СтрТовар.Номенклатура)); 
		ЗаписьXML.ЗаписатьАтрибут("ДефОКЕИ_Тов", "-");  
		
		ЗаписьXML.ЗаписатьАтрибут("КолТов", Строка(СтрЗаменить("0", Символы.НПП,"")));
		ЗаписьXML.ЗаписатьАтрибут("ЦенаТов",Строка(Формат("0","ЧДЦ=2; ЧГ=0; ЧРД=.")));
		ЗаписьXML.ЗаписатьАтрибут("НалСт", СтавкаКоэффициент.Ставка);  
		ЗаписьXML.ЗаписатьАтрибут("СтТовБезНДС", Строка(Формат(СуммаБезНДС,"ЧДЦ=2; ЧГ=0; ЧРД=.")));
		ЗаписьXML.ЗаписатьАтрибут("СтТовУчНал", Строка(Формат(СтрТовар.Сумма,"ЧДЦ=2; ЧГ=0; ЧРД=.")));	    
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("Акциз");
		ЗаписьXML.ЗаписатьНачалоЭлемента("БезАкциз");
		ЗаписьXML.ЗаписатьТекст("без акциза");
		ЗаписьXML.ЗаписатьКонецЭлемента();
		ЗаписьXML.ЗаписатьКонецЭлемента();
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("СумНал"); 
		
		Если СуммаНДСизСуммы > 0 Тогда
			ЗаписьXML.ЗаписатьНачалоЭлемента("СумНал");
			ЗаписьXML.ЗаписатьТекст(Строка(Формат(СуммаНДСизСуммы,"ЧДЦ=2; ЧГ=0; ЧРД=.")));
		ИначеЕсли СуммаНДСизСуммы = 0 Тогда		
			ЗаписьXML.ЗаписатьНачалоЭлемента("БезНДС");
			ЗаписьXML.ЗаписатьТекст("без НДС");
		КонецЕсли;
		ЗаписьXML.ЗаписатьКонецЭлемента();
		ЗаписьXML.ЗаписатьКонецЭлемента();
		
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("ДопСведТов");
		
		ЗаписьXML.ЗаписатьАтрибут("ПрТовРаб", "2");
		ЗаписьXML.ЗаписатьАтрибут("НадлОтп", Строка(СтрЗаменить(СтрТовар.Количество, Символы.НПП,"")));
		
		Если ТипЗнч(СтрТовар.Номенклатура)=Тип("СправочникСсылка.Номенклатура") Тогда
			ЗаписьXML.ЗаписатьАтрибут("НаимЕдИзм", СтрТовар.Номенклатура.ЕдиницаИзмерения.Наименование);
			
			//В поле Артикул всегда выгружаем артикул
			Если НЕ СтрТовар.Номенклатура.Артикул = "" Тогда
				ЗаписьXML.ЗаписатьАтрибут("АртикулТов", Строка(СтрТовар.Номенклатура.Артикул));
			КонецЕсли;
			
			//В поле КодТов выгрузка зависит от настроек:
			//1. В карточке заполнено
			//1.1. В карточке выбран ЧертежныйНомер , то приоритеты в порядке убывания: 	1. Чертежный номер	2. КодКаталога
			//1.2. В карточке выбран Артикул, 		  то приоритеты в порядке убывания: 	1. Артикул,			2. КодКаталога;
			//1.3  В карточке выбран КодКаталога, 	  то приоритеты в порядке убывания:		1. КодКаталога		2. ЧертежныйНомер
			//2. В карточке не заполнено. 			  приоритеты в порядке убывания: 		1. Чертежный номер 	2. Артикул, 		3.КодКаталога. 
			
			КодТов = "";
			Если ДокВыгрузки.Контрагент.ЗаполнениеКодаТовара = "КодКаталога" тогда
				КодТов = ?(ЗначениеЗаполнено(СокрЛП(СтрТовар.Номенклатура.КодКаталога)), СокрЛП(СтрТовар.Номенклатура.КодКаталога), СтрТовар.Номенклатура.ЧертежныйНомер);
			ИначеЕсли ДокВыгрузки.Контрагент.ЗаполнениеКодаТовара = "Артикул" тогда
				КодТов = ?(ЗначениеЗаполнено(СокрЛП(СтрТовар.Номенклатура.Артикул)), СокрЛП(СтрТовар.Номенклатура.Артикул), СтрТовар.Номенклатура.КодКаталога);	
			ИначеЕсли ДокВыгрузки.Контрагент.ЗаполнениеКодаТовара = "ЧертежныйНомер" тогда
				КодТов = ?(ЗначениеЗаполнено(СокрЛП(СтрТовар.Номенклатура.Артикул)), СокрЛП(СтрТовар.Номенклатура.Артикул), СокрЛП(СтрТовар.Номенклатура.КодКаталога));
				КодТов = ?(ЗначениеЗаполнено(СокрЛП(СтрТовар.Номенклатура.ЧертежныйНомер)),СокрЛП(СтрТовар.Номенклатура.ЧертежныйНомер), КодТов);	
			Иначе
				КодТов = ?(ЗначениеЗаполнено(СокрЛП(СтрТовар.Номенклатура.Артикул)), СокрЛП(СтрТовар.Номенклатура.Артикул), СокрЛП(СтрТовар.Номенклатура.КодКаталога));
				КодТов = ?(ЗначениеЗаполнено(СокрЛП(СтрТовар.Номенклатура.ЧертежныйНомер)),СокрЛП(СтрТовар.Номенклатура.ЧертежныйНомер), КодТов);
			КонецЕсли;
			Если КодТов <> "" тогда
				ЗаписьXML.ЗаписатьАтрибут("КодТов", КодТов);   
			КонецЕсли;
		Иначе
			//ЗаписьXML.ЗаписатьАтрибут("НаимЕдИзм", "-");
		КонецЕсли;
		ЗаписьXML.ЗаписатьКонецЭлемента(); 
		ЗаписьXML.ЗаписатьКонецЭлемента();
		
		ИтогКолМест = ИтогКолМест + СтрТовар.Количество; 
		ИтогНетто = ИтогНетто + СтрТовар.Количество;
		ИтогСумБезНДС = ИтогСумБезНДС + СуммаБезНДС;
		ИтогСумНДС = ИтогСумНДС + СтрТовар.СуммаНДС;	
		ИтогСумУчНДС = ИтогСумУчНДС + СтрТовар.Сумма;
	КонецЦикла;
	ИтогСумНДС =0;
	ИтогНетто = 0;
	// Конец табличной части
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("ВсегоОпл");
	
	ЗаписьXML.ЗаписатьАтрибут("СтТовБезНДСВсего", Строка(Формат(ИтогСумБезНДС,"ЧДЦ=2; ЧГ=0; ЧРД=.")));
	ЗаписьXML.ЗаписатьАтрибут("СтТовУчНалВсего", Строка(Формат(ИтогСумУчНДС,"ЧДЦ=2; ЧГ=0; ЧРД=.")));
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("СумНалВсего");
	ЗаписьXML.ЗаписатьНачалоЭлемента("СумНал");
	ЗаписьXML.ЗаписатьТекст("0");
	ЗаписьXML.ЗаписатьКонецЭлемента(); 
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.ЗаписатьКонецЭлемента();
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("СвПродПер");
	ЗаписьXML.ЗаписатьНачалоЭлемента("СвПер");
	ЗаписьXML.ЗаписатьАтрибут("СодОпер", "Товары переданы");
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("ОснПер");
	Если Найти(ДокВыгрузки.ДоговорВзаиморасчетов.Номер,"Оферта")>0 тогда      
		ЗаписьXML.ЗаписатьАтрибут("НаимОсн", "Оферта");
		ЗаписьXML.ЗаписатьАтрибут("НомОсн", Строка(Сред(ДокВыгрузки.ДоговорВзаиморасчетов.Номер,8)));
	Иначе
		ЗаписьXML.ЗаписатьАтрибут("НаимОсн", "Договор");                                     
		ЗаписьXML.ЗаписатьАтрибут("НомОсн", Строка(ДокВыгрузки.ДоговорВзаиморасчетов.Номер));
	КонецЕсли;
	ЗаписьXML.ЗаписатьАтрибут("ДатаОсн", Строка(Формат(ДокВыгрузки.ДоговорВзаиморасчетов.НачПериода, "ДЛФ=Д")));
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	Если ТипЗнч(ДокВыгрузки) = Тип("ДокументСсылка.ЗаказНаряд")
		И ДокВыгрузки.Контрагент.ШаблонСтрокиДанныеТранспортировки = 1 Тогда 
		ЗаписьXML.ЗаписатьНачалоЭлемента("ТранГруз");
		ДатаТранГруз = ?(ЗначениеЗаполнено(ДокВыгрузки.ДатаЗакрытия),ДокВыгрузки.ДатаЗакрытия,ДокВыгрузки.Дата); 
		СтрТранГруз = "Заказ-наряд № "+СокрЛП(ДокВыгрузки.Номер)+" от "+Формат(ДатаТранГруз,"ДЛФ=Д")+" г.";
		ЗаписьXML.ЗаписатьАтрибут("СвТранГруз", СтрТранГруз);
		ЗаписьXML.ЗаписатьКонецЭлемента();
	КонецЕсли;
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("СвПерВещи");
	ЗаписьXML.ЗаписатьКонецЭлемента();
	ЗаписьXML.ЗаписатьКонецЭлемента();
	ЗаписьXML.ЗаписатьНачалоЭлемента("ИнфПолФХЖ3");
	ЗаписьXML.ЗаписатьКонецЭлемента();
	ЗаписьXML.ЗаписатьКонецЭлемента();
	//Подписант
	ЗаписьXML.ЗаписатьНачалоЭлемента("Подписант");
	ЗаписьXML.ЗаписатьАтрибут("ОснПолн", "Должностные обязанности");
	ЗаписьXML.ЗаписатьАтрибут("ОблПолн", "1");
	ЗаписьXML.ЗаписатьАтрибут("Статус", "1");	
	ЗаписьXML.ЗаписатьНачалоЭлемента("ЮЛ");
	
	Если ЗначениеЗаполнено(ДокВыгрузки.Организация.ИНН) Тогда
		ЗаписьXML.ЗаписатьАтрибут("ИННЮЛ", ДокВыгрузки.Организация.ИНН);		
	Иначе 		
		ЗаписьXML.ЗаписатьАтрибут("ИННЮЛ", "0101010108");
	КонецЕсли;
		
	//ПодписантОветственный = "";
	РукФ = "";
	РукИ = "";
	РукО = "";
	Если ЗначениеЗаполнено(ДокВыгрузки.Организация.Руководитель) Тогда
		РукФИО = СтрЗаменить(ДокВыгрузки.Организация.Руководитель, " ", Символы.ПС);
		Если СтрЧислоСтрок(РукФИО) = 3 Тогда
			РукФ = СокрЛП(СтрПолучитьСтроку(РукФИО, 1));
			РукИ = СокрЛП(СтрПолучитьСтроку(РукФИО, 2));
			РукО = СокрЛП(СтрПолучитьСтроку(РукФИО, 3));
		КонецЕсли;			
	КонецЕсли;
	
	ЗаписьXML.ЗаписатьАтрибут("Должн", "Директор");
	ЗаписьXML.ЗаписатьНачалоЭлемента("ФИО");
	ЗаписьXML.ЗаписатьАтрибут("Фамилия", ?(ЗначениеЗаполнено(РукФ),РукФ,"Ф"));
	ЗаписьXML.ЗаписатьАтрибут("Имя", ?(ЗначениеЗаполнено(РукИ),РукИ,"И"));	
	ЗаписьXML.ЗаписатьАтрибут("Отчество", ?(ЗначениеЗаполнено(РукО),РукО,"О"));
	
	ЗаписьXML.ЗаписатьКонецЭлемента();
	ЗаписьXML.ЗаписатьКонецЭлемента();
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.ЗаписатьКонецЭлемента();
	ЗаписьXML.ЗаписатьКонецЭлемента(); 
	
	Возврат ЗаписьXML.Закрыть();
КонецФункции

&НаСервере
Функция ЗН_СформироватьXML_УПД503(ДокВыгрузки) Экспорт
	ИдОтпр = "2BK-0000000000-0000000";
	ИдПол = "2BK-0000000000-0000000000000";  
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ПрослеживаемыеТовары.Номенклатура КАК Номенклатура,
	|	ПрослеживаемыеТовары.РНПТ КАК РНПТ,
	|	ПрослеживаемыеТовары.Количество КАК Количество,
	|	ПрослеживаемыеТовары.КоличествоПрослеживаемости КАК КоличествоПрослеживаемости,
	|	ПрослеживаемыеТовары.СтранаПроисхождения КАК СтранаПроисхождения
	|ИЗ
	|	РегистрНакопления.ПрослеживаемыеТовары КАК ПрослеживаемыеТовары
	|ГДЕ
	|	ПрослеживаемыеТовары.Регистратор = &Регистратор";	
	Запрос.УстановитьПараметр("Регистратор", ДокВыгрузки);
	СведенияОПрослеживаемости = Запрос.Выполнить().Выгрузить();
	Если СведенияОПрослеживаемости.Количество() > 0 тогда 
		ВыводитьРНПТ = Истина;
	Иначе
		ВыводитьРНПТ = Ложь;	
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ЗначенияСвойствКонтрагентов.Значение КАК Значение
	|ИЗ
	|	РегистрСведений.ЗначенияСвойствКонтрагентов КАК ЗначенияСвойствКонтрагентов
	|ГДЕ
	|	ЗначенияСвойствКонтрагентов.Контрагент = &Контрагент
	|	И ЗначенияСвойствКонтрагентов.Свойство = &Свойство";	
	Запрос.УстановитьПараметр("Контрагент", ДокВыгрузки.Контрагент); 
	Запрос.УстановитьПараметр("Свойство", Справочники.ЗначенияСвойствОбъектов.ГрузотправительПрочерк); 
	СвойствоПрочерк = Запрос.Выполнить().Выгрузить();
	Если СвойствоПрочерк.Количество() > 0 тогда 
		ВыводитьПрочерк = Истина;
	Иначе
		ВыводитьПрочерк = Ложь;	
	КонецЕсли;
	
	Если (ДокВыгрузки.Контрагент.ТипКонтрагента=Перечисления.ТипКонтрагента.Ип) ИЛИ (ДокВыгрузки.Контрагент.ТипКонтрагента=Перечисления.ТипКонтрагента.Фл ) Тогда
		КонтрИП = Истина;
	КонецЕсли;
	
	ДатаУПД = ДокВыгрузки.ДатаЗакрытия;
	НомУПД = ?(ЗначениеЗаполнено(ДокВыгрузки.НомерСчф), ДокВыгрузки.НомерСчф, ДокВыгрузки.Номер);	
	
	ОргИП = Ложь;
	БанковскийСчетКонтрагента = ДокВыгрузки.Контрагент.РасчСчет;
	БанковскийСчетФирмы = ДокВыгрузки.Организация.РасчСчет;
	СведенияОПоставщике = ЗначенияСервера.СведенияОЮрФизЛице(ДокВыгрузки.Организация, ДатаУПД);
	СведенияОПокупателе = ЗначенияСервера.СведенияОЮРФизЛице(ДокВыгрузки.Контрагент, ДатаУПД);
	
	Если ДокВыгрузки.Метаданные().Реквизиты.Найти("Получатель") <> Неопределено
		И ЗначениеЗаполнено(ДокВыгрузки.Получатель)
		И ТипЗнч(ДокВыгрузки.Получатель) = Тип("СправочникСсылка.Контрагенты") Тогда
		СведенияОГрузополучателе  = ЗначенияСервера.СведенияОЮрФизЛице(ДокВыгрузки.Получатель,  ДатаУПД);
		ПолучательПоДокументу = ДокВыгрузки.Получатель;
	Иначе
		СведенияОГрузополучателе  = СведенияОПокупателе;
		ПолучательПоДокументу = ДокВыгрузки.Контрагент;
	КонецЕсли;  
	
	СведенияОГрузоотправитель = СведенияОПоставщике;
	
	НовыйУникальныйИдентификатор = Новый УникальныйИдентификатор;
	ДатаДляИндифик = ТекущаяДата();
	Год   = Строка(Формат(ДатаДляИндифик, "ДФ=гггг")); // Год
	Месяц = Строка(Формат(ДатаДляИндифик, "ДФ=ММ"));   // Месяц
	День  = Строка(Формат(ДатаДляИндифик, "ДФ=дд"));   // День
	
	ДатаПреобразоваянная = Год + Месяц + День;
	
	ЗаписьXML = Новый ЗаписьXML;
	
	ЗаписьXML.УстановитьСтроку();
	ЗаписьXML.ЗаписатьОбъявлениеXML();
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("Файл");
	ЗаписьXML.ЗаписатьСоответствиеПространстваИмен("xsd","http://www.w3.org/2001/XMLSchema");
	ЗаписьXML.ЗаписатьСоответствиеПространстваИмен("xsi","http://www.w3.org/2001/XMLSchema-instance");
	
	ЗаписьXML.ЗаписатьАтрибут("ИдФайл", "ON_NSCHFDOPPR_" + ИдПол + "_" + ИдОтпр + "_" + ДатаПреобразоваянная + "_" + НовыйУникальныйИдентификатор);	
	ЗаписьXML.ЗаписатьАтрибут("ВерсФорм", "5.03");
	ЗаписьXML.ЗаписатьАтрибут("ВерсПрог", "Diadoc 1.0");
	ЗаписьXML.ЗаписатьНачалоЭлемента("Документ");	
	ЗаписьXML.ЗаписатьАтрибут("КНД", "1115131"); 	
	ЗаписьXML.ЗаписатьАтрибут("ПоФактХЖ", "Документ об отгрузке товаров (выполнении работ), передаче имущественных прав (документ об оказании услуг)");
	ЗаписьXML.ЗаписатьАтрибут("НаимДокОпр", "УПД");
	ЗаписьXML.ЗаписатьАтрибут("ДатаИнфПр", Формат(ДатаУПД, "ДЛФ=Д"));
	ЗаписьXML.ЗаписатьАтрибут("ВремИнфПр", "00.00.00");
	ЗаписьXML.ЗаписатьАтрибут("НаимЭконСубСост", ДокВыгрузки.Организация.НаименованиеПолное);
	ЗаписьXML.ЗаписатьАтрибут("Функция", "СЧФДОП");
	ЗаписьXML.ЗаписатьНачалоЭлемента("СвСчФакт");
	ЗаписьXML.ЗаписатьАтрибут("НомерДок", НомУПД);
	Если ТипЗнч(ДокВыгрузки) = Тип("ДокументСсылка.ЗаказНаряд") Тогда 
		ЗаписьXML.ЗаписатьАтрибут("ДатаДок", Формат(ДатаУПД, "ДЛФ=Д"));
	Иначе
		ЗаписьXML.ЗаписатьАтрибут("ДатаДок", Формат(ДатаУПД, "ДЛФ=Д"));		
	КонецЕсли;
	
	//Продавец
	ЗаписьXML.ЗаписатьНачалоЭлемента("СвПрод");
	ЗаписьXML.ЗаписатьНачалоЭлемента("ИдСв");
	ЗаписьXML.ЗаписатьНачалоЭлемента("СвЮЛУч"); 
	КППОбособленного = ОбщНазн.ХолдерНаТочкеПолучитьСтруктуру(ДокВыгрузки.Организация,ДокВыгрузки.ТочкаОформления).КПП;
	//ЗаписьXML.ЗаписатьАтрибут("КПП", ДокВыгрузки.Организация.КПП); 
	ЗаписьXML.ЗаписатьАтрибут("КПП", КППОбособленного);
	ЗаписьXML.ЗаписатьАтрибут("НаимОрг", ДокВыгрузки.Организация.НаименованиеПолное);
	ЗаписьXML.ЗаписатьАтрибут("ИННЮЛ", ДокВыгрузки.Организация.ИНН);
	ЗаписьXML.ЗаписатьКонецЭлемента();
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("Адрес");
	ЗаписьXML.ЗаписатьНачалоЭлемента("АдрРФ");
	
	Если ЗначениеЗаполнено(СведенияОПоставщике.ЮридическийАдрес.postal_code) Тогда
		ЗаписьXML.ЗаписатьАтрибут("Индекс", СокрЛП(СведенияОПоставщике.ЮридическийАдрес.postal_code));
	КонецЕсли;
	Если ДокВыгрузки.Организация.Страна.ЭтоСтрана=Ложь тогда
		Если Лев(СокрЛП(ДокВыгрузки.Организация.Страна.Код),1)= "0" тогда
			ЗаписьXML.ЗаписатьАтрибут("КодРегион",Сред(СокрЛП(ДокВыгрузки.Организация.Страна.Код),2));	
		Иначе	
			ЗаписьXML.ЗаписатьАтрибут("КодРегион",СокрЛП(ДокВыгрузки.Организация.Страна.Код));
		КонецЕсли;	
	Иначе 	
		ЗаписьXML.ЗаписатьАтрибут("КодРегион",СокрЛП(ДокВыгрузки.Организация.Страна.КодОКСМ));	
	КонецЕсли;
	ЗаписьXML.ЗаписатьАтрибут("НаимРегион",СокрЛП(СведенияОПоставщике.ЮридическийАдрес.region_with_type));
	
	Если ЗначениеЗаполнено(СведенияОПоставщике.ЮридическийАдрес.city_district_with_type) Тогда
		ЗаписьXML.ЗаписатьАтрибут("Район",СокрЛП(СведенияОПоставщике.ЮридическийАдрес.city_district_with_type));
	КонецЕсли;
	Если ЗначениеЗаполнено(СведенияОПоставщике.ЮридическийАдрес.city_with_type) Тогда
		ЗаписьXML.ЗаписатьАтрибут("Город", СокрЛП(СведенияОПоставщике.ЮридическийАдрес.city_with_type));
	КонецЕсли;
	Если ЗначениеЗаполнено(СведенияОПоставщике.ЮридическийАдрес.settlement_with_type) Тогда
		ЗаписьXML.ЗаписатьАтрибут("НаселПункт", СокрЛП(СведенияОПоставщике.ЮридическийАдрес.settlement_with_type));
	КонецЕсли;
	Если ЗначениеЗаполнено(СведенияОПоставщике.ЮридическийАдрес.street_with_type) Тогда
		ЗаписьXML.ЗаписатьАтрибут("Улица", СокрЛП(СведенияОПоставщике.ЮридическийАдрес.street_with_type));
	КонецЕсли;
	Если ЗначениеЗаполнено(СведенияОПоставщике.ЮридическийАдрес.house) Тогда
		ЗаписьXML.ЗаписатьАтрибут("Дом", СокрЛП(СведенияОПоставщике.ЮридическийАдрес.house));
	КонецЕсли;
	Если ЗначениеЗаполнено(СведенияОПоставщике.ЮридическийАдрес.flat) Тогда
		ЗаписьXML.ЗаписатьАтрибут("Кварт", СокрЛП(СведенияОПоставщике.ЮридическийАдрес.flat));
	КонецЕсли;
	
	ЗаписьXML.ЗаписатьКонецЭлемента();
	ЗаписьXML.ЗаписатьКонецЭлемента();
	Если ЗначениеЗаполнено(СведенияОПоставщике.НомерСчета) Тогда 
		ЗаписьXML.ЗаписатьНачалоЭлемента("БанкРекв");
		ЗаписьXML.ЗаписатьАтрибут("НомерСчета", Строка(СведенияОПоставщике.НомерСчета));
		ЗаписьXML.ЗаписатьНачалоЭлемента("СвБанк");
		ЗаписьXML.ЗаписатьАтрибут("НаимБанк", СведенияОПоставщике.Банк.Наименование);
		ЗаписьXML.ЗаписатьАтрибут("КорСчет", Строка(СведенияОПоставщике.КоррСчет));
		ЗаписьXML.ЗаписатьАтрибут("БИК", Строка(СведенияОПоставщике.БИК));
		ЗаписьXML.ЗаписатьКонецЭлемента();
		ЗаписьXML.ЗаписатьКонецЭлемента();
	КонецЕсли; 	
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	//Продавец
	
	//строка 5а	  
	ЗаписьXML.ЗаписатьНачалоЭлемента("ДокПодтвОтгрНом");
	ЗаписьXML.ЗаписатьАтрибут("РеквНаимДок", "УПД");
	ЗаписьXML.ЗаписатьАтрибут("РеквНомерДок",НомУПД);
	ЗаписьXML.ЗаписатьАтрибут("РеквДатаДок",Формат(ДатаУПД, "ДЛФ=Д"));
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	
	////ГрузОтпр
	// конец ГрузОтпр	
	
	////ГрузПолуч
	// конец Грузопол	 
	
	//СвПокуп
	ЗаписьXML.ЗаписатьНачалоЭлемента("СвПокуп");
	ЗаписьXML.ЗаписатьНачалоЭлемента("ИдСв");
	ЗаписьXML.ЗаписатьНачалоЭлемента("СвЮЛУч");
	
	КПП = ДокВыгрузки.Контрагент.КПП;	//значение по умолчанию  
	ЗаписьXML.ЗаписатьАтрибут("КПП", КПП); 
	
	ЗаписьXML.ЗаписатьАтрибут("НаимОрг", ДокВыгрузки.Контрагент.НаименованиеПолное);
	ЗаписьXML.ЗаписатьАтрибут("ИННЮЛ", ДокВыгрузки.Контрагент.ИНН);
	ЗаписьXML.ЗаписатьКонецЭлемента();
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("Адрес");
	ВыгружатьАдресаКакИностранные = ВыгружатьАдресаКакИностранные(ДокВыгрузки.Организация, ДокВыгрузки.Контрагент);
	
	доступно = СведенияОПокупателе.ЮридическийАдрес.house  = неопределено;
	доступно = доступно или СведенияОПокупателе.ЮридическийАдрес.flat = неопределено;
	доступно = доступно или ВыгружатьАдресаКакИностранные;
	
	Если доступно тогда
		ЗаписьXML.ЗаписатьНачалоЭлемента("АдрИнф");
		ЗаписьXML.ЗаписатьАтрибут("КодСтр","643"); 
		ЗаписьXML.ЗаписатьАтрибут("НаимСтран","Россия");
		ЗаписьXML.ЗаписатьАтрибут("АдрТекст", СокрЛП(СведенияОПокупателе.ЮридическийАдрес.ИсходныйАдрес));	
		ЗаписьXML.ЗаписатьКонецЭлемента();	
	Иначе	
		ЗаписьXML.ЗаписатьНачалоЭлемента("АдрРФ");
		Если ЗначениеЗаполнено(СведенияОПокупателе.ЮридическийАдрес.postal_code) Тогда
			ЗаписьXML.ЗаписатьАтрибут("Индекс", СокрЛП(СведенияОПокупателе.ЮридическийАдрес.postal_code));
		КонецЕсли;
		Если ДокВыгрузки.Контрагент.Страна.ЭтоСтрана=Ложь тогда
			Если Лев(СокрЛП(ДокВыгрузки.Контрагент.Страна.Код),1)= "0" тогда
				ЗаписьXML.ЗаписатьАтрибут("КодРегион",Сред(СокрЛП(ДокВыгрузки.Контрагент.Страна.Код),2));	
			Иначе	
				ЗаписьXML.ЗаписатьАтрибут("КодРегион",СокрЛП(ДокВыгрузки.Контрагент.Страна.Код));
			КонецЕсли;	
		Иначе 	
			ЗаписьXML.ЗаписатьАтрибут("КодРегион",СокрЛП(ДокВыгрузки.Контрагент.Страна.КодОКСМ));
		КонецЕсли; 
		ЗаписьXML.ЗаписатьАтрибут("НаимРегион",СокрЛП(СведенияОПокупателе.ЮридическийАдрес.region_with_type));
		Если ЗначениеЗаполнено(СведенияОПокупателе.ЮридическийАдрес.city_district_with_type) Тогда
			ЗаписьXML.ЗаписатьАтрибут("Район",СокрЛП(СведенияОПокупателе.ЮридическийАдрес.city_district_with_type));
		КонецЕсли;
		Если ЗначениеЗаполнено(СведенияОПокупателе.ЮридическийАдрес.city_with_type) Тогда
			ЗаписьXML.ЗаписатьАтрибут("Город", СокрЛП(СведенияОПокупателе.ЮридическийАдрес.city_with_type));
		КонецЕсли;
		Если ЗначениеЗаполнено(СведенияОПокупателе.ЮридическийАдрес.settlement_with_type) Тогда
			ЗаписьXML.ЗаписатьАтрибут("НаселПункт", СокрЛП(СведенияОПокупателе.ЮридическийАдрес.settlement_with_type));
		КонецЕсли;
		Если ЗначениеЗаполнено(СведенияОПокупателе.ЮридическийАдрес.street_with_type) Тогда
			ЗаписьXML.ЗаписатьАтрибут("Улица", СокрЛП(СведенияОПокупателе.ЮридическийАдрес.street_with_type));
		КонецЕсли;
		Если ЗначениеЗаполнено(СведенияОПокупателе.ЮридическийАдрес.house) Тогда
			ЗаписьXML.ЗаписатьАтрибут("Дом", СокрЛП(СведенияОПокупателе.ЮридическийАдрес.house));
		КонецЕсли;
		Если ЗначениеЗаполнено(СведенияОПокупателе.ФактическийАдрес.block) Тогда
			ЗаписьXML.ЗаписатьАтрибут("Корпус", СведенияОПокупателе.ФактическийАдрес.block);
		КонецЕсли;
		Если ЗначениеЗаполнено(СведенияОПокупателе.ЮридическийАдрес.flat) Тогда
			ЗаписьXML.ЗаписатьАтрибут("Кварт", СокрЛП(СведенияОПокупателе.ЮридическийАдрес.flat));
		КонецЕсли;		
		ЗаписьXML.ЗаписатьКонецЭлемента();
	КонецЕсли;	
	ЗаписьXML.ЗаписатьКонецЭлемента();        
	
	Если ЗначениеЗаполнено(СведенияОПокупателе.НомерСчета) Тогда 
		ЗаписьXML.ЗаписатьНачалоЭлемента("БанкРекв");
		ЗаписьXML.ЗаписатьАтрибут("НомерСчета", Строка(СведенияОПокупателе.НомерСчета));
		ЗаписьXML.ЗаписатьНачалоЭлемента("СвБанк");
		ЗаписьXML.ЗаписатьАтрибут("НаимБанк", СведенияОПокупателе.Банк.Наименование);
		ЗаписьXML.ЗаписатьАтрибут("КорСчет", Строка(СведенияОПокупателе.КоррСчет));
		ЗаписьXML.ЗаписатьАтрибут("БИК", Строка(СведенияОПокупателе.БИК));
		ЗаписьXML.ЗаписатьКонецЭлемента();
		ЗаписьXML.ЗаписатьКонецЭлемента();
	КонецЕсли; 	
	ЗаписьXML.ЗаписатьКонецЭлемента();	
	// конец СвПокуп	
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("ДенИзм");
	ЗаписьXML.ЗаписатьАтрибут("КодОКВ", Строка("643"));
	ЗаписьXML.ЗаписатьАтрибут("НаимОКВ", Строка("Российский рубль"));
	ЗаписьXML.ЗаписатьКонецЭлемента(); 
	//Авансовый СЧФ
	XMLУПД2026 = Константы.XMLУПД2026.Получить();
	ТзАвСФ = ЗначенияСервера.ПолучитьАвансовыСчетФактуру(ДокВыгрузки);
	Если XMLУПД2026 и ТзАвСФ.Количество()>0 Тогда
		ЗаписьXML.ЗаписатьНачалоЭлемента("ДопСвФХЖ1");
		//СопрДокФХЖ РеквНаимДок="АСЧФ" РеквНомерДок="000002" РеквДатаДок="02.01.2026"
		Для Каждого Стр Из ТзАвСФ Цикл
			ЗаписьXML.ЗаписатьНачалоЭлемента("СопрДокФХЖ");
			ЗаписьXML.ЗаписатьАтрибут("РеквНаимДок", "АСЧФ");
			ЗаписьXML.ЗаписатьАтрибут("РеквНомерДок", Строка(Стр.НомерДокумента));
			ЗаписьXML.ЗаписатьАтрибут("РеквДатаДок", Формат(Стр.ДатаДокумента, "ДЛФ=Д"));
			ЗаписьXML.ЗаписатьКонецЭлемента();
		КонецЦикла;
		
		ЗаписьXML.ЗаписатьКонецЭлемента();
	КонецЕсли;	
	ЗаписьXML.ЗаписатьКонецЭлемента(); 
	
	//Табличная часть
	ЗаписьXML.ЗаписатьНачалоЭлемента("ТаблСчФакт");
	НомерСтроки = 0;
	ИтогКолМест = 0;
	ИтогБрутто = 0;
	ИтогНетто = 0;
	ИтогСумБезНДС = 0;
	ИтогСумНДС = 0;
	ИтогСумУчНДС = 0;  
	
	Если ЗначенияСервера.ПолучитьЗначениеСвойстваДоговора(Справочники.ЗначенияСвойствОбъектов.ДетальныйУПД_ЗН,ДокВыгрузки.ДоговорВзаиморасчетов) = Истина Тогда
		ДанныеТоваров = ТабРаботТоваровЗН(ДокВыгрузки);
	Иначе
		ДанныеТоваров = Новый Массив; 
		
		УчетнаяДата = ?(ЗначениеЗаполнено(ДокВыгрузки.ДатаЗакрытия),ДокВыгрузки.ДатаЗакрытия,ДокВыгрузки.Дата);
		ДокДата = СокрЛП(Формат(УчетнаяДата,"ДЛФ=DD"));
		
		НаименованиеУслуги = "Оказание услуг по ремонту и обслуживанию автотранспортного средства " + СокрЛП(ПечатныеФормы.СформироватьМодельАвтомобиляДляПечатнойФормы(ДокВыгрузки.ДокументОснование.Автомобиль));
		НаименованиеУслуги = НаименованиеУслуги + ", по заказ-наряду № " + ВРег(СокрЛП(ДокВыгрузки.Номер)) + " от " + ДокДата;
		
		стрТовар = Новый Структура;
		стрТовар.Вставить("Номенклатура", НаименованиеУслуги);
		стрТовар.Вставить("Количество", 1); 
		стрТовар.Вставить("Сумма", ДокВыгрузки.СуммаДокумента);
		стрТовар.Вставить("СуммаНДС", ДокВыгрузки.СуммаНДС);
		стрТовар.Вставить("СтавкаНДС", ДокВыгрузки.СтавкаНДС);
		
		ДанныеТоваров.Добавить(стрТовар);
	КонецЕсли;
	
	Для Каждого стрТовар из ДанныеТоваров цикл
		ХарактеристикаДляПоиска = "";
		НомерСтроки = НомерСтроки + 1; 
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("СведТов");
		ЗаписьXML.ЗаписатьАтрибут("НомСтр", Строка(НомерСтроки));
		СтавкаКоэффициент = ЗначенияСервера.ПреобразуемСтавкиНДС(СтрТовар.СтавкаНДС);
		
		Если ЗначениеЗаполнено(СтрТовар.Сумма) И ЗначениеЗаполнено(СтрТовар.СтавкаНДС) Тогда		
			СуммаБезНДС = СтрТовар.Сумма - СтрТовар.СуммаНДС;
			СуммаНДСдоОкругления = СтрТовар.Сумма - СуммаБезНДС;
			СуммаНДСизСуммы = Окр(СуммаНДСдоОкругления, 2);
		КонецЕсли;
		Если ЗначениеЗаполнено(СуммаБезНДС) И ЗначениеЗаполнено(СтрТовар.Количество) Тогда		
			Цена = СуммаБезНДС / СтрТовар.Количество;
		КонецЕсли;
		ЗаписьXML.ЗаписатьАтрибут("НаимТов", СокрЛП(СтрТовар.Номенклатура));
		
		Если ТипЗнч(СтрТовар.Номенклатура)=Тип("СправочникСсылка.Номенклатура") Тогда
			ЗаписьXML.ЗаписатьАтрибут("ОКЕИ_Тов", СокрЛП(СтрТовар.Номенклатура.ЕдиницаИзмерения.Код)); 
			ЗаписьXML.ЗаписатьАтрибут("НаимЕдИзм", СокрЛП(СтрТовар.Номенклатура.ЕдиницаИзмерения));
		КонецЕсли;
		
		ЗаписьXML.ЗаписатьАтрибут("КолТов", Строка(СтрЗаменить(Формат(СтрТовар.Количество,"ЧГ=0; ЧРД=."), Символы.НПП,"")));
		ЗаписьXML.ЗаписатьАтрибут("ЦенаТов",Строка(Формат(Цена,"ЧДЦ=2; ЧГ=0; ЧРД=.")));
		ЗаписьXML.ЗаписатьАтрибут("НалСт", СтавкаКоэффициент.Ставка);  
		ЗаписьXML.ЗаписатьАтрибут("СтТовБезНДС", Строка(Формат(СуммаБезНДС,"ЧДЦ=2; ЧГ=0; ЧРД=.")));
		ЗаписьXML.ЗаписатьАтрибут("СтТовУчНал", Строка(Формат(СтрТовар.Сумма,"ЧДЦ=2; ЧГ=0; ЧРД=.")));
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("ДопСведТов");
		Если ТипЗнч(СтрТовар.Номенклатура) = Тип("СправочникСсылка.Номенклатура") Тогда
			ЗаписьXML.ЗаписатьАтрибут("ПрТовРаб", "1");
			ЗаписьXML.ЗаписатьАтрибут("КодТов", СокрЛП(?(СокрЛП(СтрТовар.Номенклатура.Артикул)="",СтрТовар.Номенклатура.КодКаталога,СтрТовар.Номенклатура.Артикул)));
		Иначе	
			ЗаписьXML.ЗаписатьАтрибут("ПрТовРаб", "2");	
		КонецЕсли;
		ЗаписьXML.ЗаписатьКонецЭлемента();		
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("Акциз");
		ЗаписьXML.ЗаписатьНачалоЭлемента("БезАкциз");
		ЗаписьXML.ЗаписатьТекст("без акциза");
		ЗаписьXML.ЗаписатьКонецЭлемента();
		ЗаписьXML.ЗаписатьКонецЭлемента();
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("СумНал"); 
		
		Если СуммаНДСизСуммы > 0 Тогда
			ЗаписьXML.ЗаписатьНачалоЭлемента("СумНал");
			ЗаписьXML.ЗаписатьТекст(Строка(Формат(СуммаНДСизСуммы,"ЧДЦ=2; ЧГ=0; ЧРД=.")));
		ИначеЕсли СуммаНДСизСуммы = 0 Тогда		
			ЗаписьXML.ЗаписатьНачалоЭлемента("БезНДС");
			ЗаписьXML.ЗаписатьТекст("без НДС");
		КонецЕсли;
		ЗаписьXML.ЗаписатьКонецЭлемента();
		ЗаписьXML.ЗаписатьКонецЭлемента();
		
		ЗаписьXML.ЗаписатьКонецЭлемента();
		ИтогКолМест = ИтогКолМест + СтрТовар.Количество; 
		ИтогНетто = ИтогНетто + СтрТовар.Количество;
		ИтогСумБезНДС = ИтогСумБезНДС + СуммаБезНДС;
		ИтогСумНДС = ИтогСумНДС + СтрТовар.СуммаНДС;	
		ИтогСумУчНДС = ИтогСумУчНДС + СтрТовар.Сумма;		
	КонецЦикла;	
	// Конец табличной части
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("ВсегоОпл");
	ЗаписьXML.ЗаписатьАтрибут("СтТовБезНДСВсего", Строка(Формат(ИтогСумБезНДС,"ЧДЦ=2; ЧГ=0; ЧРД=.")));
	ЗаписьXML.ЗаписатьАтрибут("СтТовУчНалВсего", Строка(Формат(ИтогСумУчНДС,"ЧДЦ=2; ЧГ=0; ЧРД=.")));
	ЗаписьXML.ЗаписатьАтрибут("КолНеттоВс","0" );	
	ЗаписьXML.ЗаписатьНачалоЭлемента("СумНалВсего");
	Если ИтогСумНДС > 0 Тогда
		ЗаписьXML.ЗаписатьНачалоЭлемента("СумНал");
		ЗаписьXML.ЗаписатьТекст(Строка(Формат(ИтогСумНДС,"ЧДЦ=2; ЧГ=0; ЧРД=."))); 
	Иначе
		ЗаписьXML.ЗаписатьНачалоЭлемента("БезНДС");
		ЗаписьXML.ЗаписатьТекст("без НДС");
	КонецЕсли;
	
	ЗаписьXML.ЗаписатьКонецЭлемента();
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.ЗаписатьКонецЭлемента();
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("СвПродПер");
	ЗаписьXML.ЗаписатьНачалоЭлемента("СвПер");
	ЗаписьXML.ЗаписатьАтрибут("СодОпер", "Товары переданы"); 
	ЗаписьXML.ЗаписатьАтрибут("ДатаПер", Формат(ДатаУПД, "ДЛФ=Д"));
	ЗаписьXML.ЗаписатьНачалоЭлемента("ОснПер");
	Если ЗначениеЗаполнено(ДокВыгрузки.ДоговорВзаиморасчетов) Тогда 
		ЗаписьXML.ЗаписатьАтрибут("РеквНаимДок", "Договор");                                     
		ЗаписьXML.ЗаписатьАтрибут("РеквНомерДок", Строка(ДокВыгрузки.ДоговорВзаиморасчетов.Номер));
		ЗаписьXML.ЗаписатьАтрибут("РеквДатаДок", Строка(Формат(ДокВыгрузки.ДоговорВзаиморасчетов.НачПериода, "ДЛФ=Д")));
	Иначе 
		ЗаписьXML.ЗаписатьАтрибут("РеквНаимДок", "Заказ-наряд");                                     
		ЗаписьXML.ЗаписатьАтрибут("РеквНомерДок", Строка(ДокВыгрузки.Номер));
		ЗаписьXML.ЗаписатьАтрибут("РеквДатаДок", Строка(Формат(ДокВыгрузки.ДатаЗакрытия, "ДЛФ=Д")));
	КонецЕсли;	
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	Если ТипЗнч(ДокВыгрузки) = Тип("ДокументСсылка.ЗаказНаряд")
		И ДокВыгрузки.Контрагент.ШаблонСтрокиДанныеТранспортировки = 1 Тогда 
		ЗаписьXML.ЗаписатьНачалоЭлемента("ТранГруз");
		ДатаТранГруз = ?(ЗначениеЗаполнено(ДокВыгрузки.ДатаЗакрытия),ДокВыгрузки.ДатаЗакрытия,ДокВыгрузки.Дата); 
		СтрТранГруз = "Заказ-наряд № "+СокрЛП(ДокВыгрузки.Номер)+" от "+Формат(ДатаТранГруз,"ДЛФ=Д")+" г.";
		ЗаписьXML.ЗаписатьАтрибут("СвТранГруз", СтрТранГруз);
		ЗаписьXML.ЗаписатьКонецЭлемента();
	КонецЕсли;
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("СвПерВещи");
	ЗаписьXML.ЗаписатьКонецЭлемента();
	ЗаписьXML.ЗаписатьКонецЭлемента();
	ЗаписьXML.ЗаписатьНачалоЭлемента("ИнфПолФХЖ3");
	ЗаписьXML.ЗаписатьКонецЭлемента();
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	//Подписант
	ЗаписьXML.ЗаписатьНачалоЭлемента("Подписант");
	ЗаписьXML.ЗаписатьАтрибут("ОснПолн", "Должностные обязанности");
	ЗаписьXML.ЗаписатьАтрибут("ОблПолн", "1");
	ЗаписьXML.ЗаписатьАтрибут("Статус", "1");	
	ЗаписьXML.ЗаписатьНачалоЭлемента("ЮЛ");
	
	Если ЗначениеЗаполнено(ДокВыгрузки.Организация.ИНН) Тогда
		ЗаписьXML.ЗаписатьАтрибут("ИННЮЛ", ДокВыгрузки.Организация.ИНН);		
	Иначе 		
		ЗаписьXML.ЗаписатьАтрибут("ИННЮЛ", "0101010108");
	КонецЕсли;
	
	//ПодписантОветственный = "";
	РукФ = "";
	РукИ = "";
	РукО = "";
	Если ЗначениеЗаполнено(ДокВыгрузки.Организация.Руководитель) Тогда
		РукФИО = СтрЗаменить(ДокВыгрузки.Организация.Руководитель, " ", Символы.ПС);
		Если СтрЧислоСтрок(РукФИО) = 3 Тогда
			РукФ = СокрЛП(СтрПолучитьСтроку(РукФИО, 1));
			РукИ = СокрЛП(СтрПолучитьСтроку(РукФИО, 2));
			РукО = СокрЛП(СтрПолучитьСтроку(РукФИО, 3));
		КонецЕсли;			
	КонецЕсли;
	ЗаписьXML.ЗаписатьАтрибут("Должн", "Директор");
	ЗаписьXML.ЗаписатьНачалоЭлемента("ФИО");
	ЗаписьXML.ЗаписатьАтрибут("Фамилия", ?(ЗначениеЗаполнено(РукФ),РукФ,"Ф"));
	ЗаписьXML.ЗаписатьАтрибут("Имя", ?(ЗначениеЗаполнено(РукИ),РукИ,"И"));	
	ЗаписьXML.ЗаписатьАтрибут("Отчество", ?(ЗначениеЗаполнено(РукО),РукО,"О"));
	
	ЗаписьXML.ЗаписатьКонецЭлемента();
	ЗаписьXML.ЗаписатьКонецЭлемента();
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.ЗаписатьКонецЭлемента();
	ЗаписьXML.ЗаписатьКонецЭлемента(); 
	
	Возврат ЗаписьXML.Закрыть();
КонецФункции

&НаСервере
Функция ТабРаботТоваровЗН(ДокВыгрузки)
	ДанныеТоваров = Новый Массив;
	
	Для Каждого текРабота Из ДокВыгрузки.Работы Цикл
		стрТовар = Новый Структура;
		стрТовар.Вставить("Номенклатура", текРабота.Работа);
		стрТовар.Вставить("Количество", текРабота.Количество); 
		стрТовар.Вставить("Сумма", текРабота.Сумма);
		стрТовар.Вставить("СуммаНДС", Конвертация.НдсОтСуммыПолучить(текРабота.Сумма, ДокВыгрузки.СтавкаНДС));
		стрТовар.Вставить("СтавкаНДС", ДокВыгрузки.СтавкаНДС);
		стрТовар.Вставить("ЭтоРабота", ИСТИНА);
    	ДанныеТоваров.Добавить(стрТовар);
						
		МассивТоваров = ДокВыгрузки.Товары.НайтиСтроки(Новый Структура("Работа", текРабота.Работа));
		Для Каждого текТовар Из МассивТоваров Цикл
			стрТовар = Новый Структура;
			стрТовар.Вставить("Номенклатура", текТовар.Номенклатура);
			стрТовар.Вставить("Количество", текТовар.Количество); 
			стрТовар.Вставить("Сумма", текТовар.Сумма);
			стрТовар.Вставить("СуммаНДС", Конвертация.НдсОтСуммыПолучить(текТовар.Сумма, ДокВыгрузки.СтавкаНДС));
			стрТовар.Вставить("СтавкаНДС", ДокВыгрузки.СтавкаНДС);
			стрТовар.Вставить("ЭтоРабота", ЛОЖЬ);
			ДанныеТоваров.Добавить(стрТовар);
		КонецЦикла;	 
	КонецЦикла;
	
	Возврат ДанныеТоваров;
КонецФункции

&НаСервере
Функция ТабРаботПодрядовЗН(ДокВыгрузки,ДанныеТоваров)
	Для Каждого текРабота Из ДокВыгрузки.Подряды Цикл
		стрТовар = Новый Структура;
		стрТовар.Вставить("Номенклатура", текРабота.Работа);
		стрТовар.Вставить("Количество", текРабота.Количество); 
		стрТовар.Вставить("Сумма", текРабота.Сумма);
		стрТовар.Вставить("СуммаНДС", Конвертация.НдсОтСуммыПолучить(текРабота.Сумма, ДокВыгрузки.СтавкаНДС));
		стрТовар.Вставить("СтавкаНДС", ДокВыгрузки.СтавкаНДС);
		стрТовар.Вставить("ЭтоРабота", ИСТИНА);
		ДанныеТоваров.Добавить(стрТовар);
	КонецЦикла;
	
	Возврат ДанныеТоваров;
КонецФункции

&НаСервере
Функция Реализация_СформироватьXML_УПД503АктСводный(ДокВыгрузки) Экспорт
	ИдОтпр = "2BK-0000000000-0000000";
	ИдПол = "2BK-0000000000-0000000000000";  
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПрослеживаемыеТовары.Номенклатура КАК Номенклатура,
	|	ПрослеживаемыеТовары.РНПТ КАК РНПТ,
	|	ПрослеживаемыеТовары.Количество КАК Количество,
	|	ПрослеживаемыеТовары.КоличествоПрослеживаемости КАК КоличествоПрослеживаемости,
	|	ПрослеживаемыеТовары.СтранаПроисхождения КАК СтранаПроисхождения
	|ИЗ
	|	РегистрНакопления.ПрослеживаемыеТовары КАК ПрослеживаемыеТовары
	|ГДЕ
	|	ПрослеживаемыеТовары.Регистратор = &Регистратор";
	
	Запрос.УстановитьПараметр("Регистратор", ДокВыгрузки);
	СведенияОПрослеживаемости = Запрос.Выполнить().Выгрузить();
	
	Если СведенияОПрослеживаемости.Количество() > 0 тогда 
		ВыводитьРНПТ = Истина;
	Иначе
		ВыводитьРНПТ = Ложь;	
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗначенияСвойствКонтрагентов.Значение КАК Значение
	|ИЗ
	|	РегистрСведений.ЗначенияСвойствКонтрагентов КАК ЗначенияСвойствКонтрагентов
	|ГДЕ
	|	ЗначенияСвойствКонтрагентов.Контрагент = &Контрагент
	|	И ЗначенияСвойствКонтрагентов.Свойство = &Свойство";
	
	Запрос.УстановитьПараметр("Контрагент", ДокВыгрузки.Контрагент); 
	Запрос.УстановитьПараметр("Свойство", Справочники.ЗначенияСвойствОбъектов.ГрузотправительПрочерк); 
	СвойствоПрочерк = Запрос.Выполнить().Выгрузить();
	
	Если СвойствоПрочерк.Количество() > 0 тогда 
		ВыводитьПрочерк = Истина;
	Иначе
		ВыводитьПрочерк = Ложь;	
	КонецЕсли;
	
	
	
	
	
	Если (ДокВыгрузки.Контрагент.ТипКонтрагента=Перечисления.ТипКонтрагента.Ип) ИЛИ (ДокВыгрузки.Контрагент.ТипКонтрагента=Перечисления.ТипКонтрагента.Фл ) Тогда
		КонтрИП = Истина;
	КонецЕсли;
	
	Если ТипЗнч(ДокВыгрузки) = Тип("ДокументСсылка.ЗаказНаряд") Тогда 
		ДатаУПД = ДокВыгрузки.ДатаЗакрытия;
	Иначе
		ДатаУПД = ДокВыгрузки.Дата;
	КонецЕсли;
	
	НомУПД = ?(ЗначениеЗаполнено(ДокВыгрузки.НомерСчф), ДокВыгрузки.НомерСчф, ДокВыгрузки.Номер);	
	
	
	ОргИП = Ложь;
	БанковскийСчетКонтрагента = ДокВыгрузки.Контрагент.РасчСчет;
	БанковскийСчетФирмы = ДокВыгрузки.Организация.РасчСчет;
	СведенияОПоставщике = ЗначенияСервера.СведенияОЮрФизЛице(ДокВыгрузки.Организация, ДатаУПД);
	СведенияОПокупателе = ЗначенияСервера.СведенияОЮРФизЛице(ДокВыгрузки.Контрагент, ДатаУПД);
	
	Если ДокВыгрузки.Метаданные().Реквизиты.Найти("Получатель")<>Неопределено И ЗначениеЗаполнено(ДокВыгрузки.Получатель) и ТипЗнч(ДокВыгрузки.Получатель) = Тип("СправочникСсылка.Контрагенты") тогда
		СведенияОГрузополучателе  = ЗначенияСервера.СведенияОЮрФизЛице(ДокВыгрузки.Получатель,  ДатаУПД);
		ПолучательПоДокументу = ДокВыгрузки.Получатель;
	Иначе
		СведенияОГрузополучателе  = СведенияОПокупателе;
		ПолучательПоДокументу = ДокВыгрузки.Контрагент;
	КонецЕсли;  
	
	СведенияОГрузоотправитель = СведенияОПоставщике;
	
	НовыйУникальныйИдентификатор = Новый УникальныйИдентификатор;
	ДатаДляИндифик = ТекущаяДата();
	Год   = Строка(Формат(ДатаДляИндифик, "ДФ=гггг")); // Год
	Месяц = Строка(Формат(ДатаДляИндифик, "ДФ=ММ"));   // Месяц
	День  = Строка(Формат(ДатаДляИндифик, "ДФ=дд"));   // День
	
	ДатаПреобразоваянная = Год + Месяц + День;
	
	ЗаписьXML = Новый ЗаписьXML;
	
	ЗаписьXML.УстановитьСтроку();
	ЗаписьXML.ЗаписатьОбъявлениеXML();
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("Файл");
	ЗаписьXML.ЗаписатьСоответствиеПространстваИмен("xsd","http://www.w3.org/2001/XMLSchema");
	ЗаписьXML.ЗаписатьСоответствиеПространстваИмен("xsi","http://www.w3.org/2001/XMLSchema-instance");
	
	ЗаписьXML.ЗаписатьАтрибут("ИдФайл", "ON_NSCHFDOPPR_" + ИдПол + "_" + ИдОтпр + "_" + ДатаПреобразоваянная + "_" + НовыйУникальныйИдентификатор);	
	ЗаписьXML.ЗаписатьАтрибут("ВерсФорм", "5.03");
	ЗаписьXML.ЗаписатьАтрибут("ВерсПрог", "Diadoc 1.0");
	ЗаписьXML.ЗаписатьНачалоЭлемента("Документ");	
	ЗаписьXML.ЗаписатьАтрибут("КНД", "1115131"); 	
	ЗаписьXML.ЗаписатьАтрибут("ПоФактХЖ", "Документ об отгрузке товаров (выполнении работ), передаче имущественных прав (документ об оказании услуг)");
	ЗаписьXML.ЗаписатьАтрибут("НаимДокОпр", "УПД");
	ЗаписьXML.ЗаписатьАтрибут("ДатаИнфПр", Формат(ДатаУПД, "ДЛФ=Д"));
	ЗаписьXML.ЗаписатьАтрибут("ВремИнфПр", "00.00.00");
	ЗаписьXML.ЗаписатьАтрибут("НаимЭконСубСост", ДокВыгрузки.Организация.НаименованиеПолное);
	ЗаписьXML.ЗаписатьАтрибут("Функция", "СЧФДОП");
	ЗаписьXML.ЗаписатьНачалоЭлемента("СвСчФакт");
	ЗаписьXML.ЗаписатьАтрибут("НомерДок", НомУПД);
	Если ТипЗнч(ДокВыгрузки) = Тип("ДокументСсылка.ЗаказНаряд") Тогда 
		ЗаписьXML.ЗаписатьАтрибут("ДатаДок", Формат(ДатаУПД, "ДЛФ=Д"));
	Иначе
		ЗаписьXML.ЗаписатьАтрибут("ДатаДок", Формат(ДатаУПД, "ДЛФ=Д"));   
		
	КонецЕсли;
	
	
	//Продавец
	ЗаписьXML.ЗаписатьНачалоЭлемента("СвПрод");
	ЗаписьXML.ЗаписатьНачалоЭлемента("ИдСв");
	ЗаписьXML.ЗаписатьНачалоЭлемента("СвЮЛУч");  
	ЗаписьXML.ЗаписатьАтрибут("КПП", ДокВыгрузки.Организация.КПП);
	ЗаписьXML.ЗаписатьАтрибут("НаимОрг", ДокВыгрузки.Организация.НаименованиеПолное);
	ЗаписьXML.ЗаписатьАтрибут("ИННЮЛ", ДокВыгрузки.Организация.ИНН);
	ЗаписьXML.ЗаписатьКонецЭлемента();
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("Адрес");
	ЗаписьXML.ЗаписатьНачалоЭлемента("АдрРФ");
	
	Если ЗначениеЗаполнено(СведенияОПоставщике.ЮридическийАдрес.postal_code) Тогда
		ЗаписьXML.ЗаписатьАтрибут("Индекс", СокрЛП(СведенияОПоставщике.ЮридическийАдрес.postal_code));
	КонецЕсли;
	Если ДокВыгрузки.Организация.Страна.ЭтоСтрана=Ложь тогда
		Если Лев(СокрЛП(ДокВыгрузки.Организация.Страна.Код),1)= "0" тогда
			ЗаписьXML.ЗаписатьАтрибут("КодРегион",Сред(СокрЛП(ДокВыгрузки.Организация.Страна.Код),2));	
		Иначе	
			ЗаписьXML.ЗаписатьАтрибут("КодРегион",СокрЛП(ДокВыгрузки.Организация.Страна.Код));
		КонецЕсли;	
	Иначе 	
		ЗаписьXML.ЗаписатьАтрибут("КодРегион",СокрЛП(ДокВыгрузки.Организация.Страна.КодОКСМ));	
	КонецЕсли;
	ЗаписьXML.ЗаписатьАтрибут("НаимРегион",СокрЛП(СведенияОПоставщике.ЮридическийАдрес.region_with_type));
	
	Если ЗначениеЗаполнено(СведенияОПоставщике.ЮридическийАдрес.city_district_with_type) Тогда
		ЗаписьXML.ЗаписатьАтрибут("Район",СокрЛП(СведенияОПоставщике.ЮридическийАдрес.city_district_with_type));
	КонецЕсли;
	Если ЗначениеЗаполнено(СведенияОПоставщике.ЮридическийАдрес.city_with_type) Тогда
		ЗаписьXML.ЗаписатьАтрибут("Город", СокрЛП(СведенияОПоставщике.ЮридическийАдрес.city_with_type));
	КонецЕсли;
	Если ЗначениеЗаполнено(СведенияОПоставщике.ЮридическийАдрес.settlement_with_type) Тогда
		ЗаписьXML.ЗаписатьАтрибут("НаселПункт", СокрЛП(СведенияОПоставщике.ЮридическийАдрес.settlement_with_type));
	КонецЕсли;
	Если ЗначениеЗаполнено(СведенияОПоставщике.ЮридическийАдрес.street_with_type) Тогда
		ЗаписьXML.ЗаписатьАтрибут("Улица", СокрЛП(СведенияОПоставщике.ЮридическийАдрес.street_with_type));
	КонецЕсли;
	Если ЗначениеЗаполнено(СведенияОПоставщике.ЮридическийАдрес.house) Тогда
		ЗаписьXML.ЗаписатьАтрибут("Дом", СокрЛП(СведенияОПоставщике.ЮридическийАдрес.house));
	КонецЕсли;
	Если ЗначениеЗаполнено(СведенияОПоставщике.ЮридическийАдрес.flat) Тогда
		ЗаписьXML.ЗаписатьАтрибут("Кварт", СокрЛП(СведенияОПоставщике.ЮридическийАдрес.flat));
	КонецЕсли;
	
	ЗаписьXML.ЗаписатьКонецЭлемента();
	ЗаписьXML.ЗаписатьКонецЭлемента();
	Если ЗначениеЗаполнено(СведенияОПоставщике.НомерСчета) Тогда 
		ЗаписьXML.ЗаписатьНачалоЭлемента("БанкРекв");
		ЗаписьXML.ЗаписатьАтрибут("НомерСчета", Строка(СведенияОПоставщике.НомерСчета));
		ЗаписьXML.ЗаписатьНачалоЭлемента("СвБанк");
		ЗаписьXML.ЗаписатьАтрибут("НаимБанк", СведенияОПоставщике.Банк.Наименование);
		ЗаписьXML.ЗаписатьАтрибут("КорСчет", Строка(СведенияОПоставщике.КоррСчет));
		ЗаписьXML.ЗаписатьАтрибут("БИК", Строка(СведенияОПоставщике.БИК));
		ЗаписьXML.ЗаписатьКонецЭлемента();
		ЗаписьXML.ЗаписатьКонецЭлемента();
	КонецЕсли; 	
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	//Продавец	
	
	////ГрузОтпр
		// конец ГрузОтпр	
	
	////ГрузПолуч
		
	// конец Грузопол	 
	
	//СвПокуп
	ЗаписьXML.ЗаписатьНачалоЭлемента("СвПокуп");
	ЗаписьXML.ЗаписатьНачалоЭлемента("ИдСв");
	ЗаписьXML.ЗаписатьНачалоЭлемента("СвЮЛУч");
	
	КПП = ДокВыгрузки.Контрагент.КПП;	//значение по умолчанию  
	ЗаписьXML.ЗаписатьАтрибут("КПП", КПП); 
	
	ЗаписьXML.ЗаписатьАтрибут("НаимОрг", ДокВыгрузки.Контрагент.НаименованиеПолное);
	ЗаписьXML.ЗаписатьАтрибут("ИННЮЛ", ДокВыгрузки.Контрагент.ИНН);
	ЗаписьXML.ЗаписатьКонецЭлемента();
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("Адрес");
	ВыгружатьАдресаКакИностранные = ВыгружатьАдресаКакИностранные(ДокВыгрузки.Организация, ДокВыгрузки.Контрагент);
	
	доступно = СведенияОПокупателе.ЮридическийАдрес.house  = неопределено;
	доступно = доступно или СведенияОПокупателе.ЮридическийАдрес.flat = неопределено;
	доступно = доступно или ВыгружатьАдресаКакИностранные;
	
	Если доступно тогда
		ЗаписьXML.ЗаписатьНачалоЭлемента("АдрИнф");
		ЗаписьXML.ЗаписатьАтрибут("КодСтр","643"); 
	    ЗаписьXML.ЗаписатьАтрибут("НаимСтран","Россия");
		ЗаписьXML.ЗаписатьАтрибут("АдрТекст", СокрЛП(СведенияОПокупателе.ЮридическийАдрес.ИсходныйАдрес));	
		
		ЗаписьXML.ЗаписатьКонецЭлемента();	
		
	Иначе	
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("АдрРФ");
		
		Если ЗначениеЗаполнено(СведенияОПокупателе.ЮридическийАдрес.postal_code) Тогда
			ЗаписьXML.ЗаписатьАтрибут("Индекс", СокрЛП(СведенияОПокупателе.ЮридическийАдрес.postal_code));
		КонецЕсли;
		Если ДокВыгрузки.Контрагент.Страна.ЭтоСтрана=Ложь тогда
			Если Лев(СокрЛП(ДокВыгрузки.Контрагент.Страна.Код),1)= "0" тогда
				ЗаписьXML.ЗаписатьАтрибут("КодРегион",Сред(СокрЛП(ДокВыгрузки.Контрагент.Страна.Код),2));	
			Иначе	
				ЗаписьXML.ЗаписатьАтрибут("КодРегион",СокрЛП(ДокВыгрузки.Контрагент.Страна.Код));
			КонецЕсли;	
		Иначе 	
			ЗаписьXML.ЗаписатьАтрибут("КодРегион",СокрЛП(ДокВыгрузки.Контрагент.Страна.КодОКСМ));
		КонецЕсли; 
		ЗаписьXML.ЗаписатьАтрибут("НаимРегион",СокрЛП(СведенияОПокупателе.ЮридическийАдрес.region_with_type));
		Если ЗначениеЗаполнено(СведенияОПокупателе.ЮридическийАдрес.city_district_with_type) Тогда
			ЗаписьXML.ЗаписатьАтрибут("Район",СокрЛП(СведенияОПокупателе.ЮридическийАдрес.city_district_with_type));
		КонецЕсли;
		Если ЗначениеЗаполнено(СведенияОПокупателе.ЮридическийАдрес.city_with_type) Тогда
			ЗаписьXML.ЗаписатьАтрибут("Город", СокрЛП(СведенияОПокупателе.ЮридическийАдрес.city_with_type));
		КонецЕсли;
		Если ЗначениеЗаполнено(СведенияОПокупателе.ЮридическийАдрес.settlement_with_type) Тогда
			ЗаписьXML.ЗаписатьАтрибут("НаселПункт", СокрЛП(СведенияОПокупателе.ЮридическийАдрес.settlement_with_type));
		КонецЕсли;
		Если ЗначениеЗаполнено(СведенияОПокупателе.ЮридическийАдрес.street_with_type) Тогда
			ЗаписьXML.ЗаписатьАтрибут("Улица", СокрЛП(СведенияОПокупателе.ЮридическийАдрес.street_with_type));
		КонецЕсли;
		Если ЗначениеЗаполнено(СведенияОПокупателе.ЮридическийАдрес.house) Тогда
			ЗаписьXML.ЗаписатьАтрибут("Дом", СокрЛП(СведенияОПокупателе.ЮридическийАдрес.house));
		КонецЕсли;
		Если ЗначениеЗаполнено(СведенияОПокупателе.ФактическийАдрес.block) Тогда
			ЗаписьXML.ЗаписатьАтрибут("Корпус", СведенияОПокупателе.ФактическийАдрес.block);
		КонецЕсли;
		Если ЗначениеЗаполнено(СведенияОПокупателе.ЮридическийАдрес.flat) Тогда
			ЗаписьXML.ЗаписатьАтрибут("Кварт", СокрЛП(СведенияОПокупателе.ЮридическийАдрес.flat));
		КонецЕсли;
		
		ЗаписьXML.ЗаписатьКонецЭлемента();
	КонецЕсли;
	
	ЗаписьXML.ЗаписатьКонецЭлемента();        
	
	Если ЗначениеЗаполнено(СведенияОПокупателе.НомерСчета) Тогда 
		ЗаписьXML.ЗаписатьНачалоЭлемента("БанкРекв");
		ЗаписьXML.ЗаписатьАтрибут("НомерСчета", Строка(СведенияОПокупателе.НомерСчета));
		ЗаписьXML.ЗаписатьНачалоЭлемента("СвБанк");
		ЗаписьXML.ЗаписатьАтрибут("НаимБанк", СведенияОПокупателе.Банк.Наименование);
		ЗаписьXML.ЗаписатьАтрибут("КорСчет", Строка(СведенияОПокупателе.КоррСчет));
		ЗаписьXML.ЗаписатьАтрибут("БИК", Строка(СведенияОПокупателе.БИК));
		ЗаписьXML.ЗаписатьКонецЭлемента();
		ЗаписьXML.ЗаписатьКонецЭлемента();
	КонецЕсли; 	
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	// конец СвПокуп	
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("ДенИзм");
	ЗаписьXML.ЗаписатьАтрибут("КодОКВ", Строка("643"));
	ЗаписьXML.ЗаписатьАтрибут("НаимОКВ", Строка("Российский рубль"));
	ЗаписьXML.ЗаписатьКонецЭлемента();
	ЗаписьXML.ЗаписатьКонецЭлемента(); 
	
	//Табличная часть
	ЗаписьXML.ЗаписатьНачалоЭлемента("ТаблСчФакт");
	НомерСтроки = 0;
	ИтогКолМест = 0;
	ИтогБрутто = 0;
	ИтогНетто = 0;
	ИтогСумБезНДС = 0;
	ИтогСумНДС = 0;
	ИтогСумУчНДС = 0;  
	
	
		ДанныеТоваров = Новый Массив; 
		 
		УчетнаяДата = ДокВыгрузки.Дата;
		ДокДата = СокрЛП(Формат(УчетнаяДата,"ДЛФ=DD"));
		
		НаименованиеУслуги = "Оказание услуг по ремонту и обслуживанию автотранспортного средства "; 		стрТовар = Новый Структура;
		стрТовар.Вставить("Номенклатура", НаименованиеУслуги);
		стрТовар.Вставить("Количество", 1); 
		стрТовар.Вставить("Сумма", ДокВыгрузки.СуммаДокумента);
		стрТовар.Вставить("СуммаНДС", ДокВыгрузки.СуммаНДС);
		стрТовар.Вставить("СтавкаНДС", ДокВыгрузки.СтавкаНДС);
		
		ДанныеТоваров.Добавить(стрТовар);
		
	Для Каждого стрТовар из ДанныеТоваров цикл
		ХарактеристикаДляПоиска = "";
		НомерСтроки = НомерСтроки + 1; 
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("СведТов");
		ЗаписьXML.ЗаписатьАтрибут("НомСтр", Строка(НомерСтроки));
		СтавкаКоэффициент = ЗначенияСервера.ПреобразуемСтавкиНДС(СтрТовар.СтавкаНДС);
		
		Если ЗначениеЗаполнено(СтрТовар.Сумма) И ЗначениеЗаполнено(СтрТовар.СтавкаНДС) Тогда		
			СуммаБезНДС = СтрТовар.Сумма - СтрТовар.СуммаНДС;
			СуммаНДСдоОкругления = СтрТовар.Сумма - СуммаБезНДС;
			СуммаНДСизСуммы = Окр(СуммаНДСдоОкругления, 2);
		КонецЕсли;
		Если ЗначениеЗаполнено(СуммаБезНДС) И ЗначениеЗаполнено(СтрТовар.Количество) Тогда		
			Цена = СуммаБезНДС / СтрТовар.Количество;
		КонецЕсли;
		ЗаписьXML.ЗаписатьАтрибут("НаимТов", СокрЛП(СтрТовар.Номенклатура));
		
		Если ТипЗнч(ДокВыгрузки)=Тип("ДокументСсылка.РеализацияТоваров") Тогда
		ЗаписьXML.ЗаписатьАтрибут("ОКЕИ_Тов", СокрЛП(СтрТовар.Номенклатура.ЕдиницаИзмерения.Код)); 
		ЗаписьXML.ЗаписатьАтрибут("НаимЕдИзм", СокрЛП(СтрТовар.Номенклатура.ЕдиницаИзмерения));
		КонецЕсли;
		
		ЗаписьXML.ЗаписатьАтрибут("КолТов", Строка(СтрЗаменить(СтрТовар.Количество, Символы.НПП,"")));
		ЗаписьXML.ЗаписатьАтрибут("ЦенаТов",Строка(Формат(Цена,"ЧДЦ=2; ЧГ=0; ЧРД=.")));
		ЗаписьXML.ЗаписатьАтрибут("НалСт", СтавкаКоэффициент.Ставка);  
		ЗаписьXML.ЗаписатьАтрибут("СтТовБезНДС", Строка(Формат(СуммаБезНДС,"ЧДЦ=2; ЧГ=0; ЧРД=.")));
		ЗаписьXML.ЗаписатьАтрибут("СтТовУчНал", Строка(Формат(СтрТовар.Сумма,"ЧДЦ=2; ЧГ=0; ЧРД=.")));
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("ДопСведТов");
		ЗаписьXML.ЗаписатьАтрибут("ПрТовРаб", "2");
		ЗаписьXML.ЗаписатьАтрибут("НадлОтп", "2");
		ЗаписьXML.ЗаписатьКонецЭлемента();

		
		ЗаписьXML.ЗаписатьНачалоЭлемента("Акциз");
		ЗаписьXML.ЗаписатьНачалоЭлемента("БезАкциз");
		ЗаписьXML.ЗаписатьТекст("без акциза");
		ЗаписьXML.ЗаписатьКонецЭлемента();
		ЗаписьXML.ЗаписатьКонецЭлемента();
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("СумНал"); 
		
		Если СуммаНДСизСуммы > 0 Тогда
			ЗаписьXML.ЗаписатьНачалоЭлемента("СумНал");
			ЗаписьXML.ЗаписатьТекст(Строка(Формат(СуммаНДСизСуммы,"ЧДЦ=2; ЧГ=0; ЧРД=.")));
		ИначеЕсли СуммаНДСизСуммы = 0 Тогда		
			ЗаписьXML.ЗаписатьНачалоЭлемента("БезНДС");
			ЗаписьXML.ЗаписатьТекст("без НДС");
		КонецЕсли;
		ЗаписьXML.ЗаписатьКонецЭлемента();
		ЗаписьXML.ЗаписатьКонецЭлемента();
		
		ЗаписьXML.ЗаписатьКонецЭлемента();
		ИтогКолМест = ИтогКолМест + СтрТовар.Количество; 
		ИтогНетто = ИтогНетто + СтрТовар.Количество;
		ИтогСумБезНДС = ИтогСумБезНДС + СуммаБезНДС;
		ИтогСумНДС = ИтогСумНДС + СтрТовар.СуммаНДС;	
		ИтогСумУчНДС = ИтогСумУчНДС + СтрТовар.Сумма;
		
	КонецЦикла;
	
	
	// Конец табличной части
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("ВсегоОпл");
	ЗаписьXML.ЗаписатьАтрибут("СтТовБезНДСВсего", Строка(Формат(ИтогСумБезНДС,"ЧДЦ=2; ЧГ=0; ЧРД=.")));
	ЗаписьXML.ЗаписатьАтрибут("СтТовУчНалВсего", Строка(Формат(ИтогСумУчНДС,"ЧДЦ=2; ЧГ=0; ЧРД=.")));
	ЗаписьXML.ЗаписатьАтрибут("КолНеттоВс","0" );	
	ЗаписьXML.ЗаписатьНачалоЭлемента("СумНалВсего");
	Если ИтогСумНДС > 0 Тогда
	ЗаписьXML.ЗаписатьНачалоЭлемента("СумНал");
	ЗаписьXML.ЗаписатьТекст(Строка(Формат(ИтогСумНДС,"ЧДЦ=2; ЧГ=0; ЧРД=."))); 
    Иначе
	ЗаписьXML.ЗаписатьНачалоЭлемента("БезНДС");
	ЗаписьXML.ЗаписатьТекст("без НДС");
    КонецЕсли;
	
	ЗаписьXML.ЗаписатьКонецЭлемента();
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.ЗаписатьКонецЭлемента();
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("СвПродПер");
	ЗаписьXML.ЗаписатьНачалоЭлемента("СвПер");
	ЗаписьXML.ЗаписатьАтрибут("СодОпер", "Товары переданы"); 
	ЗаписьXML.ЗаписатьАтрибут("ДатаПер", Формат(ДатаУПД, "ДЛФ=Д"));
	ЗаписьXML.ЗаписатьНачалоЭлемента("ОснПер");
	Если ЗначениеЗаполнено(ДокВыгрузки.ДоговорВзаиморасчетов) Тогда 
	ЗаписьXML.ЗаписатьАтрибут("РеквНаимДок", "Договор");                                     
	ЗаписьXML.ЗаписатьАтрибут("РеквНомерДок", Строка(ДокВыгрузки.ДоговорВзаиморасчетов.Номер));
	ЗаписьXML.ЗаписатьАтрибут("РеквДатаДок", Строка(Формат(ДокВыгрузки.ДоговорВзаиморасчетов.НачПериода, "ДЛФ=Д")));
    Иначе 
	ЗаписьXML.ЗаписатьАтрибут("РеквНаимДок", "Заказ-наряд");                                     
	ЗаписьXML.ЗаписатьАтрибут("РеквНомерДок", Строка(ДокВыгрузки.Номер));
	ЗаписьXML.ЗаписатьАтрибут("РеквДатаДок", Строка(Формат(ДокВыгрузки.ДатаЗакрытия, "ДЛФ=Д")));
	КонецЕсли;

	
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	Если ТипЗнч(ДокВыгрузки) = Тип("ДокументСсылка.ЗаказНаряд")
		И ДокВыгрузки.Контрагент.ШаблонСтрокиДанныеТранспортировки = 1 Тогда 
		ЗаписьXML.ЗаписатьНачалоЭлемента("ТранГруз");
		ДатаТранГруз = ?(ЗначениеЗаполнено(ДокВыгрузки.ДатаЗакрытия),ДокВыгрузки.ДатаЗакрытия,ДокВыгрузки.Дата); 
		СтрТранГруз = "Заказ-наряд № "+СокрЛП(ДокВыгрузки.Номер)+" от "+Формат(ДатаТранГруз,"ДЛФ=Д")+" г.";
		ЗаписьXML.ЗаписатьАтрибут("СвТранГруз", СтрТранГруз);
		ЗаписьXML.ЗаписатьКонецЭлемента();
	КонецЕсли;
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("СвПерВещи");
	ЗаписьXML.ЗаписатьКонецЭлемента();
	ЗаписьXML.ЗаписатьКонецЭлемента();
	ЗаписьXML.ЗаписатьНачалоЭлемента("ИнфПолФХЖ3");
	ЗаписьXML.ЗаписатьКонецЭлемента();
	ЗаписьXML.ЗаписатьКонецЭлемента();
	//Подписант
	ЗаписьXML.ЗаписатьНачалоЭлемента("Подписант");
	ЗаписьXML.ЗаписатьАтрибут("ОснПолн", "Должностные обязанности");
	ЗаписьXML.ЗаписатьАтрибут("ОблПолн", "1");
	ЗаписьXML.ЗаписатьАтрибут("Статус", "1");	
	ЗаписьXML.ЗаписатьНачалоЭлемента("ЮЛ");
	
	Если ЗначениеЗаполнено(ДокВыгрузки.Организация.ИНН) Тогда
		ЗаписьXML.ЗаписатьАтрибут("ИННЮЛ", ДокВыгрузки.Организация.ИНН);		
	Иначе 		
		ЗаписьXML.ЗаписатьАтрибут("ИННЮЛ", "0101010108");
	КонецЕсли;
	
	ПодписантОветственный = "";
	ЗаписьXML.ЗаписатьАтрибут("Должн", "Директор");
	ЗаписьXML.ЗаписатьНачалоЭлемента("ФИО");
	ЗаписьXML.ЗаписатьАтрибут("Фамилия", "Ф");
	ЗаписьXML.ЗаписатьАтрибут("Имя", "И");
	
	ЗаписьXML.ЗаписатьАтрибут("Отчество", "О");
	
	ЗаписьXML.ЗаписатьКонецЭлемента();
	ЗаписьXML.ЗаписатьКонецЭлемента();
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.ЗаписатьКонецЭлемента();
	ЗаписьXML.ЗаписатьКонецЭлемента(); 
	
	Возврат ЗаписьXML.Закрыть();
КонецФункции  

&НаСервере
Функция Реализация_СформироватьXML_УПД503реализац(ДокВыгрузки) Экспорт
	ИдОтпр = "2BK-0000000000-0000000";
	ИдПол = "2BK-0000000000-0000000000000";  
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ПрослеживаемыеТовары.Номенклатура КАК Номенклатура,
	|	ПрослеживаемыеТовары.РНПТ КАК РНПТ,
	|	ПрослеживаемыеТовары.Количество КАК Количество,
	|	ПрослеживаемыеТовары.КоличествоПрослеживаемости КАК КоличествоПрослеживаемости,
	|	ПрослеживаемыеТовары.СтранаПроисхождения КАК СтранаПроисхождения
	|ИЗ
	|	РегистрНакопления.ПрослеживаемыеТовары КАК ПрослеживаемыеТовары
	|ГДЕ
	|	ПрослеживаемыеТовары.Регистратор = &Регистратор";	
	Запрос.УстановитьПараметр("Регистратор", ДокВыгрузки);
	СведенияОПрослеживаемости = Запрос.Выполнить().Выгрузить();
	Если СведенияОПрослеживаемости.Количество() > 0 тогда 
		ВыводитьРНПТ = Истина;
	Иначе
		ВыводитьРНПТ = Ложь;	
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ЗначенияСвойствКонтрагентов.Значение КАК Значение
	|ИЗ
	|	РегистрСведений.ЗначенияСвойствКонтрагентов КАК ЗначенияСвойствКонтрагентов
	|ГДЕ
	|	ЗначенияСвойствКонтрагентов.Контрагент = &Контрагент
	|	И ЗначенияСвойствКонтрагентов.Свойство = &Свойство";
	Запрос.УстановитьПараметр("Контрагент", ДокВыгрузки.Контрагент); 
	Запрос.УстановитьПараметр("Свойство", Справочники.ЗначенияСвойствОбъектов.ГрузотправительПрочерк); 
	СвойствоПрочерк = Запрос.Выполнить().Выгрузить();
	Если СвойствоПрочерк.Количество() > 0 тогда 
		ВыводитьПрочерк = Истина;
	Иначе
		ВыводитьПрочерк = Ложь;	
	КонецЕсли;	
	
	Если (ДокВыгрузки.Контрагент.ТипКонтрагента=Перечисления.ТипКонтрагента.Ип) ИЛИ (ДокВыгрузки.Контрагент.ТипКонтрагента=Перечисления.ТипКонтрагента.Фл ) Тогда
		КонтрИП = Истина;
	КонецЕсли;
	
	Если ТипЗнч(ДокВыгрузки) = Тип("ДокументСсылка.ЗаказНаряд") Тогда 
		ДатаУПД = ДокВыгрузки.ДатаЗакрытия;
	Иначе
		ДатаУПД = ДокВыгрузки.Дата;
	КонецЕсли;
	
	НомУПД = ?(ЗначениеЗаполнено(ДокВыгрузки.НомерСчф), ДокВыгрузки.НомерСчф, ДокВыгрузки.Номер);	
	
	ОргИП = Ложь;
	БанковскийСчетКонтрагента = ДокВыгрузки.Контрагент.РасчСчет;
	БанковскийСчетФирмы = ДокВыгрузки.Организация.РасчСчет;
	СведенияОПоставщике = ЗначенияСервера.СведенияОЮрФизЛице(ДокВыгрузки.Организация, ДатаУПД);
	СведенияОПокупателе = ЗначенияСервера.СведенияОЮРФизЛице(ДокВыгрузки.Контрагент, ДатаУПД);
	
	Если ДокВыгрузки.Метаданные().Реквизиты.Найти("Получатель")<>Неопределено И ЗначениеЗаполнено(ДокВыгрузки.Получатель) и ТипЗнч(ДокВыгрузки.Получатель) = Тип("СправочникСсылка.Контрагенты") тогда
		СведенияОГрузополучателе  = ЗначенияСервера.СведенияОЮрФизЛице(ДокВыгрузки.Получатель,  ДатаУПД);
		ПолучательПоДокументу = ДокВыгрузки.Получатель;
	Иначе
		СведенияОГрузополучателе  = СведенияОПокупателе;
		ПолучательПоДокументу = ДокВыгрузки.Контрагент;
	КонецЕсли;  
	
	СведенияОГрузоотправитель = СведенияОПоставщике;
	
	НовыйУникальныйИдентификатор = Новый УникальныйИдентификатор;
	ДатаДляИндифик = ТекущаяДата();
	Год   = Строка(Формат(ДатаДляИндифик, "ДФ=гггг")); // Год
	Месяц = Строка(Формат(ДатаДляИндифик, "ДФ=ММ"));   // Месяц
	День  = Строка(Формат(ДатаДляИндифик, "ДФ=дд"));   // День
	
	ДатаПреобразоваянная = Год + Месяц + День;
	
	ЗаписьXML = Новый ЗаписьXML;
	
	ЗаписьXML.УстановитьСтроку();
	ЗаписьXML.ЗаписатьОбъявлениеXML();
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("Файл");
	ЗаписьXML.ЗаписатьСоответствиеПространстваИмен("xsd","http://www.w3.org/2001/XMLSchema");
	ЗаписьXML.ЗаписатьСоответствиеПространстваИмен("xsi","http://www.w3.org/2001/XMLSchema-instance");
	
	ЗаписьXML.ЗаписатьАтрибут("ИдФайл", "ON_NSCHFDOPPR_" + ИдПол + "_" + ИдОтпр + "_" + ДатаПреобразоваянная + "_" + НовыйУникальныйИдентификатор);	
	ЗаписьXML.ЗаписатьАтрибут("ВерсФорм", "5.03");
	ЗаписьXML.ЗаписатьАтрибут("ВерсПрог", "Diadoc 1.0");
	ЗаписьXML.ЗаписатьНачалоЭлемента("Документ");	
	ЗаписьXML.ЗаписатьАтрибут("КНД", "1115131"); 	
	ЗаписьXML.ЗаписатьАтрибут("ПоФактХЖ", "Документ об отгрузке товаров (выполнении работ), передаче имущественных прав (документ об оказании услуг)");
	ЗаписьXML.ЗаписатьАтрибут("НаимДокОпр", "УПД");
	ЗаписьXML.ЗаписатьАтрибут("ДатаИнфПр", Формат(ДатаУПД, "ДЛФ=Д"));
	ЗаписьXML.ЗаписатьАтрибут("ВремИнфПр", "00.00.00");
	ЗаписьXML.ЗаписатьАтрибут("НаимЭконСубСост", ДокВыгрузки.Организация.НаименованиеПолное);
	ЗаписьXML.ЗаписатьАтрибут("Функция", "СЧФДОП");
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("СвСчФакт");
	
	ЗаписьXML.ЗаписатьАтрибут("НомерДок", НомУПД);
	Если ТипЗнч(ДокВыгрузки) = Тип("ДокументСсылка.ЗаказНаряд") Тогда 
		ЗаписьXML.ЗаписатьАтрибут("ДатаДок", Формат(ДатаУПД, "ДЛФ=Д"));
	Иначе
		ЗаписьXML.ЗаписатьАтрибут("ДатаДок", Формат(ДатаУПД, "ДЛФ=Д"));   
	КонецЕсли;
	
	//Продавец
	ЗаписьXML.ЗаписатьНачалоЭлемента("СвПрод");
	ЗаписьXML.ЗаписатьНачалоЭлемента("ИдСв");
	ЗаписьXML.ЗаписатьНачалоЭлемента("СвЮЛУч");   
	КППОбособленного = ОбщНазн.ХолдерНаТочкеПолучитьСтруктуру(ДокВыгрузки.Организация,ДокВыгрузки.ТочкаОформления).КПП;
	ЗаписьXML.ЗаписатьАтрибут("КПП", КППОбособленного);
	ЗаписьXML.ЗаписатьАтрибут("НаимОрг", ДокВыгрузки.Организация.НаименованиеПолное);
	ЗаписьXML.ЗаписатьАтрибут("ИННЮЛ", ДокВыгрузки.Организация.ИНН);
	ЗаписьXML.ЗаписатьКонецЭлемента();
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("Адрес");
	ЗаписьXML.ЗаписатьНачалоЭлемента("АдрРФ");
	
	Если ЗначениеЗаполнено(СведенияОПоставщике.ЮридическийАдрес.postal_code) Тогда
		ЗаписьXML.ЗаписатьАтрибут("Индекс", СокрЛП(СведенияОПоставщике.ЮридическийАдрес.postal_code));
	КонецЕсли;
	Если ДокВыгрузки.Организация.Страна.ЭтоСтрана=Ложь тогда
		Если Лев(СокрЛП(ДокВыгрузки.Организация.Страна.Код),1)= "0" тогда
			ЗаписьXML.ЗаписатьАтрибут("КодРегион",Сред(СокрЛП(ДокВыгрузки.Организация.Страна.Код),2));	
		Иначе	
			ЗаписьXML.ЗаписатьАтрибут("КодРегион",СокрЛП(ДокВыгрузки.Организация.Страна.Код));
		КонецЕсли;	
	Иначе 	
		ЗаписьXML.ЗаписатьАтрибут("КодРегион",СокрЛП(ДокВыгрузки.Организация.Страна.КодОКСМ));	
	КонецЕсли;
	ЗаписьXML.ЗаписатьАтрибут("НаимРегион",СокрЛП(СведенияОПоставщике.ЮридическийАдрес.region_with_type));
	
	Если ЗначениеЗаполнено(СведенияОПоставщике.ЮридическийАдрес.city_district_with_type) Тогда
		ЗаписьXML.ЗаписатьАтрибут("Район",СокрЛП(СведенияОПоставщике.ЮридическийАдрес.city_district_with_type));
	КонецЕсли;
	Если ЗначениеЗаполнено(СведенияОПоставщике.ЮридическийАдрес.city_with_type) Тогда
		ЗаписьXML.ЗаписатьАтрибут("Город", СокрЛП(СведенияОПоставщике.ЮридическийАдрес.city_with_type));
	КонецЕсли;
	Если ЗначениеЗаполнено(СведенияОПоставщике.ЮридическийАдрес.settlement_with_type) Тогда
		ЗаписьXML.ЗаписатьАтрибут("НаселПункт", СокрЛП(СведенияОПоставщике.ЮридическийАдрес.settlement_with_type));
	КонецЕсли;
	Если ЗначениеЗаполнено(СведенияОПоставщике.ЮридическийАдрес.street_with_type) Тогда
		ЗаписьXML.ЗаписатьАтрибут("Улица", СокрЛП(СведенияОПоставщике.ЮридическийАдрес.street_with_type));
	КонецЕсли;
	Если ЗначениеЗаполнено(СведенияОПоставщике.ЮридическийАдрес.house) Тогда
		ЗаписьXML.ЗаписатьАтрибут("Дом", СокрЛП(СведенияОПоставщике.ЮридическийАдрес.house));
	КонецЕсли;
	Если ЗначениеЗаполнено(СведенияОПоставщике.ЮридическийАдрес.flat) Тогда
		ЗаписьXML.ЗаписатьАтрибут("Кварт", СокрЛП(СведенияОПоставщике.ЮридическийАдрес.flat));
	КонецЕсли;
	
	ЗаписьXML.ЗаписатьКонецЭлемента();
	ЗаписьXML.ЗаписатьКонецЭлемента();
	Если ЗначениеЗаполнено(СведенияОПоставщике.НомерСчета) Тогда 
		ЗаписьXML.ЗаписатьНачалоЭлемента("БанкРекв");
		ЗаписьXML.ЗаписатьАтрибут("НомерСчета", Строка(СведенияОПоставщике.НомерСчета));
		ЗаписьXML.ЗаписатьНачалоЭлемента("СвБанк");
		ЗаписьXML.ЗаписатьАтрибут("НаимБанк", СведенияОПоставщике.Банк.Наименование);
		ЗаписьXML.ЗаписатьАтрибут("КорСчет", Строка(СведенияОПоставщике.КоррСчет));
		ЗаписьXML.ЗаписатьАтрибут("БИК", Строка(СведенияОПоставщике.БИК));
		ЗаписьXML.ЗаписатьКонецЭлемента();
		ЗаписьXML.ЗаписатьКонецЭлемента();
	КонецЕсли; 	
	ЗаписьXML.ЗаписатьКонецЭлемента();
	//Конец Продавец
	
	//ГрузОтпр
	ЗаписьXML.ЗаписатьНачалоЭлемента("ГрузОт");
	ЗаписьXML.ЗаписатьНачалоЭлемента("ГрузОтпр");
	ЗаписьXML.ЗаписатьНачалоЭлемента("ИдСв");
	ЗаписьXML.ЗаписатьНачалоЭлемента("СвЮЛУч");  
	ЗаписьXML.ЗаписатьАтрибут("КПП", ДокВыгрузки.Организация.КПП);
	ЗаписьXML.ЗаписатьАтрибут("НаимОрг", ДокВыгрузки.Организация.НаименованиеПолное);
	ЗаписьXML.ЗаписатьАтрибут("ИННЮЛ", ДокВыгрузки.Организация.ИНН);
	ЗаписьXML.ЗаписатьКонецЭлемента();
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("Адрес");
	ЗаписьXML.ЗаписатьНачалоЭлемента("АдрРФ");
	Если НЕ ВыводитьПрочерк Тогда
		Если ЗначениеЗаполнено(СведенияОПоставщике.ЮридическийАдрес.postal_code) Тогда
			ЗаписьXML.ЗаписатьАтрибут("Индекс", СокрЛП(СведенияОПоставщике.ЮридическийАдрес.postal_code));
		КонецЕсли;
		Если ДокВыгрузки.Организация.Страна.ЭтоСтрана=Ложь тогда
			Если Лев(СокрЛП(ДокВыгрузки.Организация.Страна.Код),1)= "0" тогда
				ЗаписьXML.ЗаписатьАтрибут("КодРегион",Сред(СокрЛП(ДокВыгрузки.Организация.Страна.Код),2));	
			Иначе	
				ЗаписьXML.ЗаписатьАтрибут("КодРегион",СокрЛП(ДокВыгрузки.Организация.Страна.Код));
			КонецЕсли;	
		Иначе 	
			ЗаписьXML.ЗаписатьАтрибут("КодРегион",СокрЛП(ДокВыгрузки.Организация.Страна.КодОКСМ));	
		КонецЕсли;
		Если ЗначениеЗаполнено(СведенияОПоставщике.ЮридическийАдрес.region_with_type) Тогда
			ЗаписьXML.ЗаписатьАтрибут("НаимРегион",СокрЛП(СведенияОПоставщике.ЮридическийАдрес.region_with_type));
		КонецЕсли;
		Если ЗначениеЗаполнено(СведенияОПоставщике.ЮридическийАдрес.city_district_with_type) Тогда
			ЗаписьXML.ЗаписатьАтрибут("Район",СокрЛП(СведенияОПоставщике.ЮридическийАдрес.city_district_with_type));
		КонецЕсли;
		Если ЗначениеЗаполнено(СведенияОПоставщике.ЮридическийАдрес.city_with_type) Тогда
			ЗаписьXML.ЗаписатьАтрибут("Город", СокрЛП(СведенияОПоставщике.ЮридическийАдрес.city_with_type));
		КонецЕсли;
		Если ЗначениеЗаполнено(СведенияОПоставщике.ЮридическийАдрес.settlement_with_type) Тогда
			ЗаписьXML.ЗаписатьАтрибут("НаселПункт", СокрЛП(СведенияОПоставщике.ЮридическийАдрес.settlement_with_type));
		КонецЕсли;
		Если ЗначениеЗаполнено(СведенияОПоставщике.ЮридическийАдрес.street_with_type) Тогда
			ЗаписьXML.ЗаписатьАтрибут("Улица", СокрЛП(СведенияОПоставщике.ЮридическийАдрес.street_with_type));
		КонецЕсли;
		Если ЗначениеЗаполнено(СведенияОПоставщике.ЮридическийАдрес.house) Тогда
			ЗаписьXML.ЗаписатьАтрибут("Дом", СокрЛП(СведенияОПоставщике.ЮридическийАдрес.house));
		КонецЕсли;  
		Если ЗначениеЗаполнено(СведенияОГрузополучателе.ЮридическийАдрес.block) Тогда
			ЗаписьXML.ЗаписатьАтрибут("Корпус", СведенияОГрузополучателе.ЮридическийАдрес.block);
		КонецЕсли;
		Если ЗначениеЗаполнено(СведенияОПоставщике.ЮридическийАдрес.flat) Тогда
			ЗаписьXML.ЗаписатьАтрибут("Кварт", СокрЛП(СведенияОПоставщике.ЮридическийАдрес.flat));
		КонецЕсли;
	//Пишем прочерк 
	Иначе
		Если ЗначениеЗаполнено(СведенияОПоставщике.ЮридическийАдрес.postal_code) Тогда
			ЗаписьXML.ЗаписатьАтрибут("Индекс", "-");
		КонецЕсли;
		Если ДокВыгрузки.Организация.Страна.ЭтоСтрана=Ложь тогда
			Если Лев(СокрЛП(ДокВыгрузки.Организация.Страна.Код),1)= "0" тогда
				ЗаписьXML.ЗаписатьАтрибут("КодРегион","");	
			Иначе	
				ЗаписьXML.ЗаписатьАтрибут("КодРегион","");
			КонецЕсли;	
		Иначе 	
			ЗаписьXML.ЗаписатьАтрибут("КодРегион","");	
		КонецЕсли;
		Если ЗначениеЗаполнено(СведенияОПоставщике.ЮридическийАдрес.region_with_type) Тогда
			ЗаписьXML.ЗаписатьАтрибут("НаимРегион","");
		КонецЕсли;
		Если ЗначениеЗаполнено(СведенияОПоставщике.ЮридическийАдрес.city_district_with_type) Тогда
			ЗаписьXML.ЗаписатьАтрибут("Район","");
		КонецЕсли;
		Если ЗначениеЗаполнено(СведенияОПоставщике.ЮридическийАдрес.city_with_type) Тогда
			ЗаписьXML.ЗаписатьАтрибут("Город", "");
		КонецЕсли;
		Если ЗначениеЗаполнено(СведенияОПоставщике.ЮридическийАдрес.settlement_with_type) Тогда
			ЗаписьXML.ЗаписатьАтрибут("НаселПункт", "");
		КонецЕсли;
		Если ЗначениеЗаполнено(СведенияОПоставщике.ЮридическийАдрес.street_with_type) Тогда
			ЗаписьXML.ЗаписатьАтрибут("Улица", "");
		КонецЕсли;
		Если ЗначениеЗаполнено(СведенияОПоставщике.ЮридическийАдрес.house) Тогда
			ЗаписьXML.ЗаписатьАтрибут("Дом","");
		КонецЕсли;  
		Если ЗначениеЗаполнено(СведенияОГрузополучателе.ЮридическийАдрес.block) Тогда
			ЗаписьXML.ЗаписатьАтрибут("Корпус","");
		КонецЕсли;
		Если ЗначениеЗаполнено(СведенияОПоставщике.ЮридическийАдрес.flat) Тогда
			ЗаписьXML.ЗаписатьАтрибут("Кварт", "");
		КонецЕсли;
	КонецЕсли;
	ЗаписьXML.ЗаписатьКонецЭлемента();
	ЗаписьXML.ЗаписатьКонецЭлемента(); 
	
	Если ЗначениеЗаполнено(СведенияОПоставщике.НомерСчета) Тогда 
		ЗаписьXML.ЗаписатьНачалоЭлемента("БанкРекв");
		ЗаписьXML.ЗаписатьАтрибут("НомерСчета", Строка(СведенияОПоставщике.НомерСчета));
		ЗаписьXML.ЗаписатьНачалоЭлемента("СвБанк");
		ЗаписьXML.ЗаписатьАтрибут("НаимБанк", СведенияОПоставщике.Банк.Наименование);
		ЗаписьXML.ЗаписатьАтрибут("КорСчет", Строка(СведенияОПоставщике.КоррСчет));
		ЗаписьXML.ЗаписатьАтрибут("БИК", Строка(СведенияОПоставщике.БИК));
		ЗаписьXML.ЗаписатьКонецЭлемента();
		ЗаписьXML.ЗаписатьКонецЭлемента();
	КонецЕсли; 	
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.ЗаписатьКонецЭлемента(); 
	//Конец ГрузОтпр	
	
	//ГрузПолуч
	ЗаписьXML.ЗаписатьНачалоЭлемента("ГрузПолуч");
	ЗаписьXML.ЗаписатьНачалоЭлемента("ИдСв");
	ЗаписьXML.ЗаписатьНачалоЭлемента("СвЮЛУч");  
	ЗаписьXML.ЗаписатьАтрибут("КПП", ПолучательПоДокументу.КПП);
	ЗаписьXML.ЗаписатьАтрибут("НаимОрг", ПолучательПоДокументу.НаименованиеПолное);
	ЗаписьXML.ЗаписатьАтрибут("ИННЮЛ", ПолучательПоДокументу.ИНН);
	ЗаписьXML.ЗаписатьКонецЭлемента();
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("Адрес");
	ВыгружатьАдресаКакИностранные = ВыгружатьАдресаКакИностранные(ДокВыгрузки.Организация, ПолучательПоДокументу);
	
	доступно = СведенияОГрузополучателе.ЮридическийАдрес.house  = неопределено;
	доступно = доступно или СведенияОГрузополучателе.ЮридическийАдрес.flat = неопределено;
	доступно = доступно или ВыгружатьАдресаКакИностранные;
	
	Если доступно тогда
		ЗаписьXML.ЗаписатьНачалоЭлемента("АдрИнф");
		ЗаписьXML.ЗаписатьАтрибут("КодСтр", "643");
		ЗаписьXML.ЗаписатьАтрибут("НаимСтран","Россия");
		ЗаписьXML.ЗаписатьАтрибут("АдрТекст", СокрЛП(СведенияОГрузополучателе.ФактическийАдрес.ИсходныйАдрес));	
		ЗаписьXML.ЗаписатьКонецЭлемента();	
	Иначе	
		ЗаписьXML.ЗаписатьНачалоЭлемента("АдрРФ");
		Если НЕ ВыводитьПрочерк Тогда
			Если ЗначениеЗаполнено(СведенияОГрузополучателе.ФактическийАдрес.postal_code) Тогда
				ЗаписьXML.ЗаписатьАтрибут("Индекс", СокрЛП(СведенияОГрузополучателе.ФактическийАдрес.postal_code));
			КонецЕсли;
			Если ПолучательПоДокументу.Страна.ЭтоСтрана=Ложь тогда
				Если Лев(СокрЛП(ПолучательПоДокументу.Страна.Код),1)= "0" тогда
					ЗаписьXML.ЗаписатьАтрибут("КодРегион",Сред(СокрЛП(ПолучательПоДокументу.Страна.Код),2));	
				Иначе	
					ЗаписьXML.ЗаписатьАтрибут("КодРегион",СокрЛП(ПолучательПоДокументу.Страна.Код));
				КонецЕсли;	
			Иначе 	
				ЗаписьXML.ЗаписатьАтрибут("КодРегион",СокрЛП(ДокВыгрузки.Получатель.Страна.КодОКСМ));	
			КонецЕсли;
			Если ЗначениеЗаполнено(СведенияОГрузополучателе.ЮридическийАдрес.region_with_type) Тогда
				ЗаписьXML.ЗаписатьАтрибут("НаимРегион",СокрЛП(СведенияОГрузополучателе.ЮридическийАдрес.region_with_type));
			КонецЕсли;
			Если ЗначениеЗаполнено(СведенияОГрузополучателе.ФактическийАдрес.city_district_with_type) Тогда
				ЗаписьXML.ЗаписатьАтрибут("Район",СокрЛП(СведенияОГрузополучателе.ФактическийАдрес.city_district_with_type));
			КонецЕсли;
			Если ЗначениеЗаполнено(СведенияОГрузополучателе.ФактическийАдрес.city_with_type) Тогда
				ЗаписьXML.ЗаписатьАтрибут("Город", СокрЛП(СведенияОГрузополучателе.ФактическийАдрес.city_with_type));
			КонецЕсли;
			Если ЗначениеЗаполнено(СведенияОГрузополучателе.ФактическийАдрес.settlement_with_type) Тогда
				ЗаписьXML.ЗаписатьАтрибут("НаселПункт", СокрЛП(СведенияОГрузополучателе.ФактическийАдрес.settlement_with_type));
			КонецЕсли;
			Если ЗначениеЗаполнено(СведенияОГрузополучателе.ФактическийАдрес.street_with_type) Тогда
				ЗаписьXML.ЗаписатьАтрибут("Улица", СокрЛП(СведенияОГрузополучателе.ФактическийАдрес.street_with_type));
			КонецЕсли;
			Если ЗначениеЗаполнено(СведенияОГрузополучателе.ФактическийАдрес.house) Тогда
				ЗаписьXML.ЗаписатьАтрибут("Дом", СокрЛП(СведенияОГрузополучателе.ФактическийАдрес.house));
			КонецЕсли;
			Если ЗначениеЗаполнено(СведенияОГрузополучателе.ФактическийАдрес.block) Тогда
				ЗаписьXML.ЗаписатьАтрибут("Корпус", СведенияОГрузополучателе.ФактическийАдрес.block);
			КонецЕсли;
			Если ЗначениеЗаполнено(СведенияОГрузополучателе.ФактическийАдрес.flat) Тогда
				ЗаписьXML.ЗаписатьАтрибут("Кварт", СокрЛП(СведенияОГрузополучателе.ФактическийАдрес.flat));
			КонецЕсли;
		//пишем прочерк 
		Иначе 
			Если ЗначениеЗаполнено(СведенияОГрузополучателе.ФактическийАдрес.postal_code) Тогда
				ЗаписьXML.ЗаписатьАтрибут("Индекс", "-");
			КонецЕсли;
			Если ПолучательПоДокументу.Страна.ЭтоСтрана=Ложь тогда
				Если Лев(СокрЛП(ПолучательПоДокументу.Страна.Код),1)= "0" тогда
					ЗаписьXML.ЗаписатьАтрибут("КодРегион","");	
				Иначе	
					ЗаписьXML.ЗаписатьАтрибут("КодРегион","");
				КонецЕсли;	
			Иначе 	
				ЗаписьXML.ЗаписатьАтрибут("КодРегион","");	
			КонецЕсли;
			Если ЗначениеЗаполнено(СведенияОГрузополучателе.ЮридическийАдрес.region_with_type) Тогда
				ЗаписьXML.ЗаписатьАтрибут("НаимРегион","");
			КонецЕсли;
			Если ЗначениеЗаполнено(СведенияОГрузополучателе.ФактическийАдрес.city_district_with_type) Тогда
				ЗаписьXML.ЗаписатьАтрибут("Район","");
			КонецЕсли;
			Если ЗначениеЗаполнено(СведенияОГрузополучателе.ФактическийАдрес.city_with_type) Тогда
				ЗаписьXML.ЗаписатьАтрибут("Город", "");
			КонецЕсли;
			Если ЗначениеЗаполнено(СведенияОГрузополучателе.ФактическийАдрес.settlement_with_type) Тогда
				ЗаписьXML.ЗаписатьАтрибут("НаселПункт", "");
			КонецЕсли;
			Если ЗначениеЗаполнено(СведенияОГрузополучателе.ФактическийАдрес.street_with_type) Тогда
				ЗаписьXML.ЗаписатьАтрибут("Улица", "");
			КонецЕсли;
			Если ЗначениеЗаполнено(СведенияОГрузополучателе.ФактическийАдрес.house) Тогда
				ЗаписьXML.ЗаписатьАтрибут("Дом", "");
			КонецЕсли;
			Если ЗначениеЗаполнено(СведенияОГрузополучателе.ФактическийАдрес.block) Тогда
				ЗаписьXML.ЗаписатьАтрибут("Корпус", "");
			КонецЕсли;
			Если ЗначениеЗаполнено(СведенияОГрузополучателе.ФактическийАдрес.flat) Тогда
				ЗаписьXML.ЗаписатьАтрибут("Кварт", "");
			КонецЕсли;
		КонецЕсли;
		ЗаписьXML.ЗаписатьКонецЭлемента();
	КонецЕсли;
	ЗаписьXML.ЗаписатьКонецЭлемента();  
	
	Если ЗначениеЗаполнено(СведенияОПокупателе.НомерСчета) Тогда 
		ЗаписьXML.ЗаписатьНачалоЭлемента("БанкРекв");
		ЗаписьXML.ЗаписатьАтрибут("НомерСчета", Строка(СведенияОПокупателе.НомерСчета));
		ЗаписьXML.ЗаписатьНачалоЭлемента("СвБанк");
		ЗаписьXML.ЗаписатьАтрибут("НаимБанк", СведенияОПокупателе.Банк.Наименование);
		ЗаписьXML.ЗаписатьАтрибут("КорСчет", Строка(СведенияОПокупателе.КоррСчет));
		ЗаписьXML.ЗаписатьАтрибут("БИК", Строка(СведенияОПокупателе.БИК));
		ЗаписьXML.ЗаписатьКонецЭлемента();
		ЗаписьXML.ЗаписатьКонецЭлемента();
	КонецЕсли; 	
	ЗаписьXML.ЗаписатьКонецЭлемента();	
	//Конец Грузопол
	
	//Строка 5а	  
	ЗаписьXML.ЗаписатьНачалоЭлемента("ДокПодтвОтгрНом");
	ЗаписьXML.ЗаписатьАтрибут("РеквНаимДок", "УПД");
	ЗаписьXML.ЗаписатьАтрибут("РеквНомерДок",НомУПД);
	ЗаписьXML.ЗаписатьАтрибут("РеквДатаДок",Формат(ДатаУПД, "ДЛФ=Д"));
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	//СвПокуп
	ЗаписьXML.ЗаписатьНачалоЭлемента("СвПокуп");
	ЗаписьXML.ЗаписатьНачалоЭлемента("ИдСв");
	ЗаписьXML.ЗаписатьНачалоЭлемента("СвЮЛУч");
				
	ЗаписьXML.ЗаписатьАтрибут("КПП", ДокВыгрузки.Контрагент.КПП); 
	ЗаписьXML.ЗаписатьАтрибут("НаимОрг", ДокВыгрузки.Контрагент.НаименованиеПолное);
	ЗаписьXML.ЗаписатьАтрибут("ИННЮЛ", ДокВыгрузки.Контрагент.ИНН);
	ЗаписьXML.ЗаписатьКонецЭлемента();
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("Адрес");
	ВыгружатьАдресаКакИностранные = ВыгружатьАдресаКакИностранныеНеПартнер(ДокВыгрузки.Организация, ДокВыгрузки.Контрагент);
	
	Доступно = СведенияОПокупателе.ЮридическийАдрес.house  = неопределено;
	Доступно = доступно или СведенияОПокупателе.ЮридическийАдрес.flat = неопределено;
	Доступно = доступно или ВыгружатьАдресаКакИностранные;
	
	Если Доступно тогда
		ЗаписьXML.ЗаписатьНачалоЭлемента("АдрИнф");
		ЗаписьXML.ЗаписатьАтрибут("КодСтр","643"); 
		ЗаписьXML.ЗаписатьАтрибут("НаимСтран","Россия");
		ЗаписьXML.ЗаписатьАтрибут("АдрТекст", СокрЛП(СведенияОПокупателе.ЮридическийАдрес.ИсходныйАдрес));	
		ЗаписьXML.ЗаписатьКонецЭлемента();		
	Иначе		
		ЗаписьXML.ЗаписатьНачалоЭлемента("АдрРФ");
		
		Если ЗначениеЗаполнено(СведенияОПокупателе.ЮридическийАдрес.postal_code) Тогда
			ЗаписьXML.ЗаписатьАтрибут("Индекс", СокрЛП(СведенияОПокупателе.ЮридическийАдрес.postal_code));
		КонецЕсли;
		Если ДокВыгрузки.Контрагент.Страна.ЭтоСтрана=Ложь тогда
			Если Лев(СокрЛП(ДокВыгрузки.Контрагент.Страна.Код),1)= "0" тогда
				ЗаписьXML.ЗаписатьАтрибут("КодРегион",Сред(СокрЛП(ДокВыгрузки.Контрагент.Страна.Код),2));	
			Иначе	
				ЗаписьXML.ЗаписатьАтрибут("КодРегион",СокрЛП(ДокВыгрузки.Контрагент.Страна.Код));
			КонецЕсли;	
		Иначе 	
			ЗаписьXML.ЗаписатьАтрибут("КодРегион",СокрЛП(ДокВыгрузки.Контрагент.Страна.КодОКСМ));
		КонецЕсли; 
		ЗаписьXML.ЗаписатьАтрибут("НаимРегион",СокрЛП(СведенияОПокупателе.ЮридическийАдрес.region_with_type));
		Если ЗначениеЗаполнено(СведенияОПокупателе.ЮридическийАдрес.city_district_with_type) Тогда
			ЗаписьXML.ЗаписатьАтрибут("Район",СокрЛП(СведенияОПокупателе.ЮридическийАдрес.city_district_with_type));
		КонецЕсли;
		Если ЗначениеЗаполнено(СведенияОПокупателе.ЮридическийАдрес.city_with_type) Тогда
			ЗаписьXML.ЗаписатьАтрибут("Город", СокрЛП(СведенияОПокупателе.ЮридическийАдрес.city_with_type));
		КонецЕсли;
		Если ЗначениеЗаполнено(СведенияОПокупателе.ЮридическийАдрес.settlement_with_type) Тогда
			ЗаписьXML.ЗаписатьАтрибут("НаселПункт", СокрЛП(СведенияОПокупателе.ЮридическийАдрес.settlement_with_type));
		КонецЕсли;
		Если ЗначениеЗаполнено(СведенияОПокупателе.ЮридическийАдрес.street_with_type) Тогда
			ЗаписьXML.ЗаписатьАтрибут("Улица", СокрЛП(СведенияОПокупателе.ЮридическийАдрес.street_with_type));
		КонецЕсли;
		Если ЗначениеЗаполнено(СведенияОПокупателе.ЮридическийАдрес.house) Тогда
			ЗаписьXML.ЗаписатьАтрибут("Дом", СокрЛП(СведенияОПокупателе.ЮридическийАдрес.house));
		КонецЕсли;
		Если ЗначениеЗаполнено(СведенияОПокупателе.ФактическийАдрес.block) Тогда
			ЗаписьXML.ЗаписатьАтрибут("Корпус", СведенияОПокупателе.ФактическийАдрес.block);
		КонецЕсли;
		Если ЗначениеЗаполнено(СведенияОПокупателе.ЮридическийАдрес.flat) Тогда
			ЗаписьXML.ЗаписатьАтрибут("Кварт", СокрЛП(СведенияОПокупателе.ЮридическийАдрес.flat));
		КонецЕсли;
		
		ЗаписьXML.ЗаписатьКонецЭлемента();
	КонецЕсли;
	ЗаписьXML.ЗаписатьКонецЭлемента();        
	
	Если ЗначениеЗаполнено(СведенияОПокупателе.НомерСчета) Тогда 
		ЗаписьXML.ЗаписатьНачалоЭлемента("БанкРекв");
		ЗаписьXML.ЗаписатьАтрибут("НомерСчета", Строка(СведенияОПокупателе.НомерСчета));
		ЗаписьXML.ЗаписатьНачалоЭлемента("СвБанк");
		ЗаписьXML.ЗаписатьАтрибут("НаимБанк", СведенияОПокупателе.Банк.Наименование);
		ЗаписьXML.ЗаписатьАтрибут("КорСчет", Строка(СведенияОПокупателе.КоррСчет));
		ЗаписьXML.ЗаписатьАтрибут("БИК", Строка(СведенияОПокупателе.БИК));
		ЗаписьXML.ЗаписатьКонецЭлемента();
		ЗаписьXML.ЗаписатьКонецЭлемента();
	КонецЕсли; 	
	ЗаписьXML.ЗаписатьКонецЭлемента();
	//Конец СвПокуп	
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("ДенИзм");
	ЗаписьXML.ЗаписатьАтрибут("КодОКВ", Строка("643"));
	ЗаписьXML.ЗаписатьАтрибут("НаимОКВ", Строка("Российский рубль"));
	ЗаписьXML.ЗаписатьКонецЭлемента(); 
	
	//Авансовый СЧФ
	XMLУПД2026 = Константы.XMLУПД2026.Получить();
	ТзАвСФ = ЗначенияСервера.ПолучитьАвансовыСчетФактуру(ДокВыгрузки);
	Если XMLУПД2026 и ТзАвСФ.Количество()>0 Тогда
		ЗаписьXML.ЗаписатьНачалоЭлемента("ДопСвФХЖ1");
		Для Каждого Стр Из ТзАвСФ Цикл
			ЗаписьXML.ЗаписатьНачалоЭлемента("СопрДокФХЖ");
			ЗаписьXML.ЗаписатьАтрибут("РеквНаимДок", "АСЧФ");
			ЗаписьXML.ЗаписатьАтрибут("РеквНомерДок", Строка(Стр.НомерДокумента));
			ЗаписьXML.ЗаписатьАтрибут("РеквДатаДок", Формат(Стр.ДатаДокумента, "ДЛФ=Д"));
			ЗаписьXML.ЗаписатьКонецЭлемента();
		КонецЦикла;
		ЗаписьXML.ЗаписатьКонецЭлемента();
	КонецЕсли;

	//------ <ИнфПолФХЖ1> -----	
	//Заполняем ИнфПолФХЖ1 (Информационное поле факта хозяйственной жизни 1),
	//при реализации товаров с выводом из оборота, а также про просьбам клиентов
	//------------------------------------------------------------------------------------------------------------
	НужноИнфПолФХЖ1 = Ложь;
	
	// Проверка необходимость вывода из оборота при реализации маркироанного товара
	СвВыбытияМАРК = "";
	ВыводитьИзОборота = Интеграция.ПолучитьВыбытие(ДокВыгрузки.Ссылка);
	Если ВыводитьИзОборота > 2 Тогда
		НужноИнфПолФХЖ1 = Истина;
		СвВыбытияМАРК = "1";
	КонецЕсли;  
	
	// Проверка в адресе доставки колонки "Доп.инфо" на наличие codeStock
    ДопИнфоТекстИнф = ""; 
	CodeStockИдентиф = "";
	CodeStockЗначен = "";
	Если ЗначениеЗаполнено(ДокВыгрузки.АдресДоставки) Тогда
		СтрокаАдреса = ДокВыгрузки.Контрагент.АдресаДоставки.НайтиСтроки(Новый Структура("АдресДоставки", ДокВыгрузки.АдресДоставки));
		Если СтрокаАдреса.Количество() > 0 Тогда
			ДополнитИнформ = СтрокаАдреса[0].ДополнительнаяИнформация;
			Если СтрНайти(ДополнитИнформ, "codeStock") <> 0 Тогда
				НужноИнфПолФХЖ1 = Истина; 
				CodeStockИдентиф = "CodeStock";
				CodeStockЗначен = СокрЛП(СтрЗаменить(ДополнитИнформ, "codeStock", ""));
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	// Дополнительные поля ИнфПолФХЖ1 из карточки контрагента (ТЧ "Данные"), напр. признак ОЗ
	МассивДопПолейИнфПолФХЖ1 = ДопПоляИнфПолФХЖ1Получить(ДокВыгрузки.Контрагент);
	Если МассивДопПолейИнфПолФХЖ1.Количество() > 0 Тогда
		НужноИнфПолФХЖ1 = Истина;
	КонецЕсли;
	
	//------ Пример. Первая строка - Списание в Честном знаке, вторая - просто CodeStock = 11111 
	//<ИнфПолФХЖ1>
	//	<ТекстИнф Идентиф="СвВыбытияМАРК" Значен="1"/> 
	//	<ТекстИнф Идентиф="CodeStock" Значен="11111"/>
	//  <ТекстИнф Идентиф="ПризнакОЗ" Значен="ОЗ"/>
	//</ИнфПолФХЖ1> 
	
	Если НужноИнфПолФХЖ1 Тогда
		ЗаписьXML.ЗаписатьНачалоЭлемента("ИнфПолФХЖ1"); 		
	КонецЕсли;
	
	//Вывод товара из оборота при реализации
	//<ТекстИнф Идентиф="СвВыбытияМАРК" Значен="1"/> 
	Если ЗначениеЗаполнено(СвВыбытияМАРК) Тогда 
		//Формироание элемента <ТекстИнф Идентиф="СвВыбытияМАРК" Значен="1"/>
		ЗаписьXML.ЗаписатьНачалоЭлемента("ТекстИнф"); 
		ЗаписьXML.ЗаписатьАтрибут("Идентиф", "СвВыбытияМАРК");
		ЗаписьXML.ЗаписатьАтрибут("Значен", СвВыбытияМАРК);
		ЗаписьXML.ЗаписатьКонецЭлемента();
	КонецЕсли; 
	
	// codeStock - элемент ТекстИнф с атрибутом codeStock 
	//<ТекстИнф Идентиф="CodeStock" Значен="11111"/>
	Если ЗначениеЗаполнено(CodeStockИдентиф) И ЗначениеЗаполнено(CodeStockЗначен) Тогда
		ЗаписьXML.ЗаписатьНачалоЭлемента("ТекстИнф"); 
		ЗаписьXML.ЗаписатьАтрибут("Идентиф", CodeStockИдентиф); 
		ЗаписьXML.ЗаписатьАтрибут("Значен", CodeStockЗначен);
		ЗаписьXML.ЗаписатьКонецЭлемента();
	КонецЕсли;
	
	// Доп.поля ИнфПолФХЖ1 из карточки контрагента (ТЧ "Данные"), напр. признак ОЗ
	ЗаписатьТекстИнфМассив(ЗаписьXML, МассивДопПолейИнфПолФХЖ1);
	
	Если НужноИнфПолФХЖ1 Тогда
		ЗаписьXML.ЗаписатьКонецЭлемента();  //"ИнфПолФХЖ1"
	КонецЕсли;
	//------ </ИнфПолФХЖ1> -----
		
	ЗаписьXML.ЗаписатьКонецЭлемента();//СвСчФакт
	
	//Табличная часть
	ЗаписьXML.ЗаписатьНачалоЭлемента("ТаблСчФакт");
	НомерСтроки = 0;
	ИтогКолМест = 0;
	ИтогБрутто = 0;
	ИтогНетто = 0;
	ИтогСумБезНДС = 0;
	ИтогСумНДС = 0;
	ИтогСумУчНДС = 0;  
	
	Если ТипЗнч(ДокВыгрузки)=Тип("ДокументСсылка.ЗаказНаряд") Тогда
		ДанныеТоваров = Новый Массив; 
		
		УчетнаяДата = ?(ЗначениеЗаполнено(ДокВыгрузки.ДатаЗакрытия),ДокВыгрузки.ДатаЗакрытия,ДокВыгрузки.Дата);
		ДокДата = СокрЛП(Формат(УчетнаяДата,"ДЛФ=DD"));
		
		НаименованиеУслуги = "Оказание услуг по ремонту и обслуживанию автотранспортного средства " + СокрЛП(ПечатныеФормы.СформироватьМодельАвтомобиляДляПечатнойФормы(ДокВыгрузки.ДокументОснование.Автомобиль));
		НаименованиеУслуги = НаименованиеУслуги + ", по заказ-наряду № " + ВРег(СокрЛП(ДокВыгрузки.Номер)) + " от " + ДокДата;
		
		стрТовар = Новый Структура;
		стрТовар.Вставить("Номенклатура", НаименованиеУслуги);
		стрТовар.Вставить("Количество", 1); 
		стрТовар.Вставить("Сумма", ДокВыгрузки.СуммаДокумента);
		стрТовар.Вставить("СуммаНДС", ДокВыгрузки.СуммаНДС);
		стрТовар.Вставить("СтавкаНДС", ДокВыгрузки.СтавкаНДС);
		
		ДанныеТоваров.Добавить(стрТовар);
	Иначе
		ДанныеТоваров = ДокВыгрузки.Товары.Выгрузить();
	КонецЕсли;
	
	Для Каждого стрТовар из ДанныеТоваров цикл
		ХарактеристикаДляПоиска = "";
		НомерСтроки = НомерСтроки + 1; 
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("СведТов");
		ЗаписьXML.ЗаписатьАтрибут("НомСтр", Строка(НомерСтроки));
		СтавкаКоэффициент = ЗначенияСервера.ПреобразуемСтавкиНДС(СтрТовар.СтавкаНДС);
		
		Если ЗначениеЗаполнено(СтрТовар.Сумма) И ЗначениеЗаполнено(СтрТовар.СтавкаНДС) Тогда		
			СуммаБезНДС = СтрТовар.Сумма - СтрТовар.СуммаНДС;
			СуммаНДСдоОкругления = СтрТовар.Сумма - СуммаБезНДС;
			СуммаНДСизСуммы = Окр(СуммаНДСдоОкругления, 2);
		КонецЕсли;
		Если ЗначениеЗаполнено(СуммаБезНДС) И ЗначениеЗаполнено(СтрТовар.Количество) Тогда		
			Цена = СуммаБезНДС / СтрТовар.Количество;
		КонецЕсли;
		ЗаписьXML.ЗаписатьАтрибут("НаимТов", СокрЛП(СтрТовар.Номенклатура));
		
		Если ТипЗнч(ДокВыгрузки)=Тип("ДокументСсылка.РеализацияТоваров") Тогда
			ЗаписьXML.ЗаписатьАтрибут("ОКЕИ_Тов", СокрЛП(СтрТовар.Номенклатура.ЕдиницаИзмерения.Код)); 
			ЗаписьXML.ЗаписатьАтрибут("НаимЕдИзм", СокрЛП(СтрТовар.Номенклатура.ЕдиницаИзмерения));
		КонецЕсли;
		
		ЗаписьXML.ЗаписатьАтрибут("КолТов", Строка(СтрЗаменить(СтрТовар.Количество, Символы.НПП,"")));
		ЗаписьXML.ЗаписатьАтрибут("ЦенаТов",Строка(Формат(Цена,"ЧДЦ=2; ЧГ=0; ЧРД=.")));
		ЗаписьXML.ЗаписатьАтрибут("НалСт", СтавкаКоэффициент.Ставка);  
		ЗаписьXML.ЗаписатьАтрибут("СтТовБезНДС", Строка(Формат(СуммаБезНДС,"ЧДЦ=2; ЧГ=0; ЧРД=.")));
		ЗаписьXML.ЗаписатьАтрибут("СтТовУчНал", Строка(Формат(СтрТовар.Сумма,"ЧДЦ=2; ЧГ=0; ЧРД=.")));
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("ДопСведТов");
		ЗаписьXML.ЗаписатьАтрибут("ПрТовРаб", "1");
		ЗаписьXML.ЗаписатьАтрибут("КодТов", СокрЛП(?(СокрЛП(СтрТовар.Номенклатура.Артикул)="",СтрТовар.Номенклатура.КодКаталога,СтрТовар.Номенклатура.Артикул)));
		ЗаписьXML.ЗаписатьАтрибут("НадлОтп", "2"); 
		
		//Маркировка
		мКИЗ = ПолучитьКИЗ(ДокВыгрузки,СтрТовар.Номенклатура);
		Если мКИЗ.Количество() > 0 Тогда
			//Для парфюмерии до 2030 г. передаем только ГТИН и кол-во
			Если СтрТовар.Номенклатура.ВидМаркированнойПродукции = Перечисления.ВидыМаркированнойПродукции.ПарфюмерныеИКосметическиеСредстваИБытоваяХимия Тогда
				ЗаписьXML.ЗаписатьАтрибут("ГТИН", Сред(мКИЗ[0].КИЗ,3,14));
				ЗаписьXML.ЗаписатьНачалоЭлемента("НомСредИдентТов");
				ЗаписьXML.ЗаписатьАтрибут("КолВедМарк", Строка(СтрЗаменить(СтрТовар.Количество, Символы.НПП,"")));
			Иначе
				ЗаписьXML.ЗаписатьНачалоЭлемента("НомСредИдентТов");  
				Для Каждого стрКИЗ из мКИЗ Цикл
					ЗаписьXML.ЗаписатьНачалоЭлемента("КИЗ"); 
					ЗаписьXML.ЗаписатьТекст(Лев(стрКИЗ.КИЗ,31));
					ЗаписьXML.ЗаписатьКонецЭлемента();
				КонецЦикла;
			КонецЕсли;
			ЗаписьXML.ЗаписатьКонецЭлемента();//НомСредИдентТов
		КонецЕсли;
		
		ЗаписьXML.ЗаписатьКонецЭлемента();//ДопСведТов
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("Акциз");
		ЗаписьXML.ЗаписатьНачалоЭлемента("БезАкциз");
		ЗаписьXML.ЗаписатьТекст("без акциза");
		ЗаписьXML.ЗаписатьКонецЭлемента();
		ЗаписьXML.ЗаписатьКонецЭлемента();
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("СумНал"); 
		Если СуммаНДСизСуммы > 0 Тогда
			ЗаписьXML.ЗаписатьНачалоЭлемента("СумНал");
			ЗаписьXML.ЗаписатьТекст(Строка(Формат(СуммаНДСизСуммы,"ЧДЦ=2; ЧГ=0; ЧРД=.")));
		ИначеЕсли СуммаНДСизСуммы = 0 Тогда		
			ЗаписьXML.ЗаписатьНачалоЭлемента("БезНДС");
			ЗаписьXML.ЗаписатьТекст("без НДС");
		КонецЕсли;
		ЗаписьXML.ЗаписатьКонецЭлемента();
		ЗаписьXML.ЗаписатьКонецЭлемента();
		
		//Если заполнен ID Заказа (для АВТОПИТЕР) выводим его, иначе Штрихкод
		Если ЗначениеЗаполнено(ДокВыгрузки.ДокументОснование)
			И ТипЗнч(ДокВыгрузки.ДокументОснование) = Тип("ДокументСсылка.ЗаказПокупателя") Тогда
			текIDЗаказа = ПолучитьIDЗаказа(ДокВыгрузки.ДокументОснование, СтрТовар.Номенклатура);
		КонецЕсли;
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("ИнфПолФХЖ2");
		Если ЗначениеЗаполнено(текIDЗаказа) Тогда
			ЗаписьXML.ЗаписатьАтрибут( "Идентиф", "ИдентификаторЗаказаКлиента");
			ЗаписьXML.ЗаписатьАтрибут("Значен", СокрЛП(текIDЗаказа));			
		Иначе
			ЗаписьXML.ЗаписатьАтрибут( "Идентиф", "штрихкод");
			ЗаписьXML.ЗаписатьАтрибут("Значен", СокрЛП(СтрТовар.Номенклатура.ШтрихКод));
		КонецЕсли;
		ЗаписьXML.ЗаписатьКонецЭлемента();//ИнфПолФХЖ2
		
		ЗаписьXML.ЗаписатьКонецЭлемента();
		ИтогКолМест = ИтогКолМест + СтрТовар.Количество; 
		ИтогНетто = ИтогНетто + СтрТовар.Количество;
		ИтогСумБезНДС = ИтогСумБезНДС + СуммаБезНДС;
		ИтогСумНДС = ИтогСумНДС + СтрТовар.СуммаНДС;	
		ИтогСумУчНДС = ИтогСумУчНДС + СтрТовар.Сумма;		
	КонецЦикла;
	// Конец табличной части
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("ВсегоОпл");
	ЗаписьXML.ЗаписатьАтрибут("СтТовБезНДСВсего", Строка(Формат(ИтогСумБезНДС,"ЧДЦ=2; ЧГ=0; ЧРД=.")));
	ЗаписьXML.ЗаписатьАтрибут("СтТовУчНалВсего", Строка(Формат(ИтогСумУчНДС,"ЧДЦ=2; ЧГ=0; ЧРД=.")));
	ЗаписьXML.ЗаписатьАтрибут("КолНеттоВс","0" );	
	ЗаписьXML.ЗаписатьНачалоЭлемента("СумНалВсего");
	ЗаписьXML.ЗаписатьНачалоЭлемента("СумНал");
	ЗаписьXML.ЗаписатьТекст(Строка(Формат(ИтогСумНДС,"ЧДЦ=2; ЧГ=0; ЧРД=.")));
	ЗаписьXML.ЗаписатьКонецЭлемента();
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.ЗаписатьКонецЭлемента();
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("СвПродПер");
	ЗаписьXML.ЗаписатьНачалоЭлемента("СвПер");
	ЗаписьXML.ЗаписатьАтрибут("СодОпер", "Товары переданы"); 
	ЗаписьXML.ЗаписатьАтрибут("ДатаПер", Формат(ДатаУПД, "ДЛФ=Д"));
	ЗаписьXML.ЗаписатьНачалоЭлемента("ОснПер");
	ЗаписьXML.ЗаписатьАтрибут("РеквНаимДок", "Договор");                                     
	ЗаписьXML.ЗаписатьАтрибут("РеквНомерДок", Строка(ДокВыгрузки.ДоговорВзаиморасчетов.Номер));
	ЗаписьXML.ЗаписатьАтрибут("РеквДатаДок", Строка(Формат(ДокВыгрузки.ДоговорВзаиморасчетов.НачПериода, "ДЛФ=Д")));
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	Если ТипЗнч(ДокВыгрузки) = Тип("ДокументСсылка.ЗаказНаряд")
		И ДокВыгрузки.Контрагент.ШаблонСтрокиДанныеТранспортировки = 1 Тогда 
		ЗаписьXML.ЗаписатьНачалоЭлемента("ТранГруз");
		ДатаТранГруз = ?(ЗначениеЗаполнено(ДокВыгрузки.ДатаЗакрытия),ДокВыгрузки.ДатаЗакрытия,ДокВыгрузки.Дата); 
		СтрТранГруз = "Заказ-наряд № "+СокрЛП(ДокВыгрузки.Номер)+" от "+Формат(ДатаТранГруз,"ДЛФ=Д")+" г.";
		ЗаписьXML.ЗаписатьАтрибут("СвТранГруз", СтрТранГруз);
		ЗаписьXML.ЗаписатьКонецЭлемента();
	КонецЕсли;
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("СвПерВещи");
	ЗаписьXML.ЗаписатьКонецЭлемента();
	ЗаписьXML.ЗаписатьКонецЭлемента();
	ЗаписьXML.ЗаписатьНачалоЭлемента("ИнфПолФХЖ3");
	ЗаписьXML.ЗаписатьКонецЭлемента();
	ЗаписьXML.ЗаписатьКонецЭлемента();
	//Подписант
	ЗаписьXML.ЗаписатьНачалоЭлемента("Подписант");
	ЗаписьXML.ЗаписатьАтрибут("ОснПолн", "Должностные обязанности");
	ЗаписьXML.ЗаписатьАтрибут("ОблПолн", "1");
	ЗаписьXML.ЗаписатьАтрибут("Статус", "1");	
	ЗаписьXML.ЗаписатьНачалоЭлемента("ЮЛ");
	
	Если ЗначениеЗаполнено(ДокВыгрузки.Организация.ИНН) Тогда
		ЗаписьXML.ЗаписатьАтрибут("ИННЮЛ", ДокВыгрузки.Организация.ИНН);		
	Иначе 		
		ЗаписьXML.ЗаписатьАтрибут("ИННЮЛ", "0101010108");
	КонецЕсли;
	
	//ПодписантОветственный = "";
	РукФ = "";
	РукИ = "";
	РукО = "";
	Если ЗначениеЗаполнено(ДокВыгрузки.Организация.Руководитель) Тогда
		РукФИО = СтрЗаменить(ДокВыгрузки.Организация.Руководитель, " ", Символы.ПС);
		Если СтрЧислоСтрок(РукФИО) = 3 Тогда
			РукФ = СокрЛП(СтрПолучитьСтроку(РукФИО, 1));
			РукИ = СокрЛП(СтрПолучитьСтроку(РукФИО, 2));
			РукО = СокрЛП(СтрПолучитьСтроку(РукФИО, 3));
		КонецЕсли;			
	КонецЕсли;
	ЗаписьXML.ЗаписатьАтрибут("Должн", "Директор");
	ЗаписьXML.ЗаписатьНачалоЭлемента("ФИО");
	ЗаписьXML.ЗаписатьАтрибут("Фамилия", ?(ЗначениеЗаполнено(РукФ),РукФ,"Ф"));
	ЗаписьXML.ЗаписатьАтрибут("Имя", ?(ЗначениеЗаполнено(РукИ),РукИ,"И"));	
	ЗаписьXML.ЗаписатьАтрибут("Отчество", ?(ЗначениеЗаполнено(РукО),РукО,"О"));
	
	ЗаписьXML.ЗаписатьКонецЭлемента();
	ЗаписьXML.ЗаписатьКонецЭлемента();
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.ЗаписатьКонецЭлемента();
	ЗаписьXML.ЗаписатьКонецЭлемента(); 
	
	Возврат ЗаписьXML.Закрыть();
КонецФункции 

&НаСервере
Функция МТРеализация_СформироватьXML_УПД503(ДокВыгрузки) Экспорт
	ИдОтпр = "2BK-0000000000-0000000";
	ИдПол = "2BK-0000000000-0000000000000";  
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ПрослеживаемыеТовары.Номенклатура КАК Номенклатура,
	|	ПрослеживаемыеТовары.РНПТ КАК РНПТ,
	|	ПрослеживаемыеТовары.Количество КАК Количество,
	|	ПрослеживаемыеТовары.КоличествоПрослеживаемости КАК КоличествоПрослеживаемости,
	|	ПрослеживаемыеТовары.СтранаПроисхождения КАК СтранаПроисхождения
	|ИЗ
	|	РегистрНакопления.ПрослеживаемыеТовары КАК ПрослеживаемыеТовары
	|ГДЕ
	|	ПрослеживаемыеТовары.Регистратор = &Регистратор";	
	Запрос.УстановитьПараметр("Регистратор", ДокВыгрузки);
	СведенияОПрослеживаемости = Запрос.Выполнить().Выгрузить();
	Если СведенияОПрослеживаемости.Количество() > 0 тогда 
		ВыводитьРНПТ = Истина;
	Иначе
		ВыводитьРНПТ = Ложь;	
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ЗначенияСвойствКонтрагентов.Значение КАК Значение
	|ИЗ
	|	РегистрСведений.ЗначенияСвойствКонтрагентов КАК ЗначенияСвойствКонтрагентов
	|ГДЕ
	|	ЗначенияСвойствКонтрагентов.Контрагент = &Контрагент
	|	И ЗначенияСвойствКонтрагентов.Свойство = &Свойство";
	Запрос.УстановитьПараметр("Контрагент", ДокВыгрузки.Покупатель); 
	Запрос.УстановитьПараметр("Свойство", Справочники.ЗначенияСвойствОбъектов.ГрузотправительПрочерк); 
	СвойствоПрочерк = Запрос.Выполнить().Выгрузить();
	Если СвойствоПрочерк.Количество() > 0 тогда 
		ВыводитьПрочерк = Истина;
	Иначе
		ВыводитьПрочерк = Ложь;	
	КонецЕсли;	
	
	Если (ДокВыгрузки.Покупатель.ТипКонтрагента=Перечисления.ТипКонтрагента.Ип) ИЛИ (ДокВыгрузки.Покупатель.ТипКонтрагента=Перечисления.ТипКонтрагента.Фл ) Тогда
		КонтрИП = Истина;
	КонецЕсли;
	
	ДатаУПД = ДокВыгрузки.Дата;
	
	
	НомУПД = ?(ЗначениеЗаполнено(ДокВыгрузки.СчфНомер), ДокВыгрузки.СчфНомер, ДокВыгрузки.Номер);	
	
	ОргИП = Ложь;
	БанковскийСчетКонтрагента = ДокВыгрузки.Покупатель.РасчСчет;
	БанковскийСчетФирмы = ДокВыгрузки.Холдер.РасчСчет;
	СведенияОПоставщике = ЗначенияСервера.СведенияОЮрФизЛице(ДокВыгрузки.Холдер, ДатаУПД);
	СведенияОПокупателе = ЗначенияСервера.СведенияОЮРФизЛице(ДокВыгрузки.Покупатель, ДатаУПД);
	
	Если ДокВыгрузки.Метаданные().Реквизиты.Найти("Получатель")<>Неопределено И ЗначениеЗаполнено(ДокВыгрузки.Получатель) и ТипЗнч(ДокВыгрузки.Получатель) = Тип("СправочникСсылка.Контрагенты") тогда
		СведенияОГрузополучателе  = ЗначенияСервера.СведенияОЮрФизЛице(ДокВыгрузки.Получатель,  ДатаУПД);
		ПолучательПоДокументу = ДокВыгрузки.Получатель;
	Иначе
		СведенияОГрузополучателе  = СведенияОПокупателе;
		ПолучательПоДокументу = ДокВыгрузки.Покупатель;
	КонецЕсли;  
	
	СведенияОГрузоотправитель = СведенияОПоставщике;
	
	НовыйУникальныйИдентификатор = Новый УникальныйИдентификатор;
	ДатаДляИндифик = ТекущаяДата();
	Год   = Строка(Формат(ДатаДляИндифик, "ДФ=гггг")); // Год
	Месяц = Строка(Формат(ДатаДляИндифик, "ДФ=ММ"));   // Месяц
	День  = Строка(Формат(ДатаДляИндифик, "ДФ=дд"));   // День
	
	ДатаПреобразоваянная = Год + Месяц + День;
	
	ЗаписьXML = Новый ЗаписьXML;
	
	ЗаписьXML.УстановитьСтроку();
	ЗаписьXML.ЗаписатьОбъявлениеXML();
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("Файл");
	ЗаписьXML.ЗаписатьСоответствиеПространстваИмен("xsd","http://www.w3.org/2001/XMLSchema");
	ЗаписьXML.ЗаписатьСоответствиеПространстваИмен("xsi","http://www.w3.org/2001/XMLSchema-instance");
	
	ЗаписьXML.ЗаписатьАтрибут("ИдФайл", "ON_NSCHFDOPPR_" + ИдПол + "_" + ИдОтпр + "_" + ДатаПреобразоваянная + "_" + НовыйУникальныйИдентификатор);	
	ЗаписьXML.ЗаписатьАтрибут("ВерсФорм", "5.03");
	ЗаписьXML.ЗаписатьАтрибут("ВерсПрог", "Diadoc 1.0");
	ЗаписьXML.ЗаписатьНачалоЭлемента("Документ");	
	ЗаписьXML.ЗаписатьАтрибут("КНД", "1115131"); 	
	ЗаписьXML.ЗаписатьАтрибут("ПоФактХЖ", "Документ об отгрузке товаров (выполнении работ), передаче имущественных прав (документ об оказании услуг)");
	ЗаписьXML.ЗаписатьАтрибут("НаимДокОпр", "УПД");
	ЗаписьXML.ЗаписатьАтрибут("ДатаИнфПр", Формат(ДатаУПД, "ДЛФ=Д"));
	ЗаписьXML.ЗаписатьАтрибут("ВремИнфПр", "00.00.00");
	ЗаписьXML.ЗаписатьАтрибут("НаимЭконСубСост", ДокВыгрузки.Холдер.НаименованиеПолное);
	ЗаписьXML.ЗаписатьАтрибут("Функция", "СЧФДОП");
	ЗаписьXML.ЗаписатьНачалоЭлемента("СвСчФакт");
	ЗаписьXML.ЗаписатьАтрибут("НомерДок", НомУПД);
	Если ТипЗнч(ДокВыгрузки) = Тип("ДокументСсылка.ЗаказНаряд") Тогда 
		ЗаписьXML.ЗаписатьАтрибут("ДатаДок", Формат(ДатаУПД, "ДЛФ=Д"));
	Иначе
		ЗаписьXML.ЗаписатьАтрибут("ДатаДок", Формат(ДатаУПД, "ДЛФ=Д"));   
	КонецЕсли;
	
	//Продавец
	ЗаписьXML.ЗаписатьНачалоЭлемента("СвПрод");
	ЗаписьXML.ЗаписатьНачалоЭлемента("ИдСв");
	ЗаписьXML.ЗаписатьНачалоЭлемента("СвЮЛУч");  
	ЗаписьXML.ЗаписатьАтрибут("КПП", ДокВыгрузки.Холдер.КПП);
	ЗаписьXML.ЗаписатьАтрибут("НаимОрг", ДокВыгрузки.Холдер.НаименованиеПолное);
	ЗаписьXML.ЗаписатьАтрибут("ИННЮЛ", ДокВыгрузки.Холдер.ИНН);
	ЗаписьXML.ЗаписатьКонецЭлемента();
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("Адрес");
	ЗаписьXML.ЗаписатьНачалоЭлемента("АдрРФ");
	
	Если ЗначениеЗаполнено(СведенияОПоставщике.ЮридическийАдрес.postal_code) Тогда
		ЗаписьXML.ЗаписатьАтрибут("Индекс", СокрЛП(СведенияОПоставщике.ЮридическийАдрес.postal_code));
	КонецЕсли;
	Если ДокВыгрузки.Холдер.Страна.ЭтоСтрана=Ложь тогда
		Если Лев(СокрЛП(ДокВыгрузки.Холдер.Страна.Код),1)= "0" тогда
			ЗаписьXML.ЗаписатьАтрибут("КодРегион",Сред(СокрЛП(ДокВыгрузки.Холдер.Страна.Код),2));	
		Иначе	
			ЗаписьXML.ЗаписатьАтрибут("КодРегион",СокрЛП(ДокВыгрузки.Холдер.Страна.Код));
		КонецЕсли;	
	Иначе 	
		ЗаписьXML.ЗаписатьАтрибут("КодРегион",СокрЛП(ДокВыгрузки.Холдер.Страна.КодОКСМ));	
	КонецЕсли;
	ЗаписьXML.ЗаписатьАтрибут("НаимРегион",СокрЛП(СведенияОПоставщике.ЮридическийАдрес.region_with_type));
	
	Если ЗначениеЗаполнено(СведенияОПоставщике.ЮридическийАдрес.city_district_with_type) Тогда
		ЗаписьXML.ЗаписатьАтрибут("Район",СокрЛП(СведенияОПоставщике.ЮридическийАдрес.city_district_with_type));
	КонецЕсли;
	Если ЗначениеЗаполнено(СведенияОПоставщике.ЮридическийАдрес.city_with_type) Тогда
		ЗаписьXML.ЗаписатьАтрибут("Город", СокрЛП(СведенияОПоставщике.ЮридическийАдрес.city_with_type));
	КонецЕсли;
	Если ЗначениеЗаполнено(СведенияОПоставщике.ЮридическийАдрес.settlement_with_type) Тогда
		ЗаписьXML.ЗаписатьАтрибут("НаселПункт", СокрЛП(СведенияОПоставщике.ЮридическийАдрес.settlement_with_type));
	КонецЕсли;
	Если ЗначениеЗаполнено(СведенияОПоставщике.ЮридическийАдрес.street_with_type) Тогда
		ЗаписьXML.ЗаписатьАтрибут("Улица", СокрЛП(СведенияОПоставщике.ЮридическийАдрес.street_with_type));
	КонецЕсли;
	Если ЗначениеЗаполнено(СведенияОПоставщике.ЮридическийАдрес.house) Тогда
		ЗаписьXML.ЗаписатьАтрибут("Дом", СокрЛП(СведенияОПоставщике.ЮридическийАдрес.house));
	КонецЕсли;
	Если ЗначениеЗаполнено(СведенияОПоставщике.ЮридическийАдрес.flat) Тогда
		ЗаписьXML.ЗаписатьАтрибут("Кварт", СокрЛП(СведенияОПоставщике.ЮридическийАдрес.flat));
	КонецЕсли;
	
	ЗаписьXML.ЗаписатьКонецЭлемента();
	ЗаписьXML.ЗаписатьКонецЭлемента();
	Если ЗначениеЗаполнено(СведенияОПоставщике.НомерСчета) Тогда 
		ЗаписьXML.ЗаписатьНачалоЭлемента("БанкРекв");
		ЗаписьXML.ЗаписатьАтрибут("НомерСчета", Строка(СведенияОПоставщике.НомерСчета));
		ЗаписьXML.ЗаписатьНачалоЭлемента("СвБанк");
		ЗаписьXML.ЗаписатьАтрибут("НаимБанк", СведенияОПоставщике.Банк.Наименование);
		ЗаписьXML.ЗаписатьАтрибут("КорСчет", Строка(СведенияОПоставщике.КоррСчет));
		ЗаписьXML.ЗаписатьАтрибут("БИК", Строка(СведенияОПоставщике.БИК));
		ЗаписьXML.ЗаписатьКонецЭлемента();
		ЗаписьXML.ЗаписатьКонецЭлемента();
	КонецЕсли; 	
	ЗаписьXML.ЗаписатьКонецЭлемента();
	//Конец Продавец	
	
	
	//СвПокуп
	ЗаписьXML.ЗаписатьНачалоЭлемента("СвПокуп");
	ЗаписьXML.ЗаписатьНачалоЭлемента("ИдСв");
	ЗаписьXML.ЗаписатьНачалоЭлемента("СвЮЛУч");
	
	КПП = ДокВыгрузки.Покупатель.КПП;	//значение по умолчанию  
	ЗаписьXML.ЗаписатьАтрибут("КПП", КПП); 
	
	ЗаписьXML.ЗаписатьАтрибут("НаимОрг", ДокВыгрузки.Покупатель.НаименованиеПолное);
	ЗаписьXML.ЗаписатьАтрибут("ИННЮЛ", ДокВыгрузки.Покупатель.ИНН);
	ЗаписьXML.ЗаписатьКонецЭлемента();
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("Адрес");
	ВыгружатьАдресаКакИностранные = ВыгружатьАдресаКакИностранныеНеПартнер(ДокВыгрузки.Холдер, ДокВыгрузки.Покупатель);
	
	Доступно = СведенияОПокупателе.ЮридическийАдрес.house  = неопределено;
	Доступно = доступно или СведенияОПокупателе.ЮридическийАдрес.flat = неопределено;
	Доступно = доступно или ВыгружатьАдресаКакИностранные;
	
	Если Доступно тогда
		ЗаписьXML.ЗаписатьНачалоЭлемента("АдрИнф");
		ЗаписьXML.ЗаписатьАтрибут("КодСтр","643"); 
		ЗаписьXML.ЗаписатьАтрибут("НаимСтран","Россия");
		ЗаписьXML.ЗаписатьАтрибут("АдрТекст", СокрЛП(СведенияОПокупателе.ЮридическийАдрес.ИсходныйАдрес));	
		
		ЗаписьXML.ЗаписатьКонецЭлемента();		
	Иначе		
		ЗаписьXML.ЗаписатьНачалоЭлемента("АдрРФ");
		
		Если ЗначениеЗаполнено(СведенияОПокупателе.ЮридическийАдрес.postal_code) Тогда
			ЗаписьXML.ЗаписатьАтрибут("Индекс", СокрЛП(СведенияОПокупателе.ЮридическийАдрес.postal_code));
		КонецЕсли;
		Если ДокВыгрузки.Покупатель.Страна.ЭтоСтрана=Ложь тогда
			Если Лев(СокрЛП(ДокВыгрузки.Покупатель.Страна.Код),1)= "0" тогда
				ЗаписьXML.ЗаписатьАтрибут("КодРегион",Сред(СокрЛП(ДокВыгрузки.Покупатель.Страна.Код),2));	
			Иначе	
				ЗаписьXML.ЗаписатьАтрибут("КодРегион",СокрЛП(ДокВыгрузки.Покупатель.Страна.Код));
			КонецЕсли;	
		Иначе 	
			ЗаписьXML.ЗаписатьАтрибут("КодРегион",СокрЛП(ДокВыгрузки.Покупатель.Страна.КодОКСМ));
		КонецЕсли; 
		ЗаписьXML.ЗаписатьАтрибут("НаимРегион",СокрЛП(СведенияОПокупателе.ЮридическийАдрес.region_with_type));
		Если ЗначениеЗаполнено(СведенияОПокупателе.ЮридическийАдрес.city_district_with_type) Тогда
			ЗаписьXML.ЗаписатьАтрибут("Район",СокрЛП(СведенияОПокупателе.ЮридическийАдрес.city_district_with_type));
		КонецЕсли;
		Если ЗначениеЗаполнено(СведенияОПокупателе.ЮридическийАдрес.city_with_type) Тогда
			ЗаписьXML.ЗаписатьАтрибут("Город", СокрЛП(СведенияОПокупателе.ЮридическийАдрес.city_with_type));
		КонецЕсли;
		Если ЗначениеЗаполнено(СведенияОПокупателе.ЮридическийАдрес.settlement_with_type) Тогда
			ЗаписьXML.ЗаписатьАтрибут("НаселПункт", СокрЛП(СведенияОПокупателе.ЮридическийАдрес.settlement_with_type));
		КонецЕсли;
		Если ЗначениеЗаполнено(СведенияОПокупателе.ЮридическийАдрес.street_with_type) Тогда
			ЗаписьXML.ЗаписатьАтрибут("Улица", СокрЛП(СведенияОПокупателе.ЮридическийАдрес.street_with_type));
		КонецЕсли;
		Если ЗначениеЗаполнено(СведенияОПокупателе.ЮридическийАдрес.house) Тогда
			ЗаписьXML.ЗаписатьАтрибут("Дом", СокрЛП(СведенияОПокупателе.ЮридическийАдрес.house));
		КонецЕсли;
		Если ЗначениеЗаполнено(СведенияОПокупателе.ФактическийАдрес.block) Тогда
			ЗаписьXML.ЗаписатьАтрибут("Корпус", СведенияОПокупателе.ФактическийАдрес.block);
		КонецЕсли;
		Если ЗначениеЗаполнено(СведенияОПокупателе.ЮридическийАдрес.flat) Тогда
			ЗаписьXML.ЗаписатьАтрибут("Кварт", СокрЛП(СведенияОПокупателе.ЮридическийАдрес.flat));
		КонецЕсли;
		
		ЗаписьXML.ЗаписатьКонецЭлемента();
	КонецЕсли;
	
	ЗаписьXML.ЗаписатьКонецЭлемента();        
	
	Если ЗначениеЗаполнено(СведенияОПокупателе.НомерСчета) Тогда 
		ЗаписьXML.ЗаписатьНачалоЭлемента("БанкРекв");
		ЗаписьXML.ЗаписатьАтрибут("НомерСчета", Строка(СведенияОПокупателе.НомерСчета));
		ЗаписьXML.ЗаписатьНачалоЭлемента("СвБанк");
		ЗаписьXML.ЗаписатьАтрибут("НаимБанк", СведенияОПокупателе.Банк.Наименование);
		ЗаписьXML.ЗаписатьАтрибут("КорСчет", Строка(СведенияОПокупателе.КоррСчет));
		ЗаписьXML.ЗаписатьАтрибут("БИК", Строка(СведенияОПокупателе.БИК));
		ЗаписьXML.ЗаписатьКонецЭлемента();
		ЗаписьXML.ЗаписатьКонецЭлемента();
	КонецЕсли; 	
	ЗаписьXML.ЗаписатьКонецЭлемента();
	//Конец СвПокуп	
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("ДенИзм");
	ЗаписьXML.ЗаписатьАтрибут("КодОКВ", Строка("643"));
	ЗаписьXML.ЗаписатьАтрибут("НаимОКВ", Строка("Российский рубль"));
	ЗаписьXML.ЗаписатьКонецЭлемента(); 
	
	//Авансовый СЧФ
	XMLУПД2026 = Константы.XMLУПД2026.Получить();
	ТзАвСФ = ЗначенияСервера.ПолучитьАвансовыСчетФактуру(ДокВыгрузки);
	Если XMLУПД2026 и ТзАвСФ.Количество()>0 Тогда
		ЗаписьXML.ЗаписатьНачалоЭлемента("ДопСвФХЖ1");
		Для Каждого Стр Из ТзАвСФ Цикл
			ЗаписьXML.ЗаписатьНачалоЭлемента("СопрДокФХЖ");
			ЗаписьXML.ЗаписатьАтрибут("РеквНаимДок", "АСЧФ");
			ЗаписьXML.ЗаписатьАтрибут("РеквНомерДок", Строка(Стр.НомерДокумента));
			ЗаписьXML.ЗаписатьАтрибут("РеквДатаДок", Формат(Стр.ДатаДокумента, "ДЛФ=Д"));
			ЗаписьXML.ЗаписатьКонецЭлемента();
		КонецЦикла;
		ЗаписьXML.ЗаписатьКонецЭлемента();
	КонецЕсли;	
	ЗаписьXML.ЗаписатьКонецЭлемента(); 
	
	//Табличная часть
	ЗаписьXML.ЗаписатьНачалоЭлемента("ТаблСчФакт");
	НомерСтроки = 0;
	ИтогКолМест = 0;
	ИтогБрутто = 0;
	ИтогНетто = 0;
	ИтогСумБезНДС = 0;
	ИтогСумНДС = 0;
	ИтогСумУчНДС = 0;  
	ДанныеТоваров = ДокВыгрузки.Материалы.Выгрузить();
	
	
	Для Каждого стрТовар из ДанныеТоваров цикл
		ХарактеристикаДляПоиска = "";
		НомерСтроки = НомерСтроки + 1; 
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("СведТов");
		ЗаписьXML.ЗаписатьАтрибут("НомСтр", Строка(НомерСтроки));
		СтавкаКоэффициент = ЗначенияСервера.ПреобразуемСтавкиНДС(СтрТовар.СтавкаНДС);
		
		Если ЗначениеЗаполнено(СтрТовар.ВсегоСНДС) И ЗначениеЗаполнено(СтрТовар.СтавкаНДС) Тогда
			СуммаНДС = Конвертация.НдсОтСуммыПолучить(СтрТовар.ВсегоСНДС,СтрТовар.СтавкаНДС);
			СуммаБезНДС = СтрТовар.ВсегоСНДС - СуммаНДС;
			СуммаНДСдоОкругления = СтрТовар.ВсегоСНДС - СуммаБезНДС;
			СуммаНДСизСуммы = Окр(СуммаНДСдоОкругления, 2);
		КонецЕсли;
		Если ЗначениеЗаполнено(СуммаБезНДС) И ЗначениеЗаполнено(СтрТовар.Количество) Тогда		
			Цена = СуммаБезНДС / СтрТовар.Количество;
		КонецЕсли;
		ЗаписьXML.ЗаписатьАтрибут("НаимТов", СокрЛП(СтрТовар.Материал));
		
		Если ТипЗнч(ДокВыгрузки)=Тип("ДокументСсылка.РеализацияТоваров") Тогда
			ЗаписьXML.ЗаписатьАтрибут("ОКЕИ_Тов", СокрЛП(СтрТовар.Материал.ЕдиницаИзмерения.Код)); 
			ЗаписьXML.ЗаписатьАтрибут("НаимЕдИзм", СокрЛП(СтрТовар.Материал.ЕдиницаИзмерения));
		КонецЕсли;
		
		ЗаписьXML.ЗаписатьАтрибут("КолТов", Строка(СтрЗаменить(СтрТовар.Количество, Символы.НПП,"")));
		ЗаписьXML.ЗаписатьАтрибут("ЦенаТов",Строка(Формат(Цена,"ЧДЦ=2; ЧГ=0; ЧРД=.")));
		ЗаписьXML.ЗаписатьАтрибут("НалСт", СтавкаКоэффициент.Ставка);  
		ЗаписьXML.ЗаписатьАтрибут("СтТовБезНДС", Строка(Формат(СуммаБезНДС,"ЧДЦ=2; ЧГ=0; ЧРД=.")));
		ЗаписьXML.ЗаписатьАтрибут("СтТовУчНал", Строка(Формат(СтрТовар.ВсегоСНДС,"ЧДЦ=2; ЧГ=0; ЧРД=.")));
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("ДопСведТов");
		ЗаписьXML.ЗаписатьАтрибут("ПрТовРаб", "1");
		ЗаписьXML.ЗаписатьАтрибут("КодТов", СокрЛП(?(СокрЛП(СтрТовар.Материал.Код)="",СтрТовар.Материал.Код,СтрТовар.Материал.Код)));
		ЗаписьXML.ЗаписатьАтрибут("НадлОтп", "2"); 
		
		//Маркировка
		мКИЗ = ПолучитьКИЗ(ДокВыгрузки,СтрТовар.Материал);
		Если мКИЗ.Количество() > 0 Тогда
			ЗаписьXML.ЗаписатьНачалоЭлемента("НомСредИдентТов");  
			Для Каждого стрКИЗ из мКИЗ цикл
				ЗаписьXML.ЗаписатьНачалоЭлемента("КИЗ"); 
				ЗаписьXML.ЗаписатьТекст(Лев(стрКИЗ.КИЗ,31));
				ЗаписьXML.ЗаписатьКонецЭлемента();
			КонецЦикла;
			ЗаписьXML.ЗаписатьКонецЭлемента();
		КонецЕсли;
		
		ЗаписьXML.ЗаписатьКонецЭлемента();
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("Акциз");
		ЗаписьXML.ЗаписатьНачалоЭлемента("БезАкциз");
		ЗаписьXML.ЗаписатьТекст("без акциза");
		ЗаписьXML.ЗаписатьКонецЭлемента();
		ЗаписьXML.ЗаписатьКонецЭлемента();
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("СумНал"); 
		Если СуммаНДСизСуммы > 0 Тогда
			ЗаписьXML.ЗаписатьНачалоЭлемента("СумНал");
			ЗаписьXML.ЗаписатьТекст(Строка(Формат(СуммаНДСизСуммы,"ЧДЦ=2; ЧГ=0; ЧРД=.")));
		ИначеЕсли СуммаНДСизСуммы = 0 Тогда		
			ЗаписьXML.ЗаписатьНачалоЭлемента("БезНДС");
			ЗаписьXML.ЗаписатьТекст("без НДС");
		КонецЕсли;
		ЗаписьXML.ЗаписатьКонецЭлемента();
		ЗаписьXML.ЗаписатьКонецЭлемента();
		
		//Если заполнен ID Заказа (для АВТОПИТЕР) выводим его, иначе Штрихкод
		//Если ЗначениеЗаполнено(ДокВыгрузки.Основание)
		//	И ТипЗнч(ДокВыгрузки.Основание) = Тип("ДокументСсылка.ЗаказПокупателя") Тогда
		//	текIDЗаказа = ПолучитьIDЗаказа(ДокВыгрузки.Основание, СтрТовар.Материал);
		//КонецЕсли;
		//
		//ЗаписьXML.ЗаписатьНачалоЭлемента("ИнфПолФХЖ2");
		//Если ЗначениеЗаполнено(текIDЗаказа) Тогда
		//	ЗаписьXML.ЗаписатьАтрибут( "Идентиф", "ИдентификаторЗаказаКлиента");
		//	ЗаписьXML.ЗаписатьАтрибут("Значен", СокрЛП(текIDЗаказа));			
		//Иначе
		//	ЗаписьXML.ЗаписатьАтрибут( "Идентиф", "штрихкод");
		//	ЗаписьXML.ЗаписатьАтрибут("Значен", СокрЛП(СтрТовар.Материал.ШтрихКод));
		//КонецЕсли;
		//ЗаписьXML.ЗаписатьКонецЭлемента();//ИнфПолФХЖ2
		
		ЗаписьXML.ЗаписатьКонецЭлемента();
		ИтогКолМест = ИтогКолМест + СтрТовар.Количество; 
		ИтогНетто = ИтогНетто + СтрТовар.Количество;
		ИтогСумБезНДС = ИтогСумБезНДС + СуммаБезНДС;
		ИтогСумНДС = ИтогСумНДС + СуммаНДС;	
		ИтогСумУчНДС = ИтогСумУчНДС + СтрТовар.ВсегоСНДС;		
	КонецЦикла;
	// Конец табличной части
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("ВсегоОпл");
	ЗаписьXML.ЗаписатьАтрибут("СтТовБезНДСВсего", Строка(Формат(ИтогСумБезНДС,"ЧДЦ=2; ЧГ=0; ЧРД=.")));
	ЗаписьXML.ЗаписатьАтрибут("СтТовУчНалВсего", Строка(Формат(ИтогСумУчНДС,"ЧДЦ=2; ЧГ=0; ЧРД=.")));
	ЗаписьXML.ЗаписатьАтрибут("КолНеттоВс","0" );	
	ЗаписьXML.ЗаписатьНачалоЭлемента("СумНалВсего");
	ЗаписьXML.ЗаписатьНачалоЭлемента("СумНал");
	ЗаписьXML.ЗаписатьТекст(Строка(Формат(ИтогСумНДС,"ЧДЦ=2; ЧГ=0; ЧРД=.")));
	ЗаписьXML.ЗаписатьКонецЭлемента();
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.ЗаписатьКонецЭлемента();
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("СвПродПер");
	ЗаписьXML.ЗаписатьНачалоЭлемента("СвПер");
	ЗаписьXML.ЗаписатьАтрибут("СодОпер", "Товары переданы"); 
	ЗаписьXML.ЗаписатьАтрибут("ДатаПер", Формат(ДатаУПД, "ДЛФ=Д"));
	ЗаписьXML.ЗаписатьНачалоЭлемента("ОснПер");
	ЗаписьXML.ЗаписатьАтрибут("РеквНаимДок", "Реализация");                                     
	ЗаписьXML.ЗаписатьАтрибут("РеквНомерДок", Строка(ДокВыгрузки.Номер));
	ЗаписьXML.ЗаписатьАтрибут("РеквДатаДок", Строка(Формат(ДокВыгрузки.Дата, "ДЛФ=Д")));
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	//Если ТипЗнч(ДокВыгрузки) = Тип("ДокументСсылка.ЗаказНаряд")
	//	И ДокВыгрузки.Покупатель.ШаблонСтрокиДанныеТранспортировки = 1 Тогда 
	//	ЗаписьXML.ЗаписатьНачалоЭлемента("ТранГруз");
	//	ДатаТранГруз = ?(ЗначениеЗаполнено(ДокВыгрузки.ДатаЗакрытия),ДокВыгрузки.ДатаЗакрытия,ДокВыгрузки.Дата); 
	//	СтрТранГруз = "Заказ-наряд № "+СокрЛП(ДокВыгрузки.Номер)+" от "+Формат(ДатаТранГруз,"ДЛФ=Д")+" г.";
	//	ЗаписьXML.ЗаписатьАтрибут("СвТранГруз", СтрТранГруз);
	//	ЗаписьXML.ЗаписатьКонецЭлемента();
	//КонецЕсли;
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("СвПерВещи");
	ЗаписьXML.ЗаписатьКонецЭлемента();
	ЗаписьXML.ЗаписатьКонецЭлемента();
	ЗаписьXML.ЗаписатьНачалоЭлемента("ИнфПолФХЖ3");
	ЗаписьXML.ЗаписатьКонецЭлемента();
	ЗаписьXML.ЗаписатьКонецЭлемента();
	//Подписант
	ЗаписьXML.ЗаписатьНачалоЭлемента("Подписант");
	ЗаписьXML.ЗаписатьАтрибут("ОснПолн", "Должностные обязанности");
	ЗаписьXML.ЗаписатьАтрибут("ОблПолн", "1");
	ЗаписьXML.ЗаписатьАтрибут("Статус", "1");	
	ЗаписьXML.ЗаписатьНачалоЭлемента("ЮЛ");
	
	Если ЗначениеЗаполнено(ДокВыгрузки.Холдер.ИНН) Тогда
		ЗаписьXML.ЗаписатьАтрибут("ИННЮЛ", ДокВыгрузки.Холдер.ИНН);		
	Иначе 		
		ЗаписьXML.ЗаписатьАтрибут("ИННЮЛ", "0101010108");
	КонецЕсли;
	
	ПодписантОветственный = "";
	ЗаписьXML.ЗаписатьАтрибут("Должн", "Директор");
	ЗаписьXML.ЗаписатьНачалоЭлемента("ФИО");
	ЗаписьXML.ЗаписатьАтрибут("Фамилия", "Ф");
	ЗаписьXML.ЗаписатьАтрибут("Имя", "И");
	
	ЗаписьXML.ЗаписатьАтрибут("Отчество", "О");
	
	ЗаписьXML.ЗаписатьКонецЭлемента();
	ЗаписьXML.ЗаписатьКонецЭлемента();
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.ЗаписатьКонецЭлемента();
	ЗаписьXML.ЗаписатьКонецЭлемента(); 
	
	Возврат ЗаписьXML.Закрыть();
КонецФункции

&НаСервере
Функция ПолучитьКИЗ(ДокВыгрузки,Номенклатура) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЧЗВыбытиеТовары.КИЗ КАК КИЗ
	               |ИЗ
	               |	Документ.ЧЗВыбытие.Товары КАК ЧЗВыбытиеТовары
	               |ГДЕ
	               |	ЧЗВыбытиеТовары.Ссылка.Основание = &Ссылка
	               |	И ЧЗВыбытиеТовары.Номенклатура = &Номенклатура
				   |    И ЧЗВыбытиеТовары.Ссылка.ПометкаУдаления = ЛОЖЬ";	               	
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("Ссылка", ДокВыгрузки);	
			
	Возврат Запрос.Выполнить().Выгрузить();
КонецФункции  

&НаСервере
Функция ПолучитьВыбытие(ДокВыгрузки) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЧЗВыбытиеТовары.КИЗ КАК КИЗ,
	               |	ВЫБОР
	               |		КОГДА ЧЗВыбытиеТовары.ВыведенИзОборота = Истина
	               |			ТОГДА 1
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК Выводить,
	               |	ВЫБОР
	               |		КОГДА ЧЗВыбытиеТовары.ВыведенИзОборота = Ложь
	               |			ТОГДА 1
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК НеВыводить
	               |ИЗ
	               |	Документ.ЧЗВыбытие.Товары КАК ЧЗВыбытиеТовары
	               |ГДЕ
	               |	ЧЗВыбытиеТовары.Ссылка.Основание = &Ссылка
	               |	И ЧЗВыбытиеТовары.Ссылка.ПометкаУдаления = ЛОЖЬ";	               	
	
	Запрос.УстановитьПараметр("Ссылка", ДокВыгрузки);	
		тз = 	Запрос.Выполнить().Выгрузить();
	Если тз.Количество() = 0 тогда
		Возврат 0;
	ИначеЕсли тз.Итог("НеВыводить")> 0 и тз.Итог("Выводить")>0 тогда
		Возврат 1;
	ИначеЕсли тз.Итог("НеВыводить")> 0  тогда
		Возврат 2;	
		
	Иначе
		Возврат 3;
	КонецЕсли;		
	
КонецФункции

&НаСервере
Функция ПолучитьКИЗ_УКД(Реализация,Номенклатура,ДатаВозврата,Стало) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЧЗВыбытиеТовары.КИЗ КАК КИЗ,
	               |	1 КАК КолРеал
	               |ПОМЕСТИТЬ ТЗ_Отгрузки
	               |ИЗ
	               |	Документ.ЧЗВыбытие.Товары КАК ЧЗВыбытиеТовары
	               |ГДЕ
	               |	ЧЗВыбытиеТовары.Ссылка.Основание = &Реализация
	               |	И ЧЗВыбытиеТовары.Номенклатура = &Номенклатура
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ЧЗПоступлениеТовары.КИЗ КАК КИЗ,
	               |	-1 КАК КолВозвр
	               |ПОМЕСТИТЬ ТЗ_Возврата
	               |ИЗ
	               |	Документ.ЧЗПоступление.Товары КАК ЧЗПоступлениеТовары
	               |ГДЕ
	               |	ЧЗПоступлениеТовары.Ссылка.Основание.ДокументОснование = &Реализация
	               |	И ЧЗПоступлениеТовары.Ссылка.Основание.Дата < &ДатаВозврата
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ТЗ_Отгрузки.КИЗ КАК КИЗ,
	               |	ТЗ_Отгрузки.КолРеал КАК КолРеал,
	               |	ЕСТЬNULL(ТЗ_Возврата.КолВозвр, 0) КАК КолВозвр,
	               |	СУММА(ТЗ_Отгрузки.КолРеал + ЕСТЬNULL(ТЗ_Возврата.КолВозвр, 0)) КАК Остаток
	               |ИЗ
	               |	ТЗ_Отгрузки КАК ТЗ_Отгрузки
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ТЗ_Возврата КАК ТЗ_Возврата
	               |		ПО ((ВЫРАЗИТЬ(ТЗ_Отгрузки.КИЗ КАК СТРОКА(31))) = (ВЫРАЗИТЬ(ТЗ_Возврата.КИЗ КАК СТРОКА(31))))
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ТЗ_Отгрузки.КИЗ,
	               |	ТЗ_Отгрузки.КолРеал,
	               |	ТЗ_Возврата.КолВозвр
	               |
	               |ИМЕЮЩИЕ
	               |	СУММА(ТЗ_Отгрузки.КолРеал + ЕСТЬNULL(ТЗ_Возврата.КолВозвр, 0)) > 0";
	Если Стало Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"Дата < &ДатаВозврата","Дата <= &ДатаВозврата");
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Реализация", Реализация);
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("ДатаВозврата", ДатаВозврата);
		
	Возврат Запрос.Выполнить().Выгрузить();	
КонецФункции

&НаСервере
Функция ПолучитьIDЗаказа(ЗаказПокупателя, Номенклатура) Экспорт
	текIDЗаказа = "";
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЗаказПокупателяТовары.IDЗаказа КАК IDЗаказа
	               |ИЗ
	               |	Документ.ЗаказПокупателя.Товары КАК ЗаказПокупателяТовары
	               |ГДЕ
	               |	ЗаказПокупателяТовары.Ссылка = &Заказ
	               |	И ЗаказПокупателяТовары.Номенклатура = &Номенклатура";	
	Запрос.УстановитьПараметр("Заказ", ЗаказПокупателя);
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);		
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Если ЗначениеЗаполнено(текIDЗаказа) Тогда
			текIDЗаказа = текIDЗаказа+","+Выборка.IDЗаказа;
		Иначе
			текIDЗаказа = Выборка.IDЗаказа;
		КонецЕсли;			
	КонецЦикла;
		
	Возврат текIDЗаказа;
КонецФункции

&НаСервере
Функция Реализация_СформироватьXML_УПДкамаз503(ДокВыгрузки) Экспорт
	ИдОтпр = "2BK-0000000000-0000000";
	ИдПол = "2BK-0000000000-0000000000000";  
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПрослеживаемыеТовары.Номенклатура КАК Номенклатура,
	|	ПрослеживаемыеТовары.РНПТ КАК РНПТ,
	|	ПрослеживаемыеТовары.Количество КАК Количество,
	|	ПрослеживаемыеТовары.КоличествоПрослеживаемости КАК КоличествоПрослеживаемости,
	|	ПрослеживаемыеТовары.СтранаПроисхождения КАК СтранаПроисхождения
	|ИЗ
	|	РегистрНакопления.ПрослеживаемыеТовары КАК ПрослеживаемыеТовары
	|ГДЕ
	|	ПрослеживаемыеТовары.Регистратор = &Регистратор";
	
	Запрос.УстановитьПараметр("Регистратор", ДокВыгрузки);
	СведенияОПрослеживаемости = Запрос.Выполнить().Выгрузить();
	
	Если СведенияОПрослеживаемости.Количество() > 0 тогда 
		ВыводитьРНПТ = Истина;
	Иначе
		ВыводитьРНПТ = Ложь;	
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗначенияСвойствКонтрагентов.Значение КАК Значение
	|ИЗ
	|	РегистрСведений.ЗначенияСвойствКонтрагентов КАК ЗначенияСвойствКонтрагентов
	|ГДЕ
	|	ЗначенияСвойствКонтрагентов.Контрагент = &Контрагент
	|	И ЗначенияСвойствКонтрагентов.Свойство = &Свойство";
	
	Запрос.УстановитьПараметр("Контрагент", ДокВыгрузки.Контрагент); 
	Запрос.УстановитьПараметр("Свойство", Справочники.ЗначенияСвойствОбъектов.ГрузотправительПрочерк); 
	СвойствоПрочерк = Запрос.Выполнить().Выгрузить();
	
	Если СвойствоПрочерк.Количество() > 0 тогда 
		ВыводитьПрочерк = Истина;
	Иначе
		ВыводитьПрочерк = Ложь;	
	КонецЕсли;
	
	
	
	
	Если (ДокВыгрузки.Контрагент.ТипКонтрагента=Перечисления.ТипКонтрагента.Ип) ИЛИ (ДокВыгрузки.Контрагент.ТипКонтрагента=Перечисления.ТипКонтрагента.Фл ) Тогда
		КонтрИП = Истина;
	КонецЕсли;
	
	Если ТипЗнч(ДокВыгрузки) = Тип("ДокументСсылка.ЗаказНаряд") Тогда 
		ДатаУПД = ДокВыгрузки.ДатаЗакрытия;
	Иначе
		ДатаУПД = ДокВыгрузки.Дата;
	КонецЕсли;
	
	НомУПД = ?(ЗначениеЗаполнено(ДокВыгрузки.НомерСчф), ДокВыгрузки.НомерСчф, ДокВыгрузки.Номер);
	
	
	ОргИП = Ложь;
	БанковскийСчетКонтрагента = ДокВыгрузки.Контрагент.РасчСчет;
	БанковскийСчетФирмы = ДокВыгрузки.Организация.РасчСчет;
	СведенияОПоставщике = ЗначенияСервера.СведенияОЮрФизЛице(ДокВыгрузки.Организация, ДатаУПД);
	СведенияОПокупателе = ЗначенияСервера.СведенияОЮРФизЛице(ДокВыгрузки.Контрагент, ДатаУПД);
	
	Если ДокВыгрузки.Метаданные().Реквизиты.Найти("Получатель")<>Неопределено И ЗначениеЗаполнено(ДокВыгрузки.Получатель) и ТипЗнч(ДокВыгрузки.Получатель) = Тип("СправочникСсылка.Контрагенты") тогда
		СведенияОГрузополучателе  = ЗначенияСервера.СведенияОЮрФизЛице(ДокВыгрузки.Получатель,  ДатаУПД);
		ПолучательПоДокументу = ДокВыгрузки.Получатель;
	Иначе
		СведенияОГрузополучателе  = СведенияОПокупателе;
		ПолучательПоДокументу = ДокВыгрузки.Контрагент;
	КонецЕсли;  
	
	СведенияОГрузоотправитель = СведенияОПоставщике;
	
	НовыйУникальныйИдентификатор = Новый УникальныйИдентификатор;
	ДатаДляИндифик = ТекущаяДата();
	Год   = Строка(Формат(ДатаДляИндифик, "ДФ=гггг")); // Год
	Месяц = Строка(Формат(ДатаДляИндифик, "ДФ=ММ"));   // Месяц
	День  = Строка(Формат(ДатаДляИндифик, "ДФ=дд"));   // День
	
	ДатаПреобразоваянная = Год + Месяц + День;
	
	ЗаписьXML = Новый ЗаписьXML;
	
	ЗаписьXML.УстановитьСтроку();
	ЗаписьXML.ЗаписатьОбъявлениеXML();
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("Файл");
	ЗаписьXML.ЗаписатьСоответствиеПространстваИмен("xsd","http://www.w3.org/2001/XMLSchema");
	ЗаписьXML.ЗаписатьСоответствиеПространстваИмен("xsi","http://www.w3.org/2001/XMLSchema-instance");
	
	ЗаписьXML.ЗаписатьАтрибут("ИдФайл", "ON_NSCHFDOPPR_" + ИдПол + "_" + ИдОтпр + "_" + ДатаПреобразоваянная + "_" + НовыйУникальныйИдентификатор);	
	ЗаписьXML.ЗаписатьАтрибут("ВерсФорм", "5.03");
	ЗаписьXML.ЗаписатьАтрибут("ВерсПрог", "Diadoc 1.0");
	ЗаписьXML.ЗаписатьНачалоЭлемента("Документ");	
	ЗаписьXML.ЗаписатьАтрибут("КНД", "1115131"); 	
	ЗаписьXML.ЗаписатьАтрибут("ПоФактХЖ", "Документ об отгрузке товаров (выполнении работ), передаче имущественных прав (документ об оказании услуг)");
	ЗаписьXML.ЗаписатьАтрибут("НаимДокОпр", "УПД");
	ЗаписьXML.ЗаписатьАтрибут("ДатаИнфПр", Формат(ДатаУПД, "ДЛФ=Д"));
	ЗаписьXML.ЗаписатьАтрибут("ВремИнфПр", "00.00.00");
	ЗаписьXML.ЗаписатьАтрибут("НаимЭконСубСост", ДокВыгрузки.Организация.НаименованиеПолное);
	ЗаписьXML.ЗаписатьАтрибут("Функция", "СЧФДОП");
	ЗаписьXML.ЗаписатьНачалоЭлемента("СвСчФакт");
	ЗаписьXML.ЗаписатьАтрибут("НомерДок", НомУПД);
	Если ТипЗнч(ДокВыгрузки) = Тип("ДокументСсылка.ЗаказНаряд") Тогда 
		ЗаписьXML.ЗаписатьАтрибут("ДатаДок", Формат(ДатаУПД, "ДЛФ=Д"));
	Иначе
		ЗаписьXML.ЗаписатьАтрибут("ДатаДок", Формат(ДатаУПД, "ДЛФ=Д"));   
		
	КонецЕсли;
	
	
	//Продавец
	ЗаписьXML.ЗаписатьНачалоЭлемента("СвПрод");
	ЗаписьXML.ЗаписатьНачалоЭлемента("ИдСв");
	ЗаписьXML.ЗаписатьНачалоЭлемента("СвЮЛУч");  
	ЗаписьXML.ЗаписатьАтрибут("КПП", ДокВыгрузки.Организация.КПП);
	ЗаписьXML.ЗаписатьАтрибут("НаимОрг", ДокВыгрузки.Организация.НаименованиеПолное);
	ЗаписьXML.ЗаписатьАтрибут("ИННЮЛ", ДокВыгрузки.Организация.ИНН);
	ЗаписьXML.ЗаписатьКонецЭлемента();
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("Адрес");
	ЗаписьXML.ЗаписатьНачалоЭлемента("АдрРФ");
	
	Если ЗначениеЗаполнено(СведенияОПоставщике.ЮридическийАдрес.postal_code) Тогда
		ЗаписьXML.ЗаписатьАтрибут("Индекс", СокрЛП(СведенияОПоставщике.ЮридическийАдрес.postal_code));
	КонецЕсли;
	Если ДокВыгрузки.Организация.Страна.ЭтоСтрана=Ложь тогда
		Если Лев(СокрЛП(ДокВыгрузки.Организация.Страна.Код),1)= "0" тогда
			ЗаписьXML.ЗаписатьАтрибут("КодРегион",Сред(СокрЛП(ДокВыгрузки.Организация.Страна.Код),2));	
		Иначе	
			ЗаписьXML.ЗаписатьАтрибут("КодРегион",СокрЛП(ДокВыгрузки.Организация.Страна.Код));
		КонецЕсли;	
	Иначе 	
		ЗаписьXML.ЗаписатьАтрибут("КодРегион",СокрЛП(ДокВыгрузки.Организация.Страна.КодОКСМ));	
	КонецЕсли;
	ЗаписьXML.ЗаписатьАтрибут("НаимРегион",СокрЛП(СведенияОПоставщике.ЮридическийАдрес.region_with_type));
	
	Если ЗначениеЗаполнено(СведенияОПоставщике.ЮридическийАдрес.city_district_with_type) Тогда
		ЗаписьXML.ЗаписатьАтрибут("Район",СокрЛП(СведенияОПоставщике.ЮридическийАдрес.city_district_with_type));
	КонецЕсли;
	Если ЗначениеЗаполнено(СведенияОПоставщике.ЮридическийАдрес.city_with_type) Тогда
		ЗаписьXML.ЗаписатьАтрибут("Город", СокрЛП(СведенияОПоставщике.ЮридическийАдрес.city_with_type));
	КонецЕсли;
	Если ЗначениеЗаполнено(СведенияОПоставщике.ЮридическийАдрес.settlement_with_type) Тогда
		ЗаписьXML.ЗаписатьАтрибут("НаселПункт", СокрЛП(СведенияОПоставщике.ЮридическийАдрес.settlement_with_type));
	КонецЕсли;
	Если ЗначениеЗаполнено(СведенияОПоставщике.ЮридическийАдрес.street_with_type) Тогда
		ЗаписьXML.ЗаписатьАтрибут("Улица", СокрЛП(СведенияОПоставщике.ЮридическийАдрес.street_with_type));
	КонецЕсли;
	Если ЗначениеЗаполнено(СведенияОПоставщике.ЮридическийАдрес.house) Тогда
		ЗаписьXML.ЗаписатьАтрибут("Дом", СокрЛП(СведенияОПоставщике.ЮридическийАдрес.house));
	КонецЕсли;
	Если ЗначениеЗаполнено(СведенияОПоставщике.ЮридическийАдрес.flat) Тогда
		ЗаписьXML.ЗаписатьАтрибут("Кварт", СокрЛП(СведенияОПоставщике.ЮридическийАдрес.flat));
	КонецЕсли;
	
	ЗаписьXML.ЗаписатьКонецЭлемента();
	ЗаписьXML.ЗаписатьКонецЭлемента();
	Если ЗначениеЗаполнено(СведенияОПоставщике.НомерСчета) Тогда 
		ЗаписьXML.ЗаписатьНачалоЭлемента("БанкРекв");
		ЗаписьXML.ЗаписатьАтрибут("НомерСчета", Строка(СведенияОПоставщике.НомерСчета));
		ЗаписьXML.ЗаписатьНачалоЭлемента("СвБанк");
		ЗаписьXML.ЗаписатьАтрибут("НаимБанк", СведенияОПоставщике.Банк.Наименование);
		ЗаписьXML.ЗаписатьАтрибут("КорСчет", Строка(СведенияОПоставщике.КоррСчет));
		ЗаписьXML.ЗаписатьАтрибут("БИК", Строка(СведенияОПоставщике.БИК));
		ЗаписьXML.ЗаписатьКонецЭлемента();
		ЗаписьXML.ЗаписатьКонецЭлемента();
	КонецЕсли; 	
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	//Продавец
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("ДокПодтвОтгрНом");
	//ЗаписьXML.ЗаписатьАтрибут("РеквНаимДок", "Тот же");
	ЗаписьXML.ЗаписатьАтрибут("РеквНаимДок", "УПД");
	ЗаписьXML.ЗаписатьАтрибут("РеквНомерДок", СокрЛП(НомУПД));
	ЗаписьXML.ЗаписатьАтрибут("РеквДатаДок", Формат(ДатаУПД, "ДЛФ=Д"));
	ЗаписьXML.ЗаписатьКонецЭлемента();

	
	//СвПокуп
	ЗаписьXML.ЗаписатьНачалоЭлемента("СвПокуп");
	ЗаписьXML.ЗаписатьНачалоЭлемента("ИдСв");
	ЗаписьXML.ЗаписатьНачалоЭлемента("СвЮЛУч");
	
	КПП = ДокВыгрузки.Контрагент.КПП;	//значение по умолчанию  
	ЗаписьXML.ЗаписатьАтрибут("КПП", КПП); 
	
	ЗаписьXML.ЗаписатьАтрибут("НаимОрг", ДокВыгрузки.Контрагент.НаименованиеПолное);
	ЗаписьXML.ЗаписатьАтрибут("ИННЮЛ", ДокВыгрузки.Контрагент.ИНН);
	ЗаписьXML.ЗаписатьКонецЭлемента();
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("Адрес");
	ВыгружатьАдресаКакИностранные = ВыгружатьАдресаКакИностранные(ДокВыгрузки.Организация, ДокВыгрузки.Контрагент);
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("АдрРФ");
	
	Если ЗначениеЗаполнено(СведенияОПокупателе.ЮридическийАдрес.postal_code) Тогда
		ЗаписьXML.ЗаписатьАтрибут("Индекс", СокрЛП(СведенияОПокупателе.ЮридическийАдрес.postal_code));
	КонецЕсли;
	Если ДокВыгрузки.Контрагент.Страна.ЭтоСтрана=Ложь тогда
		Если Лев(СокрЛП(ДокВыгрузки.Контрагент.Страна.Код),1)= "0" тогда
			ЗаписьXML.ЗаписатьАтрибут("КодРегион",Сред(СокрЛП(ДокВыгрузки.Контрагент.Страна.Код),2));	
		Иначе	
			ЗаписьXML.ЗаписатьАтрибут("КодРегион",СокрЛП(ДокВыгрузки.Контрагент.Страна.Код));
		КонецЕсли;	
	Иначе 	
		ЗаписьXML.ЗаписатьАтрибут("КодРегион",СокрЛП(ДокВыгрузки.Контрагент.Страна.КодОКСМ));
	КонецЕсли; 
	ЗаписьXML.ЗаписатьАтрибут("НаимРегион",СокрЛП(СведенияОПокупателе.ЮридическийАдрес.region_with_type));
	Если ЗначениеЗаполнено(СведенияОПокупателе.ЮридическийАдрес.city_district_with_type) Тогда
		ЗаписьXML.ЗаписатьАтрибут("Район",СокрЛП(СведенияОПокупателе.ЮридическийАдрес.city_district_with_type));
	КонецЕсли;
	Если ЗначениеЗаполнено(СведенияОПокупателе.ЮридическийАдрес.city_with_type) Тогда
		ЗаписьXML.ЗаписатьАтрибут("Город", СокрЛП(СведенияОПокупателе.ЮридическийАдрес.city_with_type));
	КонецЕсли;
	Если ЗначениеЗаполнено(СведенияОПокупателе.ЮридическийАдрес.settlement_with_type) Тогда
		ЗаписьXML.ЗаписатьАтрибут("НаселПункт", СокрЛП(СведенияОПокупателе.ЮридическийАдрес.settlement_with_type));
	КонецЕсли;
	Если ЗначениеЗаполнено(СведенияОПокупателе.ЮридическийАдрес.street_with_type) Тогда
		ЗаписьXML.ЗаписатьАтрибут("Улица", СокрЛП(СведенияОПокупателе.ЮридическийАдрес.street_with_type));
	КонецЕсли;
	Если ЗначениеЗаполнено(СведенияОПокупателе.ЮридическийАдрес.house) Тогда
		ЗаписьXML.ЗаписатьАтрибут("Дом", СокрЛП(СведенияОПокупателе.ЮридическийАдрес.house));
	КонецЕсли;
	Если ЗначениеЗаполнено(СведенияОПокупателе.ФактическийАдрес.block) Тогда
		ЗаписьXML.ЗаписатьАтрибут("Корпус", СведенияОПокупателе.ФактическийАдрес.block);
	КонецЕсли;
	Если ЗначениеЗаполнено(СведенияОПокупателе.ЮридическийАдрес.flat) Тогда
		ЗаписьXML.ЗаписатьАтрибут("Кварт", СокрЛП(СведенияОПокупателе.ЮридическийАдрес.flat));
	КонецЕсли;
	
	ЗаписьXML.ЗаписатьКонецЭлемента();
	//КонецЕсли;
	
	ЗаписьXML.ЗаписатьКонецЭлемента();        
	
	Если ЗначениеЗаполнено(СведенияОПокупателе.НомерСчета) Тогда 
		ЗаписьXML.ЗаписатьНачалоЭлемента("БанкРекв");
		ЗаписьXML.ЗаписатьАтрибут("НомерСчета", Строка(СведенияОПокупателе.НомерСчета));
		ЗаписьXML.ЗаписатьНачалоЭлемента("СвБанк");
		ЗаписьXML.ЗаписатьАтрибут("НаимБанк", СведенияОПокупателе.Банк.Наименование);
		ЗаписьXML.ЗаписатьАтрибут("КорСчет", Строка(СведенияОПокупателе.КоррСчет));
		ЗаписьXML.ЗаписатьАтрибут("БИК", Строка(СведенияОПокупателе.БИК));
		ЗаписьXML.ЗаписатьКонецЭлемента();
		ЗаписьXML.ЗаписатьКонецЭлемента();
	КонецЕсли; 	
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	// конец СвПокуп	
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("ДенИзм");
	ЗаписьXML.ЗаписатьАтрибут("КодОКВ", Строка("643"));
	ЗаписьXML.ЗаписатьАтрибут("НаимОКВ", Строка("Российский рубль"));
	ЗаписьXML.ЗаписатьКонецЭлемента();
	ЗаписьXML.ЗаписатьКонецЭлемента(); 
	
	//Табличная часть
	ЗаписьXML.ЗаписатьНачалоЭлемента("ТаблСчФакт");
	НомерСтроки = 0;
	ИтогКолМест = 0;
	ИтогБрутто = 0;
	ИтогНетто = 0;
	ИтогСумБезНДС = 0;
	ИтогСумНДС = 0;
	ИтогСумУчНДС = 0;  
	
	Если ТипЗнч(ДокВыгрузки)=Тип("ДокументСсылка.ЗаказНаряд") Тогда
		ДанныеТоваров = Новый Массив; 
		
		УчетнаяДата = ?(ЗначениеЗаполнено(ДокВыгрузки.ДатаЗакрытия),ДокВыгрузки.ДатаЗакрытия,ДокВыгрузки.Дата);
		ДокДата = СокрЛП(Формат(УчетнаяДата,"ДЛФ=DD"));
		
		НаименованиеУслуги = "Услуги/работы по проведению ремонта автотехники КАМАЗ №" ;
		НаименованиеУслуги = НаименованиеУслуги + ВРег(СокрЛП(ДокВыгрузки.НомерАктаГарантийногоРемонта)) + " от " +  СокрЛП(Формат(ДокВыгрузки.ДатаАктаГарантийногоРемонта,"ДФ=dd.MM.yyyy"));
		стрТовар = Новый Структура;
		стрТовар.Вставить("Номенклатура", НаименованиеУслуги);
		стрТовар.Вставить("Количество", 1); 
		стрТовар.Вставить("Сумма", ДокВыгрузки.СуммаДокумента);
		стрТовар.Вставить("СуммаНДС", ДокВыгрузки.СуммаНДС);
		стрТовар.Вставить("СтавкаНДС", ДокВыгрузки.СтавкаНДС);
		
		ДанныеТоваров.Добавить(стрТовар);
	Иначе
		ДанныеТоваров = ДокВыгрузки.Товары.Выгрузить();
	КонецЕсли;
	
	Для Каждого стрТовар из ДанныеТоваров цикл
		ХарактеристикаДляПоиска = "";
		НомерСтроки = НомерСтроки + 1; 
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("СведТов");
		ЗаписьXML.ЗаписатьАтрибут("НомСтр", Строка(НомерСтроки));
		СтавкаКоэффициент = ЗначенияСервера.ПреобразуемСтавкиНДС(СтрТовар.СтавкаНДС);
		
		Если ЗначениеЗаполнено(СтрТовар.Сумма) И ЗначениеЗаполнено(СтрТовар.СтавкаНДС) Тогда		
			СуммаБезНДС = СтрТовар.Сумма - СтрТовар.СуммаНДС;
			СуммаНДСдоОкругления = СтрТовар.Сумма - СуммаБезНДС;
			СуммаНДСизСуммы = Окр(СуммаНДСдоОкругления, 2);
		КонецЕсли;
		Если ЗначениеЗаполнено(СуммаБезНДС) И ЗначениеЗаполнено(СтрТовар.Количество) Тогда		
			Цена = СуммаБезНДС / СтрТовар.Количество;
		КонецЕсли;
		ЗаписьXML.ЗаписатьАтрибут("НаимТов", СокрЛП(СтрТовар.Номенклатура)); 
		
		
		ЗаписьXML.ЗаписатьАтрибут("КолТов", Строка(СтрЗаменить(СтрТовар.Количество, Символы.НПП,"")));
		ЗаписьXML.ЗаписатьАтрибут("ЦенаТов",Строка(Формат(Цена,"ЧДЦ=2; ЧГ=0; ЧРД=.")));   
						
		ЗаписьXML.ЗаписатьАтрибут("НалСт", СтавкаКоэффициент.Ставка);  
		ЗаписьXML.ЗаписатьАтрибут("СтТовБезНДС", Строка(Формат(СуммаБезНДС,"ЧДЦ=2; ЧГ=0; ЧРД=.")));
		ЗаписьXML.ЗаписатьАтрибут("СтТовУчНал", Строка(Формат(СтрТовар.Сумма,"ЧДЦ=2; ЧГ=0; ЧРД=.")));	
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("ДопСведТов");
		ЗаписьXML.ЗаписатьАтрибут("ПрТовРаб", "2");
		ЗаписьXML.ЗаписатьАтрибут("НадлОтп", "2");
		ЗаписьXML.ЗаписатьКонецЭлемента();
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("Акциз");
		ЗаписьXML.ЗаписатьНачалоЭлемента("БезАкциз");
		ЗаписьXML.ЗаписатьТекст("без акциза");
		ЗаписьXML.ЗаписатьКонецЭлемента();
		ЗаписьXML.ЗаписатьКонецЭлемента();  
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("СумНал"); 
		
		Если СуммаНДСизСуммы > 0 Тогда
			ЗаписьXML.ЗаписатьНачалоЭлемента("СумНал");
			ЗаписьXML.ЗаписатьТекст(Строка(Формат(СуммаНДСизСуммы,"ЧДЦ=2; ЧГ=0; ЧРД=.")));
		ИначеЕсли СуммаНДСизСуммы = 0 Тогда		
			ЗаписьXML.ЗаписатьНачалоЭлемента("БезНДС");
			ЗаписьXML.ЗаписатьТекст("без НДС");
		КонецЕсли;
		ЗаписьXML.ЗаписатьКонецЭлемента();
		ЗаписьXML.ЗаписатьКонецЭлемента();
		
		ЗаписьXML.ЗаписатьКонецЭлемента();
//		
//		ЗаписьXML.ЗаписатьНачалоЭлемента("СумНал"); 
//		ЗаписьXML.ЗаписатьНачалоЭлемента("БезНДС");
//		ЗаписьXML.ЗаписатьТекст("без НДС");
//		
//		ЗаписьXML.ЗаписатьКонецЭлемента();
//		ЗаписьXML.ЗаписатьКонецЭлемента();
//		
//		ЗаписьXML.ЗаписатьКонецЭлемента();
		ИтогКолМест = ИтогКолМест + СтрТовар.Количество; 
		ИтогНетто = ИтогНетто + СтрТовар.Количество;
		ИтогСумБезНДС = ИтогСумБезНДС + СуммаБезНДС;
		ИтогСумНДС = ИтогСумНДС + СтрТовар.СуммаНДС;	
		ИтогСумУчНДС = ИтогСумУчНДС + СтрТовар.Сумма;
		
	КонецЦикла;
	//ИтогСумНДС =0;
	ИтогНетто = 0;
	
	
	// Конец табличной части
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("ВсегоОпл");
	ЗаписьXML.ЗаписатьАтрибут("СтТовБезНДСВсего", Строка(Формат(ИтогСумБезНДС,"ЧДЦ=2; ЧГ=0; ЧРД=.")));
	ЗаписьXML.ЗаписатьАтрибут("СтТовУчНалВсего", Строка(Формат(ИтогСумУчНДС,"ЧДЦ=2; ЧГ=0; ЧРД=.")));
	ЗаписьXML.ЗаписатьАтрибут("КолНеттоВс","0" );
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("СумНалВсего");
	Если ИтогСумНДС > 0 Тогда
	ЗаписьXML.ЗаписатьНачалоЭлемента("СумНал");
	ЗаписьXML.ЗаписатьТекст(Строка(Формат(ИтогСумНДС,"ЧДЦ=2; ЧГ=0; ЧРД=."))); 
    Иначе
	ЗаписьXML.ЗаписатьНачалоЭлемента("БезНДС");
	ЗаписьXML.ЗаписатьТекст("без НДС");
    КонецЕсли;
	
	ЗаписьXML.ЗаписатьКонецЭлемента();
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.ЗаписатьКонецЭлемента();
	ЗаписьXML.ЗаписатьКонецЭлемента();
	

	
	//ЗаписьXML.ЗаписатьНачалоЭлемента("СумНалВсего");
	//ЗаписьXML.ЗаписатьНачалоЭлемента("БезНДС");
	//ЗаписьXML.ЗаписатьТекст("без НДС");
	//ЗаписьXML.ЗаписатьКонецЭлемента();
	//ЗаписьXML.ЗаписатьКонецЭлемента();
	//
	//ЗаписьXML.ЗаписатьКонецЭлемента();
	//ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("СвПродПер");
	ЗаписьXML.ЗаписатьНачалоЭлемента("СвПер");
	ЗаписьXML.ЗаписатьАтрибут("СодОпер", "Товары переданы"); 
	ЗаписьXML.ЗаписатьАтрибут("ДатаПер", Формат(ДатаУПД, "ДЛФ=Д"));
	ЗаписьXML.ЗаписатьНачалоЭлемента("ОснПер");
	ЗаписьXML.ЗаписатьАтрибут("РеквНаимДок", "Договор");                                     
	ЗаписьXML.ЗаписатьАтрибут("РеквНомерДок", Строка(ДокВыгрузки.ДоговорВзаиморасчетов.Номер));
	ЗаписьXML.ЗаписатьАтрибут("РеквДатаДок", Строка(Формат(ДокВыгрузки.ДоговорВзаиморасчетов.НачПериода, "ДЛФ=Д")));
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	Если ТипЗнч(ДокВыгрузки) = Тип("ДокументСсылка.ЗаказНаряд")
		И ДокВыгрузки.Контрагент.ШаблонСтрокиДанныеТранспортировки = 1 Тогда 
		ЗаписьXML.ЗаписатьНачалоЭлемента("ТранГруз");
		ДатаТранГруз = ?(ЗначениеЗаполнено(ДокВыгрузки.ДатаЗакрытия),ДокВыгрузки.ДатаЗакрытия,ДокВыгрузки.Дата); 
		СтрТранГруз = "Заказ-наряд № "+СокрЛП(ДокВыгрузки.Номер)+" от "+Формат(ДатаТранГруз,"ДЛФ=Д")+" г.";
		ЗаписьXML.ЗаписатьАтрибут("СвТранГруз", СтрТранГруз);
		ЗаписьXML.ЗаписатьКонецЭлемента();
	КонецЕсли;
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("СвПерВещи");
	ЗаписьXML.ЗаписатьКонецЭлемента();
	ЗаписьXML.ЗаписатьКонецЭлемента();
	ЗаписьXML.ЗаписатьНачалоЭлемента("ИнфПолФХЖ3");
	ЗаписьXML.ЗаписатьКонецЭлемента();
	ЗаписьXML.ЗаписатьКонецЭлемента();
	//Подписант
	ЗаписьXML.ЗаписатьНачалоЭлемента("Подписант");
	ЗаписьXML.ЗаписатьАтрибут("ОснПолн", "Должностные обязанности");
	ЗаписьXML.ЗаписатьАтрибут("ОблПолн", "1");
	ЗаписьXML.ЗаписатьАтрибут("Статус", "1");	
	ЗаписьXML.ЗаписатьНачалоЭлемента("ЮЛ");
	
	Если ЗначениеЗаполнено(ДокВыгрузки.Организация.ИНН) Тогда
		ЗаписьXML.ЗаписатьАтрибут("ИННЮЛ", ДокВыгрузки.Организация.ИНН);		
	Иначе 		
		ЗаписьXML.ЗаписатьАтрибут("ИННЮЛ", "0101010108");
	КонецЕсли;
	
	//ПодписантОветственный = "";
	РукФ = "";
	РукИ = "";
	РукО = "";
	Если ЗначениеЗаполнено(ДокВыгрузки.Организация.Руководитель) Тогда
		РукФИО = СтрЗаменить(ДокВыгрузки.Организация.Руководитель, " ", Символы.ПС);
		Если СтрЧислоСтрок(РукФИО) = 3 Тогда
			РукФ = СокрЛП(СтрПолучитьСтроку(РукФИО, 1));
			РукИ = СокрЛП(СтрПолучитьСтроку(РукФИО, 2));
			РукО = СокрЛП(СтрПолучитьСтроку(РукФИО, 3));
		КонецЕсли;			
	КонецЕсли;
	ЗаписьXML.ЗаписатьАтрибут("Должн", "Директор");
	ЗаписьXML.ЗаписатьНачалоЭлемента("ФИО");
	ЗаписьXML.ЗаписатьАтрибут("Фамилия", ?(ЗначениеЗаполнено(РукФ),РукФ,"Ф"));
	ЗаписьXML.ЗаписатьАтрибут("Имя", ?(ЗначениеЗаполнено(РукИ),РукИ,"И"));	
	ЗаписьXML.ЗаписатьАтрибут("Отчество", ?(ЗначениеЗаполнено(РукО),РукО,"О"));
	
	ЗаписьXML.ЗаписатьКонецЭлемента();
	ЗаписьXML.ЗаписатьКонецЭлемента();
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.ЗаписатьКонецЭлемента();
	ЗаписьXML.ЗаписатьКонецЭлемента(); 
	
	Возврат ЗаписьXML.Закрыть();
КонецФункции

&НаСервере
Функция Реализация_СформироватьXML_СЧФ503(ДокВыгрузки) Экспорт
	ИдОтпр = "2BK-0000000000-0000000";
	ИдПол = "2BK-0000000000-0000000000000";  
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПрослеживаемыеТовары.Номенклатура КАК Номенклатура,
	|	ПрослеживаемыеТовары.РНПТ КАК РНПТ,
	|	ПрослеживаемыеТовары.Количество КАК Количество,
	|	ПрослеживаемыеТовары.КоличествоПрослеживаемости КАК КоличествоПрослеживаемости,
	|	ПрослеживаемыеТовары.СтранаПроисхождения КАК СтранаПроисхождения
	|ИЗ
	|	РегистрНакопления.ПрослеживаемыеТовары КАК ПрослеживаемыеТовары
	|ГДЕ
	|	ПрослеживаемыеТовары.Регистратор = &Регистратор";
	
	Запрос.УстановитьПараметр("Регистратор", ДокВыгрузки);
	СведенияОПрослеживаемости = Запрос.Выполнить().Выгрузить();
	
	Если СведенияОПрослеживаемости.Количество() > 0 тогда 
		ВыводитьРНПТ = Истина;
	Иначе
		ВыводитьРНПТ = Ложь;	
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
 |	ЗначенияСвойствКонтрагентов.Значение КАК Значение
 |ИЗ
 |	РегистрСведений.ЗначенияСвойствКонтрагентов КАК ЗначенияСвойствКонтрагентов
 |ГДЕ
 |	ЗначенияСвойствКонтрагентов.Контрагент = &Контрагент
 |	И ЗначенияСвойствКонтрагентов.Свойство = &Свойство";
 
   Запрос.УстановитьПараметр("Контрагент", ДокВыгрузки.Контрагент); 
   Запрос.УстановитьПараметр("Свойство", Справочники.ЗначенияСвойствОбъектов.ГрузотправительПрочерк); 
   СвойствоПрочерк = Запрос.Выполнить().Выгрузить();
	
	Если СвойствоПрочерк.Количество() > 0 тогда 
		ВыводитьПрочерк = Ложь;
	Иначе
		ВыводитьПрочерк = Ложь;	
	КонецЕсли;

 
 
 
	
	Если (ДокВыгрузки.Контрагент.ТипКонтрагента=Перечисления.ТипКонтрагента.Ип) ИЛИ (ДокВыгрузки.Контрагент.ТипКонтрагента=Перечисления.ТипКонтрагента.Фл ) Тогда
		КонтрИП = Истина;
	КонецЕсли;
	
	Если ТипЗнч(ДокВыгрузки) = Тип("ДокументСсылка.ЗаказНаряд") Тогда 
		ДатаУПД = ДокВыгрузки.ДатаЗакрытия;
	Иначе
		ДатаУПД = ДокВыгрузки.Дата;
	КонецЕсли;
	
	
	
	ОргИП = Ложь;
	БанковскийСчетКонтрагента = ДокВыгрузки.Контрагент.РасчСчет;
	БанковскийСчетФирмы = ДокВыгрузки.Организация.РасчСчет;
	СведенияОПоставщике = ЗначенияСервера.СведенияОЮрФизЛице(ДокВыгрузки.Организация, ДатаУПД);
	СведенияОПокупателе = ЗначенияСервера.СведенияОЮРФизЛице(ДокВыгрузки.Контрагент, ДатаУПД);
	
	Если ДокВыгрузки.Метаданные().Реквизиты.Найти("Получатель")<>Неопределено И ЗначениеЗаполнено(ДокВыгрузки.Получатель) и ТипЗнч(ДокВыгрузки.Получатель) = Тип("СправочникСсылка.Контрагенты") тогда
		СведенияОГрузополучателе  = ЗначенияСервера.СведенияОЮрФизЛице(ДокВыгрузки.Получатель,  ДатаУПД);
		ПолучательПоДокументу = ДокВыгрузки.Получатель;
	Иначе
		СведенияОГрузополучателе  = СведенияОПокупателе;
		ПолучательПоДокументу = ДокВыгрузки.Контрагент;
	КонецЕсли;  
	
	СведенияОГрузоотправитель = СведенияОПоставщике;
	
	НовыйУникальныйИдентификатор = Новый УникальныйИдентификатор;
	ДатаДляИндифик = ТекущаяДата();
	Год   = Строка(Формат(ДатаДляИндифик, "ДФ=гггг")); // Год
	Месяц = Строка(Формат(ДатаДляИндифик, "ДФ=ММ"));   // Месяц
	День  = Строка(Формат(ДатаДляИндифик, "ДФ=дд"));   // День
	
	ДатаПреобразоваянная = Год + Месяц + День;
	//НомерТелефона
	
	//-------------------------------------------------------------------------------------------------------
	ЗаписьXML = Новый ЗаписьXML;
	ЗаписьXML.УстановитьСтроку();
	ЗаписьXML.ЗаписатьОбъявлениеXML();
	//Файл++
	ЗаписьXML.ЗаписатьНачалоЭлемента("Файл");
		ЗаписьXML.ЗаписатьСоответствиеПространстваИмен("xsd","http://www.w3.org/2001/XMLSchema");
		ЗаписьXML.ЗаписатьСоответствиеПространстваИмен("xsi","http://www.w3.org/2001/XMLSchema-instance");
		ЗаписьXML.ЗаписатьАтрибут("ИдФайл", "ON_NSCHFDOPPR_" + ИдПол + "_" + ИдОтпр + "_" + ДатаПреобразоваянная + "_" + НовыйУникальныйИдентификатор);	
		ЗаписьXML.ЗаписатьАтрибут("ВерсФорм", "5.03");
		ЗаписьXML.ЗаписатьАтрибут("ВерсПрог", "Диадок 1.0");
		
			
    //Документ++
	ЗаписьXML.ЗаписатьНачалоЭлемента("Документ");	
	ЗаписьXML.ЗаписатьАтрибут("КНД", "1115131"); 
	ЗаписьXML.ЗаписатьАтрибут("Функция", "СЧФ");
	ЗаписьXML.ЗаписатьАтрибут("ДатаИнфПр", Формат(ДатаУПД, "ДЛФ=Д"));
	ЗаписьXML.ЗаписатьАтрибут("ВремИнфПр", "00.00.00");
	ЗаписьXML.ЗаписатьАтрибут("НаимЭконСубСост", ДокВыгрузки.Организация.НаименованиеПолное+", ИНН/КПП "+ДокВыгрузки.Организация.ИНН+"/"+ДокВыгрузки.Организация.КПП);
		
	ЗаписьXML.ЗаписатьНачалоЭлемента("СвСчФакт"); //СвСчФакт
	ЗаписьXML.ЗаписатьАтрибут("НомерДок", ?(ЗначениеЗаполнено(ДокВыгрузки.НомерСчф),ДокВыгрузки.НомерСчф,ДокВыгрузки.Номер));
	Если ТипЗнч(ДокВыгрузки) = Тип("ДокументСсылка.ЗаказНаряд") Тогда 
		ЗаписьXML.ЗаписатьАтрибут("ДатаДок", Формат(ДатаУПД, "ДЛФ=Д"));
	Иначе
		ЗаписьXML.ЗаписатьАтрибут("ДатаДок", Формат(ДатаУПД, "ДЛФ=Д"));
	КонецЕсли;
		
	//Продавец
	
	//<СвПрод
	ЗаписьXML.ЗаписатьНачалоЭлемента("СвПрод");
	   ЗаписьXML.ЗаписатьАтрибут("ОКПО", ДокВыгрузки.Организация.ОКПО);
	   //<ИдСв>
		ЗаписьXML.ЗаписатьНачалоЭлемента("ИдСв");
			ЗаписьXML.ЗаписатьНачалоЭлемента("СвЮЛУч");  
			ЗаписьXML.ЗаписатьАтрибут("НаимОрг", ДокВыгрузки.Организация.НаименованиеПолное);
			ЗаписьXML.ЗаписатьАтрибут("ИННЮЛ", ДокВыгрузки.Организация.ИНН);
			ЗаписьXML.ЗаписатьАтрибут("КПП", ДокВыгрузки.Организация.КПП);
			ЗаписьXML.ЗаписатьКонецЭлемента();
			
		ЗаписьXML.ЗаписатьКонецЭлемента();
		 //</ИдСв> 
		 
	//<Адрес>	 
	ЗаписьXML.ЗаписатьНачалоЭлемента("Адрес"); 
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("АдрИнф");
	ЗаписьXML.ЗаписатьАтрибут("КодСтр","643"); 
	ЗаписьXML.ЗаписатьАтрибут("НаимСтран","Россия");
    ЗаписьXML.ЗаписатьАтрибут("АдрТекст", СокрЛП(СведенияОПоставщике.ЮридическийАдрес.ИсходныйАдрес));
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.ЗаписатьКонецЭлемента();
	//</Адрес>
		
	Если ЗначениеЗаполнено(СведенияОПоставщике.НомерСчета) Тогда 
		//<БанкРекв
		ЗаписьXML.ЗаписатьНачалоЭлемента("БанкРекв");
		ЗаписьXML.ЗаписатьАтрибут("НомерСчета", Строка(СведенияОПоставщике.НомерСчета)); 
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("СвБанк");
		ЗаписьXML.ЗаписатьАтрибут("НаимБанк", СведенияОПоставщике.Банк.Наименование);
		ЗаписьXML.ЗаписатьАтрибут("БИК", Строка(СведенияОПоставщике.БИК));
		ЗаписьXML.ЗаписатьАтрибут("КорСчет", Строка(СведенияОПоставщике.КоррСчет));
		ЗаписьXML.ЗаписатьКонецЭлемента();
		
		ЗаписьXML.ЗаписатьКонецЭлемента();
		//</БанкРекв>
	КонецЕсли; 	
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	//</СвПрод>
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("ДокПодтвОтгрНом");
	ЗаписьXML.ЗаписатьАтрибут("РеквНаимДок", "Акт");
	ЗаписьXML.ЗаписатьАтрибут("РеквНомерДок", СокрЛП(ДокВыгрузки.Номер));
	ЗаписьXML.ЗаписатьАтрибут("РеквДатаДок", Формат(ДатаУПД, "ДЛФ=Д"));
	ЗаписьXML.ЗаписатьКонецЭлемента();

	//<СвПокуп>
	ЗаписьXML.ЗаписатьНачалоЭлемента("СвПокуп");
	//<ИдСв>
	ЗаписьXML.ЗаписатьНачалоЭлемента("ИдСв");
	//<СвЮЛУч 
	ЗаписьXML.ЗаписатьНачалоЭлемента("СвЮЛУч");
	
	КПП = ДокВыгрузки.Контрагент.КПП;	//значение по умолчанию  
	ЗаписьXML.ЗаписатьАтрибут("НаимОрг", ДокВыгрузки.Контрагент.НаименованиеПолное);
	ЗаписьXML.ЗаписатьАтрибут("ИННЮЛ", ДокВыгрузки.Контрагент.ИНН); 
	ЗаписьXML.ЗаписатьАтрибут("КПП", КПП); 
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.ЗаписатьКонецЭлемента();
	//</ИдСв>
	ЗаписьXML.ЗаписатьНачалоЭлемента("Адрес");
	
		ЗаписьXML.ЗаписатьНачалоЭлемента("АдрИнф");
		ЗаписьXML.ЗаписатьАтрибут("КодСтр", "643");
		ЗаписьXML.ЗаписатьАтрибут("НаимСтран","Россия");
		ЗаписьXML.ЗаписатьАтрибут("АдрТекст", СокрЛП(СведенияОПокупателе.ЮридическийАдрес.ИсходныйАдрес));	
		ЗаписьXML.ЗаписатьКонецЭлемента();	
		
	ЗаписьXML.ЗаписатьКонецЭлемента();        
		Если ЗначениеЗаполнено(СведенияОПокупателе.НомерСчета) Тогда  
		//<БанкРекв
		ЗаписьXML.ЗаписатьНачалоЭлемента("БанкРекв");
		ЗаписьXML.ЗаписатьАтрибут("НомерСчета", Строка(СведенияОПокупателе.НомерСчета));
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("СвБанк");
		ЗаписьXML.ЗаписатьАтрибут("НаимБанк", СведенияОПокупателе.Банк.Наименование);
		ЗаписьXML.ЗаписатьАтрибут("КорСчет", Строка(СведенияОПокупателе.КоррСчет));
		ЗаписьXML.ЗаписатьАтрибут("БИК", Строка(СведенияОПокупателе.БИК));
		ЗаписьXML.ЗаписатьКонецЭлемента();
		
		ЗаписьXML.ЗаписатьКонецЭлемента();
		//</БанкРекв>
	КонецЕсли; 	
	ЗаписьXML.ЗаписатьКонецЭлемента();
	//</СвПокуп>
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("ДенИзм");
	ЗаписьXML.ЗаписатьАтрибут("КодОКВ", "643");
	ЗаписьXML.ЗаписатьАтрибут("НаимОКВ", "Российский рубль");
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	//Авансовый СЧФ
	XMLУПД2026 = Константы.XMLУПД2026.Получить();
	ТзАвСФ = ЗначенияСервера.ПолучитьАвансовыСчетФактуру(ДокВыгрузки);
	Если XMLУПД2026 и ТзАвСФ.Количество()>0 Тогда
	ЗаписьXML.ЗаписатьНачалоЭлемента("ДопСвФХЖ1");	
		Для Каждого Стр Из ТзАвСФ Цикл
			ЗаписьXML.ЗаписатьНачалоЭлемента("СопрДокФХЖ");
			ЗаписьXML.ЗаписатьАтрибут("РеквНаимДок", "АСЧФ");
			ЗаписьXML.ЗаписатьАтрибут("РеквНомерДок", Строка(Стр.НомерДокумента));
			ЗаписьXML.ЗаписатьАтрибут("РеквДатаДок", Формат(Стр.ДатаДокумента, "ДЛФ=Д"));
			ЗаписьXML.ЗаписатьКонецЭлемента();
		КонецЦикла;
		ЗаписьXML.ЗаписатьКонецЭлемента();
	КонецЕсли;
     	
	ЗаписьXML.ЗаписатьНачалоЭлемента("ИнфПолФХЖ1");  
	
		
	ЗаписьXML.ЗаписатьНачалоЭлемента("ТекстИнф");
	ЗаписьXML.ЗаписатьАтрибут("Идентиф","ИдентификаторДокументаОснования"); 
	Текст = Строка(ДокВыгрузки.УникальныйИдентификатор());
    ЗаписьXML.ЗаписатьАтрибут("Значен",Текст); 
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("ТекстИнф");
	Текст =  "Реализация";
	ЗаписьXML.ЗаписатьАтрибут("Идентиф","ВидСчетаФактуры"); 
	ЗаписьXML.ЗаписатьАтрибут("Значен",Текст);
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("ТекстИнф");
	Текст = "true";
	ЗаписьXML.ЗаписатьАтрибут("Идентиф","ТолькоУслуги"); 
	ЗаписьXML.ЗаписатьАтрибут("Значен",Текст); 

	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("ТекстИнф");
	Текст = "№ п/п № "+ ДокВыгрузки.Номер +" от " + Формат(ДатаУПД, "ДЛФ=Д")+"г.";
	ЗаписьXML.ЗаписатьАтрибут("Идентиф","ДокументОбОтгрузке");
	ЗаписьXML.ЗаписатьАтрибут("Значен",Текст); 
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.ЗаписатьКонецЭлемента(); 	
   	ЗаписьXML.ЗаписатьКонецЭлемента(); 
	//</СвСчФакт>  
	
	
	//Табличная часть
	ЗаписьXML.ЗаписатьНачалоЭлемента("ТаблСчФакт");
	НомерСтроки = 0;
	ИтогКолМест = 0;
	ИтогБрутто = 0;
	ИтогНетто = 0;
	ИтогСумБезНДС = 0;
	ИтогСумНДС = 0;
	ИтогСумУчНДС = 0;  
	
	Если ТипЗнч(ДокВыгрузки)=Тип("ДокументСсылка.ЗаказНаряд") Тогда
		ДанныеТоваров = Новый Массив; 
		
		УчетнаяДата = ?(ЗначениеЗаполнено(ДокВыгрузки.ДатаЗакрытия),ДокВыгрузки.ДатаЗакрытия,ДокВыгрузки.Дата);
		ДокДата = СокрЛП(Формат(УчетнаяДата,"ДЛФ=DD"));
		
		НаименованиеУслуги = "Оказание услуг по ремонту и обслуживанию автотранспортного средства " + СокрЛП(ПечатныеФормы.СформироватьМодельАвтомобиляДляПечатнойФормы(ДокВыгрузки.ДокументОснование.Автомобиль));
		НаименованиеУслуги = НаименованиеУслуги + ", по заказ-наряду № " + ВРег(СокрЛП(ДокВыгрузки.Номер)) + " от " + ДокДата;
		
		стрТовар = Новый Структура;
		стрТовар.Вставить("Номенклатура", НаименованиеУслуги);
		стрТовар.Вставить("Количество", 1); 
		стрТовар.Вставить("Сумма", ДокВыгрузки.СуммаДокумента);
		стрТовар.Вставить("СуммаНДС", ДокВыгрузки.СуммаНДС);
		стрТовар.Вставить("СтавкаНДС", ДокВыгрузки.СтавкаНДС);
		
		ДанныеТоваров.Добавить(стрТовар);
	Иначе
		ДанныеТоваров = ДокВыгрузки.Товары.Выгрузить();
	КонецЕсли;
	
	Для Каждого стрТовар из ДанныеТоваров цикл
		ХарактеристикаДляПоиска = "";
		НомерСтроки = НомерСтроки + 1; 
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("СведТов");
		ЗаписьXML.ЗаписатьАтрибут("НомСтр", Строка(НомерСтроки));
		СтавкаКоэффициент = ЗначенияСервера.ПреобразуемСтавкиНДС(СтрТовар.СтавкаНДС);
		
		Если ЗначениеЗаполнено(СтрТовар.Сумма) И ЗначениеЗаполнено(СтрТовар.СтавкаНДС) Тогда		
			СуммаБезНДС = СтрТовар.Сумма - СтрТовар.СуммаНДС;
			СуммаНДСдоОкругления = СтрТовар.Сумма - СуммаБезНДС;
			СуммаНДСизСуммы = Окр(СуммаНДСдоОкругления, 2);
		КонецЕсли;
		Если ЗначениеЗаполнено(СуммаБезНДС) И ЗначениеЗаполнено(СтрТовар.Количество) Тогда		
			Цена = СуммаБезНДС / СтрТовар.Количество;
		КонецЕсли;
		
		Если ТипЗнч(СтрТовар.Номенклатура)=Тип("СправочникСсылка.Номенклатура") Тогда
			ЗаписьXML.ЗаписатьАтрибут("НаимТов", СтрТовар.Номенклатура.Наименование); 
			 
		Иначе
			ЗаписьXML.ЗаписатьАтрибут("НаимТов", СокрЛП(СтрТовар.Номенклатура)); 
			  
		КонецЕсли;
		
		ЗаписьXML.ЗаписатьАтрибут("КолТов", Строка(СтрЗаменить(СтрТовар.Количество, Символы.НПП,"")));
		ЗаписьXML.ЗаписатьАтрибут("ЦенаТов",Строка(Формат(Цена,"ЧДЦ=2; ЧГ=0; ЧРД=.")));
		ЗаписьXML.ЗаписатьАтрибут("СтТовБезНДС", Строка(Формат(СуммаБезНДС,"ЧДЦ=2; ЧГ=0; ЧРД=.")));
		ЗаписьXML.ЗаписатьАтрибут("НалСт", СтавкаКоэффициент.Ставка); 
		ЗаписьXML.ЗаписатьАтрибут("СтТовУчНал", Строка(Формат(СтрТовар.Сумма,"ЧДЦ=2; ЧГ=0; ЧРД=.")));	    
		ЗаписьXML.ЗаписатьНачалоЭлемента("ДопСведТов");
		ЗаписьXML.ЗаписатьАтрибут("ПрТовРаб", "2"); 
        ЗаписьXML.ЗаписатьКонецЭлемента();

		ЗаписьXML.ЗаписатьНачалоЭлемента("Акциз");
		ЗаписьXML.ЗаписатьНачалоЭлемента("БезАкциз");
		ЗаписьXML.ЗаписатьТекст("без акциза");
		ЗаписьXML.ЗаписатьКонецЭлемента();
		ЗаписьXML.ЗаписатьКонецЭлемента();
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("СумНал"); 
		
		Если СуммаНДСизСуммы > 0 Тогда
			ЗаписьXML.ЗаписатьНачалоЭлемента("СумНал");
			ЗаписьXML.ЗаписатьТекст(Строка(Формат(СуммаНДСизСуммы,"ЧДЦ=2; ЧГ=0; ЧРД=.")));
		ИначеЕсли СуммаНДСизСуммы = 0 Тогда		
			ЗаписьXML.ЗаписатьНачалоЭлемента("БезНДС");
			ЗаписьXML.ЗаписатьТекст("без НДС");
		КонецЕсли;
		ЗаписьXML.ЗаписатьКонецЭлемента();
		ЗаписьXML.ЗаписатьКонецЭлемента();
		ЗаписьXML.ЗаписатьКонецЭлемента();
		
		ИтогКолМест = ИтогКолМест + СтрТовар.Количество; 
		ИтогНетто = ИтогНетто + СтрТовар.Количество;
		ИтогСумБезНДС = ИтогСумБезНДС + СуммаБезНДС;
		ИтогСумНДС = ИтогСумНДС + СтрТовар.СуммаНДС;	
		ИтогСумУчНДС = ИтогСумУчНДС + СтрТовар.Сумма;
	КонецЦикла;
	
	// Конец табличной части
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("ВсегоОпл");
	ЗаписьXML.ЗаписатьАтрибут("СтТовБезНДСВсего", Строка(Формат(ИтогСумБезНДС,"ЧДЦ=2; ЧГ=0; ЧРД=.")));
	ЗаписьXML.ЗаписатьАтрибут("СтТовУчНалВсего", Строка(Формат(ИтогСумУчНДС,"ЧДЦ=2; ЧГ=0; ЧРД=.")));
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("СумНалВсего");
	ЗаписьXML.ЗаписатьНачалоЭлемента("СумНал");
	ЗаписьXML.ЗаписатьТекст(Строка(Формат(ИтогСумНДС,"ЧДЦ=2; ЧГ=0; ЧРД=.")));
	ЗаписьXML.ЗаписатьКонецЭлемента();
	ЗаписьXML.ЗаписатьКонецЭлемента();

	ЗаписьXML.ЗаписатьКонецЭлемента();
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	//Подписант
	ЗаписьXML.ЗаписатьНачалоЭлемента("Подписант");
	ЗаписьXML.ЗаписатьАтрибут("ОблПолн", "5");
	ЗаписьXML.ЗаписатьАтрибут("Статус", "1");
	ЗаписьXML.ЗаписатьАтрибут("ОснПолн", "Должностные обязанности");
	ЗаписьXML.ЗаписатьНачалоЭлемента("ЮЛ");
	
	ПодписантОветственный = "";
	ЗаписьXML.ЗаписатьНачалоЭлемента("ФИО");
	ЗаписьXML.ЗаписатьАтрибут("Фамилия", "-");
	ЗаписьXML.ЗаписатьАтрибут("Имя", "-");
	
	ЗаписьXML.ЗаписатьКонецЭлемента();
	ЗаписьXML.ЗаписатьКонецЭлемента();
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.ЗаписатьКонецЭлемента();
	ЗаписьXML.ЗаписатьКонецЭлемента(); 
	
	Возврат ЗаписьXML.Закрыть();
КонецФункции

&НаСервере
Функция Реализация_СформироватьXML_СЧФ(ДокВыгрузки) Экспорт
	ИдОтпр = "2BK-0000000000-0000000";
	ИдПол = "2BK-0000000000-0000000000000";  
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПрослеживаемыеТовары.Номенклатура КАК Номенклатура,
	|	ПрослеживаемыеТовары.РНПТ КАК РНПТ,
	|	ПрослеживаемыеТовары.Количество КАК Количество,
	|	ПрослеживаемыеТовары.КоличествоПрослеживаемости КАК КоличествоПрослеживаемости,
	|	ПрослеживаемыеТовары.СтранаПроисхождения КАК СтранаПроисхождения
	|ИЗ
	|	РегистрНакопления.ПрослеживаемыеТовары КАК ПрослеживаемыеТовары
	|ГДЕ
	|	ПрослеживаемыеТовары.Регистратор = &Регистратор";
	
	Запрос.УстановитьПараметр("Регистратор", ДокВыгрузки);
	СведенияОПрослеживаемости = Запрос.Выполнить().Выгрузить();
	
	Если СведенияОПрослеживаемости.Количество() > 0 тогда 
		ВыводитьРНПТ = Ложь;
	Иначе
		ВыводитьРНПТ = Ложь;	
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
 |	ЗначенияСвойствКонтрагентов.Значение КАК Значение
 |ИЗ
 |	РегистрСведений.ЗначенияСвойствКонтрагентов КАК ЗначенияСвойствКонтрагентов
 |ГДЕ
 |	ЗначенияСвойствКонтрагентов.Контрагент = &Контрагент
 |	И ЗначенияСвойствКонтрагентов.Свойство = &Свойство";
 
   Запрос.УстановитьПараметр("Контрагент", ДокВыгрузки.Контрагент); 
   Запрос.УстановитьПараметр("Свойство", Справочники.ЗначенияСвойствОбъектов.ГрузотправительПрочерк); 
   СвойствоПрочерк = Запрос.Выполнить().Выгрузить();
	
	Если СвойствоПрочерк.Количество() > 0 тогда 
		ВыводитьПрочерк = Истина;
	Иначе
		ВыводитьПрочерк = Ложь;	
	КонецЕсли;

 
 
 
	
	Если (ДокВыгрузки.Контрагент.ТипКонтрагента=Перечисления.ТипКонтрагента.Ип) ИЛИ (ДокВыгрузки.Контрагент.ТипКонтрагента=Перечисления.ТипКонтрагента.Фл ) Тогда
		КонтрИП = Истина;
	КонецЕсли;
	
	Если ТипЗнч(ДокВыгрузки) = Тип("ДокументСсылка.ЗаказНаряд") Тогда 
		ДатаУПД = ДокВыгрузки.ДатаЗакрытия;
	Иначе
		ДатаУПД = ДокВыгрузки.Дата;
	КонецЕсли;
	
	
	
	ОргИП = Ложь;
	БанковскийСчетКонтрагента = ДокВыгрузки.Контрагент.РасчСчет;
	БанковскийСчетФирмы = ДокВыгрузки.Организация.РасчСчет;
	СведенияОПоставщике = ЗначенияСервера.СведенияОЮрФизЛице(ДокВыгрузки.Организация, ДатаУПД);
	СведенияОПокупателе = ЗначенияСервера.СведенияОЮРФизЛице(ДокВыгрузки.Контрагент, ДатаУПД);
	
	Если ДокВыгрузки.Метаданные().Реквизиты.Найти("Получатель")<>Неопределено И ЗначениеЗаполнено(ДокВыгрузки.Получатель) и ТипЗнч(ДокВыгрузки.Получатель) = Тип("СправочникСсылка.Контрагенты") тогда
		СведенияОГрузополучателе  = ЗначенияСервера.СведенияОЮрФизЛице(ДокВыгрузки.Получатель,  ДатаУПД);
		ПолучательПоДокументу = ДокВыгрузки.Получатель;
	Иначе
		СведенияОГрузополучателе  = СведенияОПокупателе;
		ПолучательПоДокументу = ДокВыгрузки.Контрагент;
	КонецЕсли;  
	
	СведенияОГрузоотправитель = СведенияОПоставщике;
	
	НовыйУникальныйИдентификатор = Новый УникальныйИдентификатор;
	ДатаДляИндифик = ТекущаяДата();
	Год   = Строка(Формат(ДатаДляИндифик, "ДФ=гггг")); // Год
	Месяц = Строка(Формат(ДатаДляИндифик, "ДФ=ММ"));   // Месяц
	День  = Строка(Формат(ДатаДляИндифик, "ДФ=дд"));   // День
	
	ДатаПреобразоваянная = Год + Месяц + День;
	//НомерТелефона
	
	//-------------------------------------------------------------------------------------------------------
	ЗаписьXML = Новый ЗаписьXML;
	ЗаписьXML.УстановитьСтроку();
	ЗаписьXML.ЗаписатьОбъявлениеXML();
	//Файл++
	ЗаписьXML.ЗаписатьНачалоЭлемента("Файл");
		ЗаписьXML.ЗаписатьСоответствиеПространстваИмен("xsd","http://www.w3.org/2001/XMLSchema");
		ЗаписьXML.ЗаписатьСоответствиеПространстваИмен("xsi","http://www.w3.org/2001/XMLSchema-instance");
		ЗаписьXML.ЗаписатьАтрибут("ИдФайл", "ON_NSCHFDOPPR_" + ИдПол + "_" + ИдОтпр + "_" + ДатаПреобразоваянная + "_" + НовыйУникальныйИдентификатор);	
		ЗаписьXML.ЗаписатьАтрибут("ВерсФорм", "5.01");
		ЗаписьXML.ЗаписатьАтрибут("ВерсПрог", "1.0");
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("СвУчДокОбор");   //СвУчДокОбор
		ЗаписьXML.ЗаписатьАтрибут("ИдОтпр", ИдОтпр);
		ЗаписьXML.ЗаписатьАтрибут("ИдПол", ИдПол);
	    ЗаписьXML.ЗаписатьКонецЭлемента(); 
	
    //Документ++
	ЗаписьXML.ЗаписатьНачалоЭлемента("Документ");	
	ЗаписьXML.ЗаписатьАтрибут("КНД", "1115131"); 
	ЗаписьXML.ЗаписатьАтрибут("Функция", "СЧФ");
	ЗаписьXML.ЗаписатьАтрибут("ДатаИнфПр", Формат(ДатаУПД, "ДЛФ=Д"));
	ЗаписьXML.ЗаписатьАтрибут("ВремИнфПр", "00.00.00");
	ЗаписьXML.ЗаписатьАтрибут("НаимЭконСубСост", ДокВыгрузки.Организация.НаименованиеПолное+", ИНН/КПП "+ДокВыгрузки.Организация.ИНН+"/"+ДокВыгрузки.Организация.КПП);
		
	ЗаписьXML.ЗаписатьНачалоЭлемента("СвСчФакт"); //СвСчФакт
	ЗаписьXML.ЗаписатьАтрибут("НомерСчФ", ?(ЗначениеЗаполнено(ДокВыгрузки.НомерСчф),ДокВыгрузки.НомерСчф,ДокВыгрузки.Номер));
	Если ТипЗнч(ДокВыгрузки) = Тип("ДокументСсылка.ЗаказНаряд") Тогда 
		ЗаписьXML.ЗаписатьАтрибут("ДатаСчФ", Формат(ДатаУПД, "ДЛФ=Д"));
	Иначе
		ЗаписьXML.ЗаписатьАтрибут("ДатаСчФ", Формат(ДатаУПД, "ДЛФ=Д"));
	КонецЕсли;
	ЗаписьXML.ЗаписатьАтрибут("КодОКВ", "643");
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("ИспрСчФ"); //СвСчФакт
	ЗаписьXML.ЗаписатьАтрибут("ДефНомИспрСчФ","-");
	ЗаписьXML.ЗаписатьАтрибут("ДефДатаИспрСчФ","-");
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	//Продавец
	
	//<СвПрод
	ЗаписьXML.ЗаписатьНачалоЭлемента("СвПрод");
	   ЗаписьXML.ЗаписатьАтрибут("ОКПО", ДокВыгрузки.Организация.ОКПО);
	   //<ИдСв>
		ЗаписьXML.ЗаписатьНачалоЭлемента("ИдСв");
			ЗаписьXML.ЗаписатьНачалоЭлемента("СвЮЛУч");  
			ЗаписьXML.ЗаписатьАтрибут("НаимОрг", ДокВыгрузки.Организация.НаименованиеПолное);
			ЗаписьXML.ЗаписатьАтрибут("ИННЮЛ", ДокВыгрузки.Организация.ИНН);
			ЗаписьXML.ЗаписатьАтрибут("КПП", ДокВыгрузки.Организация.КПП);
			ЗаписьXML.ЗаписатьКонецЭлемента();
			
		ЗаписьXML.ЗаписатьКонецЭлемента();
		 //</ИдСв> 
		 
	//<Адрес>	 
	ЗаписьXML.ЗаписатьНачалоЭлемента("Адрес"); 
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("АдрИнф");
	ЗаписьXML.ЗаписатьАтрибут("КодСтр","643");
    ЗаписьXML.ЗаписатьАтрибут("АдрТекст", СокрЛП(СведенияОПоставщике.ЮридическийАдрес.ИсходныйАдрес));
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.ЗаписатьКонецЭлемента();
	//</Адрес>
	ЗаписьXML.ЗаписатьНачалоЭлемента("Контакт");  
	Телефон = Справочники.Контрагенты.НайтиПоРеквизиту("ИНН",СведенияОПоставщике.ИНН).НомерТелефона;
	ЗаписьXML.ЗаписатьАтрибут("Тлф", СокрЛП(Телефон));
    ЗаписьXML.ЗаписатьКонецЭлемента();
	
	Если ЗначениеЗаполнено(СведенияОПоставщике.НомерСчета) Тогда 
		//<БанкРекв
		ЗаписьXML.ЗаписатьНачалоЭлемента("БанкРекв");
		ЗаписьXML.ЗаписатьАтрибут("НомерСчета", Строка(СведенияОПоставщике.НомерСчета)); 
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("СвБанк");
		ЗаписьXML.ЗаписатьАтрибут("НаимБанк", СведенияОПоставщике.Банк.Наименование);
		ЗаписьXML.ЗаписатьАтрибут("БИК", Строка(СведенияОПоставщике.БИК));
		ЗаписьXML.ЗаписатьАтрибут("КорСчет", Строка(СведенияОПоставщике.КоррСчет));
		ЗаписьXML.ЗаписатьКонецЭлемента();
		
		ЗаписьXML.ЗаписатьКонецЭлемента();
		//</БанкРекв>
	КонецЕсли; 	
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	//</СвПрод>
	
	//<СвПокуп>
	ЗаписьXML.ЗаписатьНачалоЭлемента("СвПокуп");
	//<ИдСв>
	ЗаписьXML.ЗаписатьНачалоЭлемента("ИдСв");
	//<СвЮЛУч 
	ЗаписьXML.ЗаписатьНачалоЭлемента("СвЮЛУч");
	
	КПП = ДокВыгрузки.Контрагент.КПП;	//значение по умолчанию  
	ЗаписьXML.ЗаписатьАтрибут("НаимОрг", ДокВыгрузки.Контрагент.НаименованиеПолное);
	ЗаписьXML.ЗаписатьАтрибут("ИННЮЛ", ДокВыгрузки.Контрагент.ИНН); 
	ЗаписьXML.ЗаписатьАтрибут("КПП", КПП); 
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.ЗаписатьКонецЭлемента();
	//</ИдСв>
	ЗаписьXML.ЗаписатьНачалоЭлемента("Адрес");
	
		ЗаписьXML.ЗаписатьНачалоЭлемента("АдрИнф");
		ЗаписьXML.ЗаписатьАтрибут("КодСтр", "643");	
		ЗаписьXML.ЗаписатьАтрибут("АдрТекст", СокрЛП(СведенияОПокупателе.ЮридическийАдрес.ИсходныйАдрес));	
		ЗаписьXML.ЗаписатьКонецЭлемента();	
		
	ЗаписьXML.ЗаписатьКонецЭлемента();        
	//</Адрес> 
	ЗаписьXML.ЗаписатьНачалоЭлемента("Контакт"); 
	Телефон = Справочники.Контрагенты.НайтиПоРеквизиту("ИНН",СведенияОПокупателе.ИНН).НомерТелефона;
	ЗаписьXML.ЗаписатьАтрибут("Тлф", СокрЛП(Телефон));
	ЗаписьXML.ЗаписатьКонецЭлемента();
	Если ЗначениеЗаполнено(СведенияОПокупателе.НомерСчета) Тогда  
		//<БанкРекв
		ЗаписьXML.ЗаписатьНачалоЭлемента("БанкРекв");
		ЗаписьXML.ЗаписатьАтрибут("НомерСчета", Строка(СведенияОПокупателе.НомерСчета));
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("СвБанк");
		ЗаписьXML.ЗаписатьАтрибут("НаимБанк", СведенияОПокупателе.Банк.Наименование);
		ЗаписьXML.ЗаписатьАтрибут("КорСчет", Строка(СведенияОПокупателе.КоррСчет));
		ЗаписьXML.ЗаписатьАтрибут("БИК", Строка(СведенияОПокупателе.БИК));
		ЗаписьXML.ЗаписатьКонецЭлемента();
		
		ЗаписьXML.ЗаписатьКонецЭлемента();
		//</БанкРекв>
	КонецЕсли; 	
	ЗаписьXML.ЗаписатьКонецЭлемента();
	//</СвПокуп>
		
	//<ДопСвФХЖ1
	ЗаписьXML.ЗаписатьНачалоЭлемента("ДопСвФХЖ1");
	ЗаписьXML.ЗаписатьАтрибут("НаимОКВ", Строка("Российский рубль"));
	ЗаписьXML.ЗаписатьАтрибут("КурсВал", Строка("1"));
	ЗаписьXML.ЗаписатьАтрибут("ОбстФормСЧФ", Строка("1"));
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	//<Документ об отгрузке>
	ЗаписьXML.ЗаписатьНачалоЭлемента("ДокПодтвОтгр");  
	ЗаписьXML.ЗаписатьАтрибут("НаимДокОтгр",	"Акт");
	ЗаписьXML.ЗаписатьАтрибут("НомДокОтгр",		ДокВыгрузки.Номер);
	ЗаписьXML.ЗаписатьАтрибут("ДатаДокОтгр",	Формат(ДатаУПД, "ДЛФ=Д"));
	ЗаписьXML.ЗаписатьКонецЭлемента(); 
	
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("ИнфПолФХЖ1");  
	
		
	ЗаписьXML.ЗаписатьНачалоЭлемента("ТекстИнф");
	ЗаписьXML.ЗаписатьАтрибут("Идентиф","ИдентификаторДокументаОснования"); 
	Текст = Строка(ДокВыгрузки.УникальныйИдентификатор());
    ЗаписьXML.ЗаписатьАтрибут("Значен",Текст); 
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("ТекстИнф");
	Текст =  "Реализация";
	ЗаписьXML.ЗаписатьАтрибут("Идентиф","ВидСчетаФактуры"); 
	ЗаписьXML.ЗаписатьАтрибут("Значен",Текст);
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("ТекстИнф");
	Текст = "true";
	ЗаписьXML.ЗаписатьАтрибут("Идентиф","ТолькоУслуги"); 
	ЗаписьXML.ЗаписатьАтрибут("Значен",Текст); 

	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("ТекстИнф");
	Текст = "№ п/п № "+ ДокВыгрузки.Номер +" от " + Формат(ДатаУПД, "ДЛФ=Д")+"г.";
	ЗаписьXML.ЗаписатьАтрибут("Идентиф","ДокументОбОтгрузке");
	ЗаписьXML.ЗаписатьАтрибут("Значен",Текст); 
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.ЗаписатьКонецЭлемента(); 		
			
			
		
	ЗаписьXML.ЗаписатьКонецЭлемента(); 
	//</СвСчФакт>  
	
	
	//Табличная часть
	ЗаписьXML.ЗаписатьНачалоЭлемента("ТаблСчФакт");
	НомерСтроки = 0;
	ИтогКолМест = 0;
	ИтогБрутто = 0;
	ИтогНетто = 0;
	ИтогСумБезНДС = 0;
	ИтогСумНДС = 0;
	ИтогСумУчНДС = 0;  
	
	Если ТипЗнч(ДокВыгрузки)=Тип("ДокументСсылка.ЗаказНаряд") Тогда
		ДанныеТоваров = Новый Массив; 
		
		УчетнаяДата = ?(ЗначениеЗаполнено(ДокВыгрузки.ДатаЗакрытия),ДокВыгрузки.ДатаЗакрытия,ДокВыгрузки.Дата);
		ДокДата = СокрЛП(Формат(УчетнаяДата,"ДЛФ=DD"));
		
		НаименованиеУслуги = "Оказание услуг по ремонту и обслуживанию автотранспортного средства " + СокрЛП(ПечатныеФормы.СформироватьМодельАвтомобиляДляПечатнойФормы(ДокВыгрузки.ДокументОснование.Автомобиль));
		НаименованиеУслуги = НаименованиеУслуги + ", по заказ-наряду № " + ВРег(СокрЛП(ДокВыгрузки.Номер)) + " от " + ДокДата;
		
		стрТовар = Новый Структура;
		стрТовар.Вставить("Номенклатура", НаименованиеУслуги);
		стрТовар.Вставить("Количество", 1); 
		стрТовар.Вставить("Сумма", ДокВыгрузки.СуммаДокумента);
		стрТовар.Вставить("СуммаНДС", ДокВыгрузки.СуммаНДС);
		стрТовар.Вставить("СтавкаНДС", ДокВыгрузки.СтавкаНДС);
		
		ДанныеТоваров.Добавить(стрТовар);
	Иначе
		ДанныеТоваров = ДокВыгрузки.Товары.Выгрузить();
	КонецЕсли;
	
	Для Каждого стрТовар из ДанныеТоваров цикл
		//РНПТ
		СтранаПроисхождения = "";
		СтранаКод = "";
		//Если ВыводитьРНПТ тогда
		//	СведенияОРНПТ = СведенияОПрослеживаемости.НайтиСтроки(Новый Структура("Номенклатура", СтрТовар.Номенклатура));
		//	Если СведенияОРНПТ.Количество() >0 тогда   
		//		СтранаПроисхождения = СокрЛП(СтрТовар.Номенклатура.Страна);
		//		Если Справочники.Страны.НайтиПоНаименованию(СтранаПроисхождения)<> Справочники.Страны.ПустаяСсылка() тогда
		//			СтранаКод = Справочники.Страны.НайтиПоНаименованию(СтранаПроисхождения).КодОКСМ;
		//		Иначе
		//			СтранаКод = "";
		//		КонецЕсли;
		//	КонецЕсли;
		//КонецЕсли;	
		//РНПТ		
		ХарактеристикаДляПоиска = "";
		НомерСтроки = НомерСтроки + 1; 
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("СведТов");
		ЗаписьXML.ЗаписатьАтрибут("НомСтр", Строка(НомерСтроки));
		СтавкаКоэффициент = ЗначенияСервера.ПреобразуемСтавкиНДС(СтрТовар.СтавкаНДС);
		
		Если ЗначениеЗаполнено(СтрТовар.Сумма) И ЗначениеЗаполнено(СтрТовар.СтавкаНДС) Тогда		
			СуммаБезНДС = СтрТовар.Сумма - СтрТовар.СуммаНДС;
			СуммаНДСдоОкругления = СтрТовар.Сумма - СуммаБезНДС;
			СуммаНДСизСуммы = Окр(СуммаНДСдоОкругления, 2);
		КонецЕсли;
		Если ЗначениеЗаполнено(СуммаБезНДС) И ЗначениеЗаполнено(СтрТовар.Количество) Тогда		
			Цена = СуммаБезНДС / СтрТовар.Количество;
		КонецЕсли;
		
		Если ТипЗнч(СтрТовар.Номенклатура)=Тип("СправочникСсылка.Номенклатура") Тогда
			ЗаписьXML.ЗаписатьАтрибут("НаимТов", СтрТовар.Номенклатура.Наименование); 
			ЗаписьXML.ЗаписатьАтрибут("ДефОКЕИ_Тов", СокрЛП(СтрТовар.Номенклатура.ЕдиницаИзмерения.Код));  
		Иначе
			ЗаписьXML.ЗаписатьАтрибут("НаимТов", СокрЛП(СтрТовар.Номенклатура)); 
			ЗаписьXML.ЗаписатьАтрибут("ДефОКЕИ_Тов", "-");  
		КонецЕсли;
		
		ЗаписьXML.ЗаписатьАтрибут("КолТов", Строка(СтрЗаменить(СтрТовар.Количество, Символы.НПП,"")));
		//ЗаписьXML.ЗаписатьАтрибут("ЦенаТов",Строка(Формат(Цена,"ЧДЦ=2; ЧГ=0; ЧРД=.")));
		ЗаписьXML.ЗаписатьАтрибут("СтТовБезНДС", Строка(Формат(СуммаБезНДС,"ЧДЦ=2; ЧГ=0; ЧРД=.")));
		ЗаписьXML.ЗаписатьАтрибут("НалСт", СтавкаКоэффициент.Ставка); 
		ЗаписьXML.ЗаписатьАтрибут("СтТовУчНал", Строка(Формат(СтрТовар.Сумма,"ЧДЦ=2; ЧГ=0; ЧРД=.")));	    
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("Акциз");
		ЗаписьXML.ЗаписатьНачалоЭлемента("БезАкциз");
		ЗаписьXML.ЗаписатьТекст("без акциза");
		ЗаписьXML.ЗаписатьКонецЭлемента();
		ЗаписьXML.ЗаписатьКонецЭлемента();
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("СумНал"); 
		
		Если СуммаНДСизСуммы > 0 Тогда
			ЗаписьXML.ЗаписатьНачалоЭлемента("СумНал");
			ЗаписьXML.ЗаписатьТекст(Строка(Формат(СуммаНДСизСуммы,"ЧДЦ=2; ЧГ=0; ЧРД=.")));
		ИначеЕсли СуммаНДСизСуммы = 0 Тогда		
			ЗаписьXML.ЗаписатьНачалоЭлемента("БезНДС");
			ЗаписьXML.ЗаписатьТекст("без НДС");
		КонецЕсли;
		ЗаписьXML.ЗаписатьКонецЭлемента();
		ЗаписьXML.ЗаписатьКонецЭлемента();
			
		ЗаписьXML.ЗаписатьНачалоЭлемента("ДопСведТов");
		
		ЗаписьXML.ЗаписатьАтрибут("ПрТовРаб", "3");
		ЗаписьXML.ЗаписатьКонецЭлемента(); 
		ЗаписьXML.ЗаписатьКонецЭлемента();
		
		ИтогКолМест = ИтогКолМест + СтрТовар.Количество; 
		ИтогНетто = ИтогНетто + СтрТовар.Количество;
		ИтогСумБезНДС = ИтогСумБезНДС + СуммаБезНДС;
		ИтогСумНДС = ИтогСумНДС + СтрТовар.СуммаНДС;	
		ИтогСумУчНДС = ИтогСумУчНДС + СтрТовар.Сумма;
	КонецЦикла;
	
	// Конец табличной части
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("ВсегоОпл");
	ЗаписьXML.ЗаписатьАтрибут("СтТовБезНДСВсего", Строка(Формат(ИтогСумБезНДС,"ЧДЦ=2; ЧГ=0; ЧРД=.")));
	ЗаписьXML.ЗаписатьАтрибут("СтТовУчНалВсего", Строка(Формат(ИтогСумУчНДС,"ЧДЦ=2; ЧГ=0; ЧРД=.")));
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("СумНалВсего");
	ЗаписьXML.ЗаписатьНачалоЭлемента("СумНал");
	ЗаписьXML.ЗаписатьТекст(Строка(Формат(ИтогСумНДС,"ЧДЦ=2; ЧГ=0; ЧРД=.")));
	ЗаписьXML.ЗаписатьКонецЭлемента();
	ЗаписьXML.ЗаписатьКонецЭлемента();

	ЗаписьXML.ЗаписатьКонецЭлемента();
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	//Подписант
	ЗаписьXML.ЗаписатьНачалоЭлемента("Подписант");
	ЗаписьXML.ЗаписатьАтрибут("ОблПолн", "5");
	ЗаписьXML.ЗаписатьАтрибут("Статус", "1");
	ЗаписьXML.ЗаписатьАтрибут("ОснПолн", "Должностные обязанности");
	ЗаписьXML.ЗаписатьНачалоЭлемента("ЮЛ");
	
	ПодписантОветственный = "";
	ЗаписьXML.ЗаписатьНачалоЭлемента("ФИО");
	ЗаписьXML.ЗаписатьАтрибут("Фамилия", "-");
	ЗаписьXML.ЗаписатьАтрибут("Имя", "-");
	
	//ЗаписьXML.ЗаписатьАтрибут("Отчество", "-");
	
	ЗаписьXML.ЗаписатьКонецЭлемента();
	ЗаписьXML.ЗаписатьКонецЭлемента();
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.ЗаписатьКонецЭлемента();
	ЗаписьXML.ЗаписатьКонецЭлемента(); 
	
	Возврат ЗаписьXML.Закрыть();
КонецФункции

&НаСервере
Функция ВозвратПокупателя_СформироватьУКД_XML501(ДокВыгрузки) Экспорт
	//Формирует УКД в XML формата 5.01
	
	ИдОтпр = "2BK-0000000000-0000000";
	ИдПол = "2BK-0000000000-0000000000000";  
	
	Если (ДокВыгрузки.Контрагент.ТипКонтрагента=Перечисления.ТипКонтрагента.Ип) ИЛИ (ДокВыгрузки.Контрагент.ТипКонтрагента=Перечисления.ТипКонтрагента.Фл ) Тогда
		КонтрИП = Истина;
	КонецЕсли;
	
	ОрганизацияДляПечати = ПечатныеФормы.ПолучитьОрганизациюДляПечати(ДокВыгрузки);
	
	ДатаУКД = ДокВыгрузки.Дата;
	
	ОргИП = Ложь;
	БанковскийСчетКонтрагента = ДокВыгрузки.Контрагент.РасчСчет;
	БанковскийСчетФирмы = ДокВыгрузки.Организация.РасчСчет;
	СведенияОПоставщике = ЗначенияСервера.СведенияОЮрФизЛице(ДокВыгрузки.Организация, ДатаУКД);
	СведенияОПокупателе = ЗначенияСервера.СведенияОЮРФизЛице(ДокВыгрузки.Контрагент, ДатаУКД);
	
	СведенияОГрузополучателе  = СведенияОПокупателе;
	ПолучательПоДокументу = ДокВыгрузки.Контрагент;
	СведенияОГрузоотправитель = СведенияОПоставщике;
	
	НовыйУникальныйИдентификатор = Новый УникальныйИдентификатор;
	ДатаДляИндифик = ТекущаяДата();
	Год   = Строка(Формат(ДатаДляИндифик, "ДФ=гггг")); // Год
	Месяц = Строка(Формат(ДатаДляИндифик, "ДФ=ММ"));   // Месяц
	День  = Строка(Формат(ДатаДляИндифик, "ДФ=дд"));   // День
	
	ДатаПреобразоваянная = Год + Месяц + День;
	
	ЗаписьXML = Новый ЗаписьXML;
	
	ЗаписьXML.УстановитьСтроку();
	ЗаписьXML.ЗаписатьОбъявлениеXML();
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("Файл");
	ЗаписьXML.ЗаписатьСоответствиеПространстваИмен("xsd","http://www.w3.org/2001/XMLSchema");
	ЗаписьXML.ЗаписатьСоответствиеПространстваИмен("xsi","http://www.w3.org/2001/XMLSchema-instance");
	
	ЗаписьXML.ЗаписатьАтрибут("ИдФайл", "ON_NKORSCHFDOPPR_" + ИдПол + "_" + ИдОтпр + "_" + ДатаПреобразоваянная + "_" + НовыйУникальныйИдентификатор);	
	ЗаписьXML.ЗаписатьАтрибут("ВерсФорм", "5.01");
	ЗаписьXML.ЗаписатьАтрибут("ВерсПрог", "1.0");
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("СвУчДокОбор");
	ЗаписьXML.ЗаписатьАтрибут("ИдОтпр", ИдОтпр);
	ЗаписьXML.ЗаписатьАтрибут("ИдПол", ИдПол);	
	ЗаписьXML.ЗаписатьНачалоЭлемента("СвОЭДОтпр");
	ЗаписьXML.ЗаписатьАтрибут("ИННЮЛ", "7728168971");	
	ЗаписьXML.ЗаписатьАтрибут("ИдЭДО", "2BM");
	ЗаписьXML.ЗаписатьАтрибут("НаимОрг", "АО ""ПФ ""СКБ Контур""");
	
	ЗаписьXML.ЗаписатьКонецЭлемента();
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("Документ");	
	ЗаписьXML.ЗаписатьАтрибут("КНД", "1115133"); 	
	ЗаписьXML.ЗаписатьАтрибут("ПоФактХЖ", "Документ, подтверждающий согласие (факт уведомления) покупателя на изменение стоимости отгруженных товаров (выполненных работ, оказанных услуг), переданных имущественных прав");
	ЗаписьXML.ЗаписатьАтрибут("НаимДокОпр", "Корректировочный счет-фактура и документ об изменении стоимости отгруженных товаров (выполненных работ, оказанных услуг), переданных имущественных прав");
	ЗаписьXML.ЗаписатьАтрибут("ДатаИнфПр", Формат(ДатаУКД, "ДЛФ=Д"));
	ЗаписьXML.ЗаписатьАтрибут("ВремИнфПр", "00.00.00");
	ЗаписьXML.ЗаписатьАтрибут("НаимЭконСубСост", ДокВыгрузки.Организация.НаименованиеПолное);
	ЗаписьXML.ЗаписатьАтрибут("Функция", "КСЧФДИС");
	
	УчетныйНомер = ?(ЗначениеЗаполнено(ДокВыгрузки.НомерКоррСчф),ДокВыгрузки.НомерКоррСчф,ДокВыгрузки.Номер);
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("СвКСчФ");
	ЗаписьXML.ЗаписатьАтрибут("НомерКСчФ", УчетныйНомер);
	ЗаписьXML.ЗаписатьАтрибут("ДатаКСчФ", Формат(ДокВыгрузки.Дата, "ДЛФ=Д"));
	ЗаписьXML.ЗаписатьАтрибут("КодОКВ", "643");
	
	
	ИсходныйДокНомер = ?(ЗначениеЗаполнено(ДокВыгрузки.ДокументОснование.НомерСчф),ДокВыгрузки.ДокументОснование.НомерСчф,ДокВыгрузки.ДокументОснование.Номер);
	ИсходныйДокДата =ДокВыгрузки.ДокументОснование.Дата;
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("СчФ");
	ЗаписьXML.ЗаписатьАтрибут("НомерСчФ", ИсходныйДокНомер);
	ЗаписьXML.ЗаписатьАтрибут("ДатаСчФ", Формат(ИсходныйДокДата, "ДЛФ=Д"));
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	//Продавец
	ЗаписьXML.ЗаписатьНачалоЭлемента("СвПрод");
	ЗаписьXML.ЗаписатьНачалоЭлемента("ИдСв");
	ЗаписьXML.ЗаписатьНачалоЭлемента("СвЮЛУч");  
	ЗаписьXML.ЗаписатьАтрибут("КПП", ДокВыгрузки.Организация.КПП);
	ЗаписьXML.ЗаписатьАтрибут("НаимОрг", ДокВыгрузки.Организация.НаименованиеПолное);
	ЗаписьXML.ЗаписатьАтрибут("ИННЮЛ", ДокВыгрузки.Организация.ИНН);
	ЗаписьXML.ЗаписатьКонецЭлемента();
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("Адрес");
	ЗаписьXML.ЗаписатьНачалоЭлемента("АдрРФ");
	
	Если ЗначениеЗаполнено(СведенияОПоставщике.ЮридическийАдрес.postal_code) Тогда
		ЗаписьXML.ЗаписатьАтрибут("Индекс", СокрЛП(СведенияОПоставщике.ЮридическийАдрес.postal_code));
	КонецЕсли;
	Если ДокВыгрузки.Организация.Страна.ЭтоСтрана=Ложь тогда
		Если Лев(СокрЛП(ДокВыгрузки.Организация.Страна.Код),1)= "0" тогда
			ЗаписьXML.ЗаписатьАтрибут("КодРегион",Сред(СокрЛП(ДокВыгрузки.Организация.Страна.Код),2));	
		Иначе	
			ЗаписьXML.ЗаписатьАтрибут("КодРегион",СокрЛП(ДокВыгрузки.Организация.Страна.Код));
		КонецЕсли;	
	Иначе 	
		ЗаписьXML.ЗаписатьАтрибут("КодРегион",СокрЛП(ДокВыгрузки.Организация.Страна.КодОКСМ));	
	КонецЕсли;
	Если ЗначениеЗаполнено(СведенияОПоставщике.ЮридическийАдрес.city_district_with_type) Тогда
		ЗаписьXML.ЗаписатьАтрибут("Район",СокрЛП(СведенияОПоставщике.ЮридическийАдрес.city_district_with_type));
	КонецЕсли;
	Если ЗначениеЗаполнено(СведенияОПоставщике.ЮридическийАдрес.city_with_type) Тогда
		ЗаписьXML.ЗаписатьАтрибут("Город", СокрЛП(СведенияОПоставщике.ЮридическийАдрес.city_with_type));
	КонецЕсли;
	Если ЗначениеЗаполнено(СведенияОПоставщике.ЮридическийАдрес.settlement_with_type) Тогда
		ЗаписьXML.ЗаписатьАтрибут("НаселПункт", СокрЛП(СведенияОПоставщике.ЮридическийАдрес.settlement_with_type));
	КонецЕсли;
	Если ЗначениеЗаполнено(СведенияОПоставщике.ЮридическийАдрес.street_with_type) Тогда
		ЗаписьXML.ЗаписатьАтрибут("Улица", СокрЛП(СведенияОПоставщике.ЮридическийАдрес.street_with_type));
	КонецЕсли;
	Если ЗначениеЗаполнено(СведенияОПоставщике.ЮридическийАдрес.house) Тогда
		ЗаписьXML.ЗаписатьАтрибут("Дом", СокрЛП(СведенияОПоставщике.ЮридическийАдрес.house));
	КонецЕсли;
	Если ЗначениеЗаполнено(СведенияОПоставщике.ЮридическийАдрес.flat) Тогда
		ЗаписьXML.ЗаписатьАтрибут("Кварт", СокрЛП(СведенияОПоставщике.ЮридическийАдрес.flat));
	КонецЕсли;
	
	ЗаписьXML.ЗаписатьКонецЭлемента();
	ЗаписьXML.ЗаписатьКонецЭлемента();
	Если ЗначениеЗаполнено(СведенияОПоставщике.НомерСчета) Тогда 
		ЗаписьXML.ЗаписатьНачалоЭлемента("БанкРекв");
		ЗаписьXML.ЗаписатьАтрибут("НомерСчета", Строка(СведенияОПоставщике.НомерСчета));
		ЗаписьXML.ЗаписатьНачалоЭлемента("СвБанк");
		ЗаписьXML.ЗаписатьАтрибут("НаимБанк", СведенияОПоставщике.Банк.Наименование);
		ЗаписьXML.ЗаписатьАтрибут("КорСчет", Строка(СведенияОПоставщике.КоррСчет));
		ЗаписьXML.ЗаписатьАтрибут("БИК", Строка(СведенияОПоставщике.БИК));
		ЗаписьXML.ЗаписатьКонецЭлемента();
		ЗаписьXML.ЗаписатьКонецЭлемента();
	КонецЕсли; 	
	ЗаписьXML.ЗаписатьКонецЭлемента();
		
	//СвПокуп
	ЗаписьXML.ЗаписатьНачалоЭлемента("СвПокуп");
	ЗаписьXML.ЗаписатьНачалоЭлемента("ИдСв");
	ЗаписьXML.ЗаписатьНачалоЭлемента("СвЮЛУч");
	
	КПП = ДокВыгрузки.Контрагент.КПП;	//значение по умолчанию  
	ЗаписьXML.ЗаписатьАтрибут("КПП", КПП); 
	
	ЗаписьXML.ЗаписатьАтрибут("НаимОрг", ДокВыгрузки.Контрагент.НаименованиеПолное);
	ЗаписьXML.ЗаписатьАтрибут("ИННЮЛ", ДокВыгрузки.Контрагент.ИНН);
	ЗаписьXML.ЗаписатьКонецЭлемента();
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("Адрес");
	ВыгружатьАдресаКакИностранные = ВыгружатьАдресаКакИностранныеНеПартнер(ДокВыгрузки.Организация, ДокВыгрузки.Контрагент);

	Доступно = СведенияОПокупателе.ЮридическийАдрес.house  = Неопределено;
	Доступно = Доступно или СведенияОПокупателе.ЮридическийАдрес.flat = Неопределено;
	Доступно = Доступно или ВыгружатьАдресаКакИностранные;
	Если Доступно тогда
		ЗаписьXML.ЗаписатьНачалоЭлемента("АдрИнф");
		ЗаписьXML.ЗаписатьАтрибут("КодСтр", "643");	
		ЗаписьXML.ЗаписатьАтрибут("АдрТекст", СокрЛП(СведенияОПокупателе.ЮридическийАдрес.ИсходныйАдрес));	
		ЗаписьXML.ЗаписатьКонецЭлемента();	
	Иначе	
		ЗаписьXML.ЗаписатьНачалоЭлемента("АдрРФ");
		
		Если ЗначениеЗаполнено(СведенияОПокупателе.ЮридическийАдрес.postal_code) Тогда
			ЗаписьXML.ЗаписатьАтрибут("Индекс", СокрЛП(СведенияОПокупателе.ЮридическийАдрес.postal_code));
		КонецЕсли;
		
		Если ДокВыгрузки.Контрагент.Страна.ЭтоСтрана=Ложь тогда
			Если Лев(СокрЛП(ДокВыгрузки.Контрагент.Страна.Код),1)= "0" тогда
				ЗаписьXML.ЗаписатьАтрибут("КодРегион",Сред(СокрЛП(ДокВыгрузки.Контрагент.Страна.Код),2));	
			Иначе	
				ЗаписьXML.ЗаписатьАтрибут("КодРегион",СокрЛП(ДокВыгрузки.Контрагент.Страна.Код));
			КонецЕсли;	
		Иначе 	
			ЗаписьXML.ЗаписатьАтрибут("КодРегион",СокрЛП(ДокВыгрузки.Контрагент.Страна.КодОКСМ));	
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СведенияОПокупателе.ЮридическийАдрес.city_district_with_type) Тогда
			ЗаписьXML.ЗаписатьАтрибут("Район",СокрЛП(СведенияОПокупателе.ЮридическийАдрес.city_district_with_type));
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СведенияОПокупателе.ЮридическийАдрес.city_with_type) Тогда
			ЗаписьXML.ЗаписатьАтрибут("Город", СокрЛП(СведенияОПокупателе.ЮридическийАдрес.city_with_type));
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СведенияОПокупателе.ЮридическийАдрес.settlement_with_type) Тогда
			ЗаписьXML.ЗаписатьАтрибут("НаселПункт", СокрЛП(СведенияОПокупателе.ЮридическийАдрес.settlement_with_type));
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СведенияОПокупателе.ЮридическийАдрес.street_with_type) Тогда
			ЗаписьXML.ЗаписатьАтрибут("Улица", СокрЛП(СведенияОПокупателе.ЮридическийАдрес.street_with_type));
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СведенияОПокупателе.ЮридическийАдрес.house) Тогда
			ЗаписьXML.ЗаписатьАтрибут("Дом", СокрЛП(СведенияОПокупателе.ЮридическийАдрес.house));
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СведенияОПокупателе.ФактическийАдрес.block) Тогда
			ЗаписьXML.ЗаписатьАтрибут("Корпус", СведенияОПокупателе.ФактическийАдрес.block);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СведенияОПокупателе.ЮридическийАдрес.flat) Тогда
			ЗаписьXML.ЗаписатьАтрибут("Кварт", СокрЛП(СведенияОПокупателе.ЮридическийАдрес.flat));
		КонецЕсли;
		
		ЗаписьXML.ЗаписатьКонецЭлемента();
	КонецЕсли;
	ЗаписьXML.ЗаписатьКонецЭлемента();        
	
	Если ЗначениеЗаполнено(СведенияОПокупателе.НомерСчета) Тогда 
		ЗаписьXML.ЗаписатьНачалоЭлемента("БанкРекв");
		ЗаписьXML.ЗаписатьАтрибут("НомерСчета", Строка(СведенияОПокупателе.НомерСчета));
		ЗаписьXML.ЗаписатьНачалоЭлемента("СвБанк");
		ЗаписьXML.ЗаписатьАтрибут("НаимБанк", СведенияОПокупателе.Банк.Наименование);
		ЗаписьXML.ЗаписатьАтрибут("КорСчет", Строка(СведенияОПокупателе.КоррСчет));
		ЗаписьXML.ЗаписатьАтрибут("БИК", Строка(СведенияОПокупателе.БИК));
		ЗаписьXML.ЗаписатьКонецЭлемента();
		ЗаписьXML.ЗаписатьКонецЭлемента();
	КонецЕсли; 	
	ЗаписьXML.ЗаписатьКонецЭлемента();
	//СвПокуп	
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("ДопСвФХЖ1");
	ЗаписьXML.ЗаписатьАтрибут("НаимОКВ", Строка("Российский рубль"));
	Если ТипЗнч(ДокВыгрузки.ДоговорВзаиморасчетов)=Тип("СправочникСсылка.ДоговорыВзаиморасчетов") и ПустаяСтрока(ДокВыгрузки.ДоговорВзаиморасчетов.ИдентификаторГосударственногоКонтракта)=Ложь Тогда
		ЗаписьXML.ЗаписатьАтрибут("ИдГосКон", СокрЛП(ДокВыгрузки.ДоговорВзаиморасчетов.ИдентификаторГосударственногоКонтракта));
	КонецЕсли;
	ЗаписьXML.ЗаписатьКонецЭлемента();

	// Дополнительные поля ИнфПолФХЖ1 из карточки контрагента (ТЧ "Данные"), напр. признак ОЗ
	ЗаписатьИнфПолФХЖ1(ЗаписьXML, ДокВыгрузки.Контрагент);

	ЗаписьXML.ЗаписатьКонецЭлемента();

	//Табличная часть
	ЗаписьXML.ЗаписатьНачалоЭлемента("ТаблКСчФ");
	СуммаБезНДСУменьшение = 0;
	СуммаНДСУменьшение = 0;
	СуммаУменьшение = 0;
	
	Для Каждого ТекСтрока Из ДокВыгрузки.Товары Цикл
		ЗаписьXML.ЗаписатьНачалоЭлемента("СведТов");
		
		Стр_ПозНомер = ТекСтрока.НомерСтроки;
		Стр_ПозНаименование = ТекСтрока.Номенклатура;
		Стр_ЕИНаименование = ТекСтрока.Номенклатура.ЕдиницаИзмерения;
		Стр_ЕИКод = ТекСтрока.Номенклатура.ЕдиницаИзмерения.Код;
		
		Стр_СтавкаНДС = ТекСтрока.СтавкаНДС;
		Стр_ЦенаБезНДСДо = (ТекСтрока.Сумма - ТекСтрока.СуммаНДС)/ТекСтрока.Количество;
		
		Стр_КоличествоДо = 0;
		Стр_СуммаБезНДСДо = 0;			
		Стр_СуммаНДСДо = 0;			
		Стр_СуммаДо = 0;			
		
		НайденныеСтроки = ДокВыгрузки.ДокументОснование.Товары.НайтиСтроки(Новый Структура("Номенклатура", ТекСтрока.Номенклатура));
		Для каждого текСтрокаОснование Из НайденныеСтроки Цикл
			Стр_КоличествоДо = текСтрокаОснование.Количество;			
			Стр_СуммаБезНДСДо = текСтрокаОснование.Сумма - текСтрокаОснование.СуммаНДС;			
			Стр_СуммаНДСДо = текСтрокаОснование.СуммаНДС;			
			Стр_СуммаДо = текСтрокаОснование.Сумма;
			СтавкаНДСДо = текСтрокаОснование.СтавкаНДС;
		КонецЦикла; 
		
		Стр_КоличествоПосле = Стр_КоличествоДо - ТекСтрока.Количество;
		Если Стр_КоличествоПосле=0 Тогда
			Стр_ЦенаБезНДСПосле = 0;
		Иначе
			Стр_ЦенаБезНДСПосле = Стр_ЦенаБезНДСДо;			
		КонецЕсли; 
		
		Стр_СуммаБезНДСПосле = Стр_СуммаБезНДСДо - (ТекСтрока.Сумма - ТекСтрока.СуммаНДС);			
		Стр_СуммаБезНДСУвеличение = 0;			
		Стр_СуммаБезНДСУменьшение = ТекСтрока.Сумма - ТекСтрока.СуммаНДС;	
		
		Стр_СуммаНДСПосле = Стр_СуммаНДСДо - ТекСтрока.СуммаНДС;			
		Стр_СуммаНДСУвеличение = 0;			
		Стр_СуммаНДСУменьшение = ТекСтрока.СуммаНДС;
		
		Стр_СуммаПосле = Стр_СуммаДо - ТекСтрока.Сумма;			
		Стр_СуммаУвеличение = 0;			
		Стр_СуммаУменьшение = ТекСтрока.Сумма;					
		
		//В поле КодТов выгрузка зависит от настроек:
		//1. В карточке заполнено
		//1.1. В карточке выбран ЧертежныйНомер , то приоритеты в порядке убывания: 	1. Чертежный номер	2. КодКаталога
		//1.2. В карточке выбран Артикул, 		  то приоритеты в порядке убывания: 	1. Артикул,			2. КодКаталога;
		//1.3  В карточке выбран КодКаталога, 	  то приоритеты в порядке убывания:		1. КодКаталога		2. ЧертежныйНомер
		//2. В карточке не заполнено. 			  приоритеты в порядке убывания: 		1. Чертежный номер 	2. Артикул, 		3.КодКаталога. 
		
		КодТов = "";
		Если ДокВыгрузки.Контрагент.ЗаполнениеКодаТовара = "КодКаталога" тогда
			КодТов = ?(ЗначениеЗаполнено(СокрЛП(ТекСтрока.Номенклатура.КодКаталога)), СокрЛП(ТекСтрока.Номенклатура.КодКаталога), ТекСтрока.Номенклатура.ЧертежныйНомер);
		ИначеЕсли ДокВыгрузки.Контрагент.ЗаполнениеКодаТовара = "Артикул" тогда
			КодТов = ?(ЗначениеЗаполнено(СокрЛП(ТекСтрока.Номенклатура.Артикул)), СокрЛП(ТекСтрока.Номенклатура.Артикул), ТекСтрока.Номенклатура.КодКаталога);	
		ИначеЕсли ДокВыгрузки.Контрагент.ЗаполнениеКодаТовара = "ЧертежныйНомер" тогда
			КодТов = ?(ЗначениеЗаполнено(СокрЛП(ТекСтрока.Номенклатура.Артикул)), СокрЛП(ТекСтрока.Номенклатура.Артикул), СокрЛП(ТекСтрока.Номенклатура.КодКаталога));
			КодТов = ?(ЗначениеЗаполнено(СокрЛП(ТекСтрока.Номенклатура.ЧертежныйНомер)),СокрЛП(ТекСтрока.Номенклатура.ЧертежныйНомер), КодТов);	
		Иначе
			КодТов = ?(ЗначениеЗаполнено(СокрЛП(ТекСтрока.Номенклатура.Артикул)), СокрЛП(ТекСтрока.Номенклатура.Артикул), СокрЛП(ТекСтрока.Номенклатура.КодКаталога));
			КодТов = ?(ЗначениеЗаполнено(СокрЛП(ТекСтрока.Номенклатура.ЧертежныйНомер)),СокрЛП(ТекСтрока.Номенклатура.ЧертежныйНомер), КодТов);
		КонецЕсли;
		
		ЗаписьXML.ЗаписатьАтрибут("НомСтр", Строка(Стр_ПозНомер));
		ЗаписьXML.ЗаписатьАтрибут("НаимТов", СокрЛП(Стр_ПозНаименование));
		ЗаписьXML.ЗаписатьАтрибут("ОКЕИ_ТовДо", СокрЛП(Стр_ЕИКод));
		ЗаписьXML.ЗаписатьАтрибут("ОКЕИ_ТовПосле", СокрЛП(Стр_ЕИКод));
		ЗаписьXML.ЗаписатьАтрибут("КолТовДо", Строка(Формат(Стр_КоличествоДо,"ЧДЦ=2; ЧРД=.; ЧН=; ЧГ=0")));
		ЗаписьXML.ЗаписатьАтрибут("КолТовПосле", Строка(Формат(Стр_КоличествоПосле,"ЧДЦ=2; ЧРД=.; ЧН=; ЧГ=0")));
		ЗаписьXML.ЗаписатьАтрибут("ЦенаТовДо", Строка(Формат(Стр_ЦенаБезНДСДо,"ЧДЦ=2; ЧРД=.; ЧН=; ЧГ=0")));
		ЗаписьXML.ЗаписатьАтрибут("ЦенаТовПосле", Строка(Формат(Стр_ЦенаБезНДСПосле,"ЧДЦ=2; ЧРД=.; ЧН=; ЧГ=0")));
		ЗаписьXML.ЗаписатьАтрибут("НалСтДо",  ЗначенияСервера.ПреобразуемСтавкиНДС(Стр_СтавкаНДС).Ставка);
		ЗаписьXML.ЗаписатьАтрибут("НалСтПосле",  ЗначенияСервера.ПреобразуемСтавкиНДС(Стр_СтавкаНДС).Ставка);
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("СтТовБезНДС");
		ЗаписьXML.ЗаписатьАтрибут("СтоимДоИзм", Строка(Формат(Стр_СуммаБезНДСДо,"ЧДЦ=2; ЧРД=.; ЧН=; ЧГ=0")));
		ЗаписьXML.ЗаписатьАтрибут("СтоимПослеИзм", Строка(Формат(Стр_СуммаБезНДСПосле,"ЧДЦ=2; ЧРД=.; ЧН=; ЧГ=0")));
		ЗаписьXML.ЗаписатьАтрибут("СтоимУм", Строка(Формат(Стр_СуммаБезНДСУменьшение,"ЧДЦ=2; ЧРД=.; ЧН=; ЧГ=0")));
		ЗаписьXML.ЗаписатьКонецЭлемента(); 
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("АкцизДо");
		ЗаписьXML.ЗаписатьНачалоЭлемента("БезАкциз");
		ЗаписьXML.ЗаписатьТекст("без акциза");
		ЗаписьXML.ЗаписатьКонецЭлемента();
		ЗаписьXML.ЗаписатьКонецЭлемента();
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("АкцизПосле");
		ЗаписьXML.ЗаписатьНачалоЭлемента("БезАкциз");
		ЗаписьXML.ЗаписатьТекст("без акциза");
		ЗаписьXML.ЗаписатьКонецЭлемента();
		ЗаписьXML.ЗаписатьКонецЭлемента();
				
		ЗаписьXML.ЗаписатьНачалоЭлемента("СумНалДо");
		Если СтавкаНДСДо=Справочники.СтавкиНДС.БезНДС тогда          
			ЗаписьXML.ЗаписатьНачалоЭлемента("БезНДС");
			ЗаписьXML.ЗаписатьТекст("без НДС");
			ЗаписьXML.ЗаписатьКонецЭлемента();
		иначе
			ЗаписьXML.ЗаписатьНачалоЭлемента("СумНДС");
			ЗаписьXML.ЗаписатьТекст(Строка(Формат(Стр_СуммаНДСДо,"ЧДЦ=2; ЧРД=.; ЧН=; ЧГ=0")));
			ЗаписьXML.ЗаписатьКонецЭлемента();
		КонецЕсли;
		ЗаписьXML.ЗаписатьКонецЭлемента();//СумНалДо
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("СумНалПосле");
		Если ТекСтрока.СтавкаНДС=Справочники.СтавкиНДС.БезНДС тогда
			ЗаписьXML.ЗаписатьНачалоЭлемента("БезНДС");
			ЗаписьXML.ЗаписатьТекст("без НДС");
			ЗаписьXML.ЗаписатьКонецЭлемента();
		иначе
			ЗаписьXML.ЗаписатьНачалоЭлемента("СумНДС");
			ЗаписьXML.ЗаписатьТекст(Строка(Формат(Стр_СуммаНДСПосле,"ЧДЦ=2; ЧРД=.; ЧН=; ЧГ=0")));
			ЗаписьXML.ЗаписатьКонецЭлемента();
		КонецЕсли;
		ЗаписьXML.ЗаписатьКонецЭлемента();//СумНалПосле
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("СумНалРазн");
		ЗаписьXML.ЗаписатьНачалоЭлемента("СумУм");
		ЗаписьXML.ЗаписатьТекст(Строка(Формат(Стр_СуммаНДСУменьшение,"ЧДЦ=2; ЧРД=.; ЧН=; ЧГ=0")));
		ЗаписьXML.ЗаписатьКонецЭлемента();//СумУм
		ЗаписьXML.ЗаписатьКонецЭлемента();//СумНалРазн
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("СтТовУчНал");
		ЗаписьXML.ЗаписатьАтрибут("СтоимДоИзм", Строка(Формат(Стр_СуммаДо,"ЧДЦ=2; ЧРД=.; ЧН=; ЧГ=0")));
		ЗаписьXML.ЗаписатьАтрибут("СтоимПослеИзм", Строка(Формат(Стр_СуммаПосле,"ЧДЦ=2; ЧРД=.; ЧН=; ЧГ=0")));
		ЗаписьXML.ЗаписатьАтрибут("СтоимУм", Строка(Формат(Стр_СуммаУменьшение,"ЧДЦ=2; ЧРД=.; ЧН=; ЧГ=0")));
		ЗаписьXML.ЗаписатьКонецЭлемента();//СтТовУчНал 
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("ДопСведТов");
		ЗаписьXML.ЗаписатьАтрибут("НаимЕдИзмДо", ТекСтрока.Номенклатура.ЕдиницаИзмерения.Наименование);
		ЗаписьXML.ЗаписатьАтрибут("НаимЕдИзмПосле", ТекСтрока.Номенклатура.ЕдиницаИзмерения.Наименование);
		Если КодТов <> "" тогда
			ЗаписьXML.ЗаписатьАтрибут("КодТов", КодТов);   
		КонецЕсли;
		ЗаписьXML.ЗаписатьКонецЭлемента();//ДопСведТов
				
		///Маркировка///
		мКИЗ_Отгрузки = ПолучитьКИЗ_УКД(ДокВыгрузки.ДокументОснование,ТекСтрока.Номенклатура,ДокВыгрузки.Дата,Ложь);
		мКИЗ_Возврата = ПолучитьКИЗ_УКД(ДокВыгрузки.ДокументОснование,ТекСтрока.Номенклатура,ДокВыгрузки.Дата,Истина);
				
		Если мКИЗ_Отгрузки.Количество() > 0 Тогда
			ЗаписьXML.ЗаписатьНачалоЭлемента("НомСредИдентТовДо");
			Для Каждого стрКИЗ из мКИЗ_Отгрузки Цикл
				ЗаписьXML.ЗаписатьНачалоЭлемента("КИЗ");
				ЗаписьXML.ЗаписатьТекст(Лев(стрКИЗ.КИЗ,31));
				ЗаписьXML.ЗаписатьКонецЭлемента();
			КонецЦикла;
			ЗаписьXML.ЗаписатьКонецЭлемента();
		КонецЕсли;	
		
		Если мКИЗ_Возврата.Количество() > 0 Тогда
			ЗаписьXML.ЗаписатьНачалоЭлемента("НомСредИдентТовПосле");
			Для Каждого стрКИЗ из мКИЗ_Возврата Цикл
				ЗаписьXML.ЗаписатьНачалоЭлемента("КИЗ");
				ЗаписьXML.ЗаписатьТекст(Лев(стрКИЗ.КИЗ,31));
				ЗаписьXML.ЗаписатьКонецЭлемента();
			КонецЦикла;
			ЗаписьXML.ЗаписатьКонецЭлемента();
		КонецЕсли;		
		///Маркировка///
		
		ЗаписьXML.ЗаписатьКонецЭлемента();//СведТов
		
		СуммаБезНДСУменьшение = СуммаБезНДСУменьшение+Стр_СуммаБезНДСУменьшение;
		СуммаНДСУменьшение = СуммаНДСУменьшение+Стр_СуммаНДСУменьшение;
		СуммаУменьшение = СуммаУменьшение+Стр_СуммаУменьшение;
	КонецЦикла;
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("ВсегоУм");
	ЗаписьXML.ЗаписатьАтрибут("СтТовБезНДСВсего", Строка(Формат(СуммаБезНДСУменьшение,"ЧДЦ=2; ЧРД=.; ЧН=; ЧГ=0")));
	ЗаписьXML.ЗаписатьАтрибут("СтТовУчНалВсего", Строка(Формат(СуммаУменьшение,"ЧДЦ=2; ЧРД=.; ЧН=; ЧГ=0")));
	ЗаписьXML.ЗаписатьНачалоЭлемента("СумНал");
	ЗаписьXML.ЗаписатьНачалоЭлемента("СумНДС");
	ЗаписьXML.ЗаписатьТекст(Строка(Формат(СуммаНДСУменьшение,"ЧДЦ=2; ЧРД=.; ЧН=; ЧГ=0")));
	ЗаписьXML.ЗаписатьКонецЭлемента();
	Если СуммаНДСУменьшение=0 тогда
		ЗаписьXML.ЗаписатьНачалоЭлемента("БезНДС");
		ЗаписьXML.ЗаписатьТекст("без НДС");
		ЗаписьXML.ЗаписатьКонецЭлемента();
	КонецЕсли;
	ЗаписьXML.ЗаписатьКонецЭлемента();
	ЗаписьXML.ЗаписатьКонецЭлемента(); 
	ЗаписьXML.ЗаписатьКонецЭлемента();
		
	Статус = ?((ЗначениеЗаполнено(ДокВыгрузки.НомерКоррСчф)=Ложь) ИЛИ (ОрганизацияДляПечати.БезНДС) ИЛИ НЕ (ДокВыгрузки.Состояние=Справочники.СтатусыДокументов.Закрыт), "2", "1");
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("СодФХЖ3");   
	ЗаписьXML.ЗаписатьАтрибут("СодОпер", "Изменение стоимости товаров и услуг");
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("ПередатДокум");
	ЗаписьXML.ЗаписатьАтрибут("НаимОсн", "Универсальный передаточный документ");
	ЗаписьXML.ЗаписатьАтрибут("НомОсн", Строка(ИсходныйДокНомер));
	ЗаписьXML.ЗаписатьАтрибут("ДатаОсн", Формат(ИсходныйДокДата, "ДЛФ=Д"));
	ЗаписьXML.ЗаписатьКонецЭлемента();//ПередатДокум
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("ДокумОснКор");
	Если ЗначениеЗаполнено(ДокВыгрузки.ДоговорВзаиморасчетов) тогда
		ЗаписьXML.ЗаписатьАтрибут("НаимОсн", Конвертация.ПараметрДобавить("","договор: ",ДокВыгрузки.ДоговорВзаиморасчетов.номер));
		ЗаписьXML.ЗаписатьАтрибут("ДатаОсн", Формат(ДокВыгрузки.ДоговорВзаиморасчетов.НачПериода, "ДЛФ=Д"));
	Иначе 
		ЗаписьXML.ЗаписатьАтрибут("НаимОсн", "Без документа-основания");
	КонецЕсли;	
	ЗаписьXML.ЗаписатьКонецЭлемента();//ДокумОснКор
	ЗаписьXML.ЗаписатьКонецЭлемента();//СодФХЖ3
		
	//Подписант
	ЗаписьXML.ЗаписатьНачалоЭлемента("Подписант");
	ЗаписьXML.ЗаписатьАтрибут("ОснПолн", "Должностные обязанности");
	ЗаписьXML.ЗаписатьАтрибут("ОблПолн", "1");
	ЗаписьXML.ЗаписатьАтрибут("Статус", "1");	
	ЗаписьXML.ЗаписатьНачалоЭлемента("ЮЛ");
	Если ЗначениеЗаполнено(ДокВыгрузки.Организация.ИНН) Тогда
		ЗаписьXML.ЗаписатьАтрибут("ИННЮЛ", ДокВыгрузки.Организация.ИНН);		
	Иначе 		
		ЗаписьXML.ЗаписатьАтрибут("ИННЮЛ", "0101010108");
	КонецЕсли;
	ПодписантОветственный = "";
	ЗаписьXML.ЗаписатьАтрибут("Должн", "Директор");
	ЗаписьXML.ЗаписатьНачалоЭлемента("ФИО");
	ЗаписьXML.ЗаписатьАтрибут("Фамилия", "Ф");
	ЗаписьXML.ЗаписатьАтрибут("Имя", "И");
	ЗаписьXML.ЗаписатьАтрибут("Отчество", "О");
	ЗаписьXML.ЗаписатьКонецЭлемента();
	ЗаписьXML.ЗаписатьКонецЭлемента();
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.ЗаписатьКонецЭлемента();
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	Возврат ЗаписьXML.Закрыть();
КонецФункции

&НаСервере
// ДопДанные502 - Структура с полями, перечисленными в README.
// Дополнительные поля не подменяются вымышленными значениями.
Функция ВозвратПокупателя_СформироватьУКД_XML502(ДокВыгрузки, ДопДанные502 = Неопределено) Экспорт
	ИдОтпр = УКД502_Поле(ДопДанные502, "ИдОтпр",
		УКД502_Поле(ДокВыгрузки.Организация, "ИдОтпр"));
	ИдПол = УКД502_Поле(ДопДанные502, "ИдПол",
		УКД502_Поле(ДокВыгрузки.Контрагент, "ИдПол"));
	Если Не ЗначениеЗаполнено(ИдОтпр) Или Не ЗначениеЗаполнено(ИдПол) Тогда
		ВызватьИсключение "УКД 5.02: передайте реальные ИдОтпр и ИдПол в ДопДанные502.";
	КонецЕсли;  
	
	ДатаУКД = ДокВыгрузки.Дата;
	
	СведенияОПоставщике = ЗначенияСервера.СведенияОЮрФизЛице(ДокВыгрузки.Организация, ДатаУКД);
	СведенияОПокупателе = ЗначенияСервера.СведенияОЮРФизЛице(ДокВыгрузки.Контрагент, ДатаУКД);
	
	НовыйУникальныйИдентификатор = Новый УникальныйИдентификатор;
	ДатаДляИндифик = ТекущаяДата();
	Год   = Строка(Формат(ДатаДляИндифик, "ДФ=гггг")); // Год
	Месяц = Строка(Формат(ДатаДляИндифик, "ДФ=ММ"));   // Месяц
	День  = Строка(Формат(ДатаДляИндифик, "ДФ=дд"));   // День
	
	ДатаПреобразоваянная = Год + Месяц + День;
	
	ЗаписьXML = Новый ЗаписьXML;
	
	ЗаписьXML.УстановитьСтроку();
	ЗаписьXML.ЗаписатьОбъявлениеXML();
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("Файл");
	ЗаписьXML.ЗаписатьСоответствиеПространстваИмен("xsd","http://www.w3.org/2001/XMLSchema");
	ЗаписьXML.ЗаписатьСоответствиеПространстваИмен("xsi","http://www.w3.org/2001/XMLSchema-instance");
	
	// Значение ИдФайл должно использоваться и как имя файла при сохранении.
	ИдФайл = "ON_NKORSCHFDOPPR_" + ИдПол + "_" + ИдОтпр + "_" + ДатаПреобразоваянная + "_" + Строка(НовыйУникальныйИдентификатор);
	СуффиксИмени = УКД502_Поле(ДопДанные502, "СуффиксИмениФайла", "");
	Если ЗначениеЗаполнено(СуффиксИмени) Тогда
		ИдФайл = ИдФайл + "_" + СуффиксИмени;
	КонецЕсли;
	Если СтрДлина(ИдФайл) > 255 Тогда
		ВызватьИсключение "УКД 5.02: длина ИдФайл превышает 255 символов.";
	КонецЕсли;
	ЗаписьXML.ЗаписатьАтрибут("ИдФайл", ИдФайл);	
	ЗаписьXML.ЗаписатьАтрибут("ВерсФорм", "5.02");
	ЗаписьXML.ЗаписатьАтрибут("ВерсПрог", "1.0");
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("Документ");	
	ЗаписьXML.ЗаписатьАтрибут("КНД", "1115133");
	УКД502_АтрибутИз(ЗаписьXML, ДопДанные502, "УИД"); 	
	ЗаписьXML.ЗаписатьАтрибут("ПоФактХЖ", "Документ, подтверждающий согласие (факт уведомления) покупателя на изменение стоимости отгруженных товаров (выполненных работ, оказанных услуг), переданных имущественных прав");
	ЗаписьXML.ЗаписатьАтрибут("НаимДокОпр", "Корректировочный счет-фактура и документ об изменении стоимости отгруженных товаров (выполненных работ, оказанных услуг), переданных имущественных прав");
	ЗаписьXML.ЗаписатьАтрибут("ДатаИнфПр", УКД502_Дата(ДатаУКД));
	ЗаписьXML.ЗаписатьАтрибут("ВремИнфПр", Формат(ТекущаяДата(), "ДФ=ЧЧ.мм.сс"));
	ЗаписьXML.ЗаписатьАтрибут("НаимЭконСубОформ", ДокВыгрузки.Организация.НаименованиеПолное);
	ЗаписьXML.ЗаписатьАтрибут("Функция", "КСЧФДИС");
	УКД502_АтрибутИз(ЗаписьXML, ДопДанные502, "СоглСтрДопИнф");
	// В порядке XSD ОснДоверОргОформ расположен ПЕРЕД СвКСчФ.
	ОснДоверОргОформ = УКД502_Поле(ДопДанные502, "ОснДоверОргОформ");
	Если ОснДоверОргОформ <> Неопределено Тогда
		УКД502_ЗаписатьРеквДок(ЗаписьXML, "ОснДоверОргОформ", ОснДоверОргОформ);
	КонецЕсли;
	
	УчетныйНомер = ?(ЗначениеЗаполнено(ДокВыгрузки.НомерКоррСчф),ДокВыгрузки.НомерКоррСчф,ДокВыгрузки.Номер);
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("СвКСчФ");
	ЗаписьXML.ЗаписатьАтрибут("НомерДок", УчетныйНомер);
	ЗаписьXML.ЗаписатьАтрибут("ДатаДок", УКД502_Дата(ДокВыгрузки.Дата));
	ИспрКСчФ = УКД502_Поле(ДопДанные502, "ИспрКСчФ");
	Если ИспрКСчФ <> Неопределено Тогда
		УКД502_Обязательное(УКД502_Поле(ИспрКСчФ, "НомИспрКСчФ"), "ИспрКСчФ.НомИспрКСчФ");
		УКД502_Обязательное(УКД502_Поле(ИспрКСчФ, "ДатаИспрКСчФ"), "ИспрКСчФ.ДатаИспрКСчФ");
		ЗаписьXML.ЗаписатьНачалоЭлемента("ИспрКСчФ");
		УКД502_Атрибуты(ЗаписьXML, ИспрКСчФ, "НомИспрКСчФ,ДатаИспрКСчФ");
		ЗаписьXML.ЗаписатьКонецЭлемента();
	КонецЕсли;
	
	
	
	ИсходныйДокНомер = ?(ЗначениеЗаполнено(ДокВыгрузки.ДокументОснование.НомерСчф),ДокВыгрузки.ДокументОснование.НомерСчф,ДокВыгрузки.ДокументОснование.Номер);
	ИсходныйДокДата =ДокВыгрузки.ДокументОснование.Дата;
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("СчФ");
	ЗаписьXML.ЗаписатьАтрибут("НомерСчФ", ИсходныйДокНомер);
	ЗаписьXML.ЗаписатьАтрибут("ДатаСчФ", УКД502_Дата(ИсходныйДокДата));
	ИспрСчФ = УКД502_Поле(ДопДанные502, "ИспрСчФ");
	Если ИспрСчФ <> Неопределено Тогда
		Если ТипЗнч(ИспрСчФ) <> Тип("Массив") Тогда
			ОднаПравка = ИспрСчФ;
			ИспрСчФ = Новый Массив;
			ИспрСчФ.Добавить(ОднаПравка);
		КонецЕсли;
		Для Каждого Правка Из ИспрСчФ Цикл
			ЗаписьXML.ЗаписатьНачалоЭлемента("ИспрСчФ");
			УКД502_Обязательное(УКД502_Поле(Правка, "НомИспрСчФ"), "ИспрСчФ.НомИспрСчФ");
			УКД502_Обязательное(УКД502_Поле(Правка, "ДатаИспрСчФ"), "ИспрСчФ.ДатаИспрСчФ");
			УКД502_Атрибуты(ЗаписьXML, Правка, "НомИспрСчФ,ДатаИспрСчФ");
			ЗаписьXML.ЗаписатьКонецЭлемента();
		КонецЦикла;
	КонецЕсли;
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	// Участники; адреса ГАР / РФ / текстовые - взаимоисключающие варианты XSD.
	УКД502_ЗаписатьУчастника(ЗаписьXML, "СвПрод", ДокВыгрузки.Организация,
		СведенияОПоставщике, УКД502_Поле(ДопДанные502, "Продавец"),
		УКД502_Поле(ДопДанные502, "АдрГАРПродавца"));
	УКД502_ЗаписатьУчастника(ЗаписьXML, "СвПокуп", ДокВыгрузки.Контрагент,
		СведенияОПокупателе, УКД502_Поле(ДопДанные502, "Покупатель"),
		УКД502_Поле(ДопДанные502, "АдрГАРПокупателя"));

	ЗаписьXML.ЗаписатьНачалоЭлемента("ДенИзм");
	ЗаписьXML.ЗаписатьАтрибут("КодОКВ", "643");
	ЗаписьXML.ЗаписатьАтрибут("НаимОКВ", "Российский рубль");
	ЗаписьXML.ЗаписатьАтрибут("КурсВал", "1.0000");
	ЗаписьXML.ЗаписатьКонецЭлемента();

	ЗаписьXML.ЗаписатьНачалоЭлемента("ДопСвФХЖ1");
	ДопСвДок = УКД502_Поле(ДопДанные502, "ДопСвФХЖ1");
	УКД502_Атрибуты(ЗаписьXML, ДопСвДок, "СпОбстФКСЧФ,СпОбстФКСЧФДИС,СпОбстФДИС");
	ИдГосКон = УКД502_Поле(ДопСвДок, "ИдГосКон");
	Если Не УКД502_Заполнено(ИдГосКон) Тогда
		Попытка
			ИдГосКон = ДокВыгрузки.ДоговорВзаиморасчетов.ИдентификаторГосударственногоКонтракта;
		Исключение
			ИдГосКон = Неопределено;
		КонецПопытки;
	КонецЕсли;
	Если УКД502_Заполнено(ИдГосКон) Тогда
		ЗаписьXML.ЗаписатьАтрибут("ИдГосКон", УКД502_Текст(ИдГосКон));
	КонецЕсли;
	// Новые реквизиты обязательств и казначейского сопровождения.
	УКД502_ЗаписатьВидОбяз(ЗаписьXML, УКД502_Поле(ДопДанные502, "ВидОбяз"));
	УКД502_ЗаписатьИнфПродЗаГоскКазн(ЗаписьXML,
		УКД502_Поле(ДопДанные502, "ИнфПродЗаГоскКазн"));
	ЗаписьXML.ЗаписатьКонецЭлемента();

	// Если переданы реквизиты 5.02 - используем их; иначе оставляем существующий
	// генератор из конфигурации (его результат отдельно необходимо проверять).
	ИнфПолФХЖ1_502 = УКД502_Поле(ДопДанные502, "ИнфПолФХЖ1");
	Если ИнфПолФХЖ1_502 <> Неопределено Тогда
		УКД502_ЗаписатьИнфПолФХЖ1(ЗаписьXML, ИнфПолФХЖ1_502);
	Иначе
		ЗаписатьИнфПолФХЖ1(ЗаписьXML, ДокВыгрузки.Контрагент);
	КонецЕсли;

	ЗаписьXML.ЗаписатьКонецЭлемента();

	//Табличная часть
	ЗаписьXML.ЗаписатьНачалоЭлемента("ТаблКСчФ");
	СуммаБезНДСУменьшение = 0;
	СуммаНДСУменьшение = 0;
	СуммаУменьшение = 0;
	
	Для Каждого ТекСтрока Из ДокВыгрузки.Товары Цикл
		ДопТовар = УКД502_Поле(УКД502_Поле(ДопДанные502, "Товары"),
			Строка(ТекСтрока.НомерСтроки));
		ЗаписьXML.ЗаписатьНачалоЭлемента("СведТов");
		
		Стр_ПозНомер = ТекСтрока.НомерСтроки;
		Стр_ПозНаименование = ТекСтрока.Номенклатура;
		Стр_ЕИНаименование = ТекСтрока.Номенклатура.ЕдиницаИзмерения;
		Стр_ЕИКод = ТекСтрока.Номенклатура.ЕдиницаИзмерения.Код;
		
		Стр_СтавкаНДС = ТекСтрока.СтавкаНДС;
		Стр_ЦенаБезНДСДо = 0;
		СтавкаНДСДо = ТекСтрока.СтавкаНДС;
		
		Стр_КоличествоДо = 0;
		Стр_СуммаБезНДСДо = 0;			
		Стр_СуммаНДСДо = 0;			
		Стр_СуммаДо = 0;			
		
		НайденныеСтроки = ДокВыгрузки.ДокументОснование.Товары.НайтиСтроки(Новый Структура("Номенклатура", ТекСтрока.Номенклатура));
		Если НайденныеСтроки.Количество() <> 1 Тогда
			ВызватьИсключение "УКД 5.02: неоднозначная или отсутствующая строка исходной реализации для номенклатуры "
				+ Строка(ТекСтрока.Номенклатура) + ". Требуется сопоставление строк по идентификатору.";
		КонецЕсли;
		Для каждого текСтрокаОснование Из НайденныеСтроки Цикл
			ИсходныйНомерСтроки = текСтрокаОснование.НомерСтроки;
			Стр_КоличествоДо = текСтрокаОснование.Количество;			
			Стр_СуммаБезНДСДо = текСтрокаОснование.Сумма - текСтрокаОснование.СуммаНДС;			
			Стр_СуммаНДСДо = текСтрокаОснование.СуммаНДС;			
			Стр_СуммаДо = текСтрокаОснование.Сумма;
			Если Стр_КоличествоДо <> 0 Тогда
				Стр_ЦенаБезНДСДо = Стр_СуммаБезНДСДо / Стр_КоличествоДо;
			КонецЕсли;
			СтавкаНДСДо = текСтрокаОснование.СтавкаНДС;
		КонецЦикла; 
		
		Стр_КоличествоПосле = Стр_КоличествоДо - ТекСтрока.Количество;
		Если Стр_КоличествоПосле=0 Тогда
			Стр_ЦенаБезНДСПосле = 0;
		Иначе
			Стр_ЦенаБезНДСПосле = Стр_ЦенаБезНДСДо;			
		КонецЕсли; 
		
		Стр_СуммаБезНДСПосле = Стр_СуммаБезНДСДо - (ТекСтрока.Сумма - ТекСтрока.СуммаНДС);			
		Стр_СуммаБезНДСУвеличение = 0;			
		Стр_СуммаБезНДСУменьшение = ТекСтрока.Сумма - ТекСтрока.СуммаНДС;	
		
		Стр_СуммаНДСПосле = Стр_СуммаНДСДо - ТекСтрока.СуммаНДС;			
		Стр_СуммаНДСУвеличение = 0;			
		Стр_СуммаНДСУменьшение = ТекСтрока.СуммаНДС;
		
		Стр_СуммаПосле = Стр_СуммаДо - ТекСтрока.Сумма;			
		Стр_СуммаУвеличение = 0;			
		Стр_СуммаУменьшение = ТекСтрока.Сумма;					
		
		//В поле КодТов выгрузка зависит от настроек:
		//1. В карточке заполнено
		//1.1. В карточке выбран ЧертежныйНомер , то приоритеты в порядке убывания: 	1. Чертежный номер	2. КодКаталога
		//1.2. В карточке выбран Артикул, 		  то приоритеты в порядке убывания: 	1. Артикул,			2. КодКаталога;
		//1.3  В карточке выбран КодКаталога, 	  то приоритеты в порядке убывания:		1. КодКаталога		2. ЧертежныйНомер
		//2. В карточке не заполнено. 			  приоритеты в порядке убывания: 		1. Чертежный номер 	2. Артикул, 		3.КодКаталога. 
		
		КодТов = "";
		Если ДокВыгрузки.Контрагент.ЗаполнениеКодаТовара = "КодКаталога" тогда
			КодТов = ?(ЗначениеЗаполнено(СокрЛП(ТекСтрока.Номенклатура.КодКаталога)), СокрЛП(ТекСтрока.Номенклатура.КодКаталога), ТекСтрока.Номенклатура.ЧертежныйНомер);
		ИначеЕсли ДокВыгрузки.Контрагент.ЗаполнениеКодаТовара = "Артикул" тогда
			КодТов = ?(ЗначениеЗаполнено(СокрЛП(ТекСтрока.Номенклатура.Артикул)), СокрЛП(ТекСтрока.Номенклатура.Артикул), ТекСтрока.Номенклатура.КодКаталога);	
		ИначеЕсли ДокВыгрузки.Контрагент.ЗаполнениеКодаТовара = "ЧертежныйНомер" тогда
			КодТов = ?(ЗначениеЗаполнено(СокрЛП(ТекСтрока.Номенклатура.Артикул)), СокрЛП(ТекСтрока.Номенклатура.Артикул), СокрЛП(ТекСтрока.Номенклатура.КодКаталога));
			КодТов = ?(ЗначениеЗаполнено(СокрЛП(ТекСтрока.Номенклатура.ЧертежныйНомер)),СокрЛП(ТекСтрока.Номенклатура.ЧертежныйНомер), КодТов);	
		Иначе
			КодТов = ?(ЗначениеЗаполнено(СокрЛП(ТекСтрока.Номенклатура.Артикул)), СокрЛП(ТекСтрока.Номенклатура.Артикул), СокрЛП(ТекСтрока.Номенклатура.КодКаталога));
			КодТов = ?(ЗначениеЗаполнено(СокрЛП(ТекСтрока.Номенклатура.ЧертежныйНомер)),СокрЛП(ТекСтрока.Номенклатура.ЧертежныйНомер), КодТов);
		КонецЕсли;
		
		ЗаписьXML.ЗаписатьАтрибут("НомСтр", Строка(Стр_ПозНомер));
		ЗаписьXML.ЗаписатьАтрибут("НаимТов", СокрЛП(Строка(Стр_ПозНаименование)));
		ЗаписьXML.ЗаписатьАтрибут("ПорНомТовВСЧФ", Строка(ИсходныйНомерСтроки));
		ЗаписьXML.ЗаписатьАтрибут("ОКЕИ_Тов", СокрЛП(Стр_ЕИКод));
		ЗаписьXML.ЗаписатьАтрибут("НаимЕдИзм", Строка(Стр_ЕИНаименование.Наименование));
		ЗаписьXML.ЗаписатьАтрибут("КолТовДо", Строка(Формат(Стр_КоличествоДо,"ЧДЦ=11; ЧРД=.; ЧН=; ЧГ=0")));
		ЗаписьXML.ЗаписатьАтрибут("КолТовПосле", Строка(Формат(Стр_КоличествоПосле,"ЧДЦ=11; ЧРД=.; ЧН=; ЧГ=0")));
		ЗаписьXML.ЗаписатьАтрибут("ЦенаТовДо", Строка(Формат(Стр_ЦенаБезНДСДо,"ЧДЦ=11; ЧРД=.; ЧН=; ЧГ=0")));
		ЗаписьXML.ЗаписатьАтрибут("ЦенаТовПосле", Строка(Формат(Стр_ЦенаБезНДСПосле,"ЧДЦ=11; ЧРД=.; ЧН=; ЧГ=0")));
		Если Стр_СтавкаНДС = Справочники.СтавкиНДС.БезНДС Тогда
			ЗаписьXML.ЗаписатьАтрибут("НалСт", "без НДС");
		Иначе
			ЗаписьXML.ЗаписатьАтрибут("НалСт", ЗначенияСервера.ПреобразуемСтавкиНДС(Стр_СтавкаНДС).Ставка);
		КонецЕсли;
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("СтТовБезНДС");
		ЗаписьXML.ЗаписатьАтрибут("СтоимДоИзм", Строка(Формат(Стр_СуммаБезНДСДо,"ЧДЦ=2; ЧРД=.; ЧН=; ЧГ=0")));
		ЗаписьXML.ЗаписатьАтрибут("СтоимПослеИзм", Строка(Формат(Стр_СуммаБезНДСПосле,"ЧДЦ=2; ЧРД=.; ЧН=; ЧГ=0")));
		Если Стр_СуммаБезНДСУменьшение > 0 Тогда
			ЗаписьXML.ЗаписатьАтрибут("СтоимУм", Строка(Формат(Стр_СуммаБезНДСУменьшение,"ЧДЦ=2; ЧРД=.; ЧН=; ЧГ=0")));
		КонецЕсли;
		ЗаписьXML.ЗаписатьКонецЭлемента(); 
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("АкцизДо");
		ЗаписьXML.ЗаписатьНачалоЭлемента("БезАкциз");
		ЗаписьXML.ЗаписатьТекст("без акциза");
		ЗаписьXML.ЗаписатьКонецЭлемента();
		ЗаписьXML.ЗаписатьКонецЭлемента();
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("АкцизПосле");
		ЗаписьXML.ЗаписатьНачалоЭлемента("БезАкциз");
		ЗаписьXML.ЗаписатьТекст("без акциза");
		ЗаписьXML.ЗаписатьКонецЭлемента();
		ЗаписьXML.ЗаписатьКонецЭлемента();
		// Для товара без акциза разница равна нулю.
		ЗаписьXML.ЗаписатьНачалоЭлемента("АкцизРазн");
		ЗаписьXML.ЗаписатьНачалоЭлемента("СумУм");
		ЗаписьXML.ЗаписатьТекст("0.00");
		ЗаписьXML.ЗаписатьКонецЭлемента();
		ЗаписьXML.ЗаписатьКонецЭлемента();

		ЗаписьXML.ЗаписатьНачалоЭлемента("СумНалДо");
		Если СтавкаНДСДо=Справочники.СтавкиНДС.БезНДС тогда          
			ЗаписьXML.ЗаписатьНачалоЭлемента("БезНДС");
			ЗаписьXML.ЗаписатьТекст("без НДС");
			ЗаписьXML.ЗаписатьКонецЭлемента();
		иначе
			ЗаписьXML.ЗаписатьНачалоЭлемента("СумНДС");
			ЗаписьXML.ЗаписатьТекст(Строка(Формат(Стр_СуммаНДСДо,"ЧДЦ=2; ЧРД=.; ЧН=; ЧГ=0")));
			ЗаписьXML.ЗаписатьКонецЭлемента();
		КонецЕсли;
		ЗаписьXML.ЗаписатьКонецЭлемента();//СумНалДо
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("СумНалПосле");
		Если ТекСтрока.СтавкаНДС=Справочники.СтавкиНДС.БезНДС тогда
			ЗаписьXML.ЗаписатьНачалоЭлемента("БезНДС");
			ЗаписьXML.ЗаписатьТекст("без НДС");
			ЗаписьXML.ЗаписатьКонецЭлемента();
		иначе
			ЗаписьXML.ЗаписатьНачалоЭлемента("СумНДС");
			ЗаписьXML.ЗаписатьТекст(Строка(Формат(Стр_СуммаНДСПосле,"ЧДЦ=2; ЧРД=.; ЧН=; ЧГ=0")));
			ЗаписьXML.ЗаписатьКонецЭлемента();
		КонецЕсли;
		ЗаписьXML.ЗаписатьКонецЭлемента();//СумНалПосле
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("СумНалРазн");
		ЗаписьXML.ЗаписатьНачалоЭлемента("СумУм");
		ЗаписьXML.ЗаписатьТекст(Строка(Формат(Стр_СуммаНДСУменьшение,"ЧДЦ=2; ЧРД=.; ЧН=; ЧГ=0")));
		ЗаписьXML.ЗаписатьКонецЭлемента();//СумУм
		ЗаписьXML.ЗаписатьКонецЭлемента();//СумНалРазн
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("СтТовУчНал");
		ЗаписьXML.ЗаписатьАтрибут("СтоимДоИзм", Строка(Формат(Стр_СуммаДо,"ЧДЦ=2; ЧРД=.; ЧН=; ЧГ=0")));
		ЗаписьXML.ЗаписатьАтрибут("СтоимПослеИзм", Строка(Формат(Стр_СуммаПосле,"ЧДЦ=2; ЧРД=.; ЧН=; ЧГ=0")));
		Если Стр_СуммаУменьшение > 0 Тогда
			ЗаписьXML.ЗаписатьАтрибут("СтоимУм", Строка(Формат(Стр_СуммаУменьшение,"ЧДЦ=2; ЧРД=.; ЧН=; ЧГ=0")));
		КонецЕсли;
		ЗаписьXML.ЗаписатьКонецЭлемента();//СтТовУчНал 
		
		// Таможенные декларации и пользовательские поля товара - перед ДопСведТов.
		УКД502_ЗаписатьСвДТ(ЗаписьXML, УКД502_Поле(ДопТовар, "СвДТ"));
		УКД502_ЗаписатьИнфПолФХЖ2(ЗаписьXML, УКД502_Поле(ДопТовар, "ИнфПолФХЖ2"));
		ЗаписьXML.ЗаписатьНачалоЭлемента("ДопСведТов");
		УКД502_Атрибуты(ЗаписьXML, УКД502_Поле(ДопТовар, "ДопСведТов"),
			"ПрТовРаб,ДопПризн,ХарактерТов,СортТов,СерияТов,АртикулТов,КодКат,КодВидТов,КодВидПр,КодТовОКПД2");
		Если КодТов <> "" тогда
			ЗаписьXML.ЗаписатьАтрибут("КодТов", КодТов);   
		КонецЕсли;
		// Порядок в ДопСведТов: прослеживаемость, маркировка, гос. системы.
		УКД502_ЗаписатьСведПрослеж(ЗаписьXML, УКД502_Поле(ДопТовар, "СведПрослеж"));
		///Маркировка///
		мКИЗ_Отгрузки = ПолучитьКИЗ_УКД(ДокВыгрузки.ДокументОснование,ТекСтрока.Номенклатура,ДокВыгрузки.Дата,Ложь);
		мКИЗ_Возврата = ПолучитьКИЗ_УКД(ДокВыгрузки.ДокументОснование,ТекСтрока.Номенклатура,ДокВыгрузки.Дата,Истина);
				
		ДопМаркировка = УКД502_Поле(ДопТовар, "Маркировка");
		УКД502_ЗаписатьМаркировку(ЗаписьXML, "НомСредИдентТовДо", мКИЗ_Отгрузки,
			УКД502_Поле(ДопМаркировка, "До"));
		УКД502_ЗаписатьМаркировку(ЗаписьXML, "НомСредИдентТовПосле", мКИЗ_Возврата,
			УКД502_Поле(ДопМаркировка, "После"));
		УКД502_ЗаписатьСвГосСист(ЗаписьXML, УКД502_Поле(ДопТовар, "СвГосСист"));
		///Маркировка///
		ЗаписьXML.ЗаписатьКонецЭлемента();//ДопСведТов
		
		ЗаписьXML.ЗаписатьКонецЭлемента();//СведТов
		
		СуммаБезНДСУменьшение = СуммаБезНДСУменьшение+Стр_СуммаБезНДСУменьшение;
		СуммаНДСУменьшение = СуммаНДСУменьшение+Стр_СуммаНДСУменьшение;
		СуммаУменьшение = СуммаУменьшение+Стр_СуммаУменьшение;
	КонецЦикла;
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("ВсегоУм");
	ЗаписьXML.ЗаписатьАтрибут("СтТовБезНДСВсего", Строка(Формат(СуммаБезНДСУменьшение,"ЧДЦ=2; ЧРД=.; ЧН=; ЧГ=0")));
	ЗаписьXML.ЗаписатьАтрибут("СтТовУчНалВсего", Строка(Формат(СуммаУменьшение,"ЧДЦ=2; ЧРД=.; ЧН=; ЧГ=0")));
	ЗаписьXML.ЗаписатьНачалоЭлемента("СумНалВсего");
	Если СуммаНДСУменьшение = 0 И ДокВыгрузки.Товары.Количество() > 0 И ДокВыгрузки.Товары[0].СтавкаНДС = Справочники.СтавкиНДС.БезНДС Тогда
		ЗаписьXML.ЗаписатьНачалоЭлемента("БезНДС");
		ЗаписьXML.ЗаписатьТекст("без НДС");
	Иначе
		ЗаписьXML.ЗаписатьНачалоЭлемента("СумНДС");
			ЗаписьXML.ЗаписатьТекст(Строка(Формат(СуммаНДСУменьшение,"ЧДЦ=2; ЧРД=.; ЧН=; ЧГ=0")));
	КонецЕсли;
	ЗаписьXML.ЗаписатьКонецЭлемента();//СумНДС или БезНДС
	ЗаписьXML.ЗаписатьКонецЭлемента(); 
	ЗаписьXML.ЗаписатьКонецЭлемента();
		
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("СодФХЖ3");   
	ЗаписьXML.ЗаписатьАтрибут("СодОпер", УКД502_Поле(ДопДанные502, "СодОпер", "1"));
	ЗаписьXML.ЗаписатьАтрибут("УточСодОпер", "Изменение стоимости товаров и услуг");
	УКД502_Атрибуты(ЗаписьXML, ДопДанные502, "ИныеСвИзмСтоим,ДатаНапр");
	
	ПередатДок = УКД502_Поле(ДопДанные502, "ПередатДокум");
	Если ПередатДок = Неопределено Тогда
		ПередатДок = Новый Структура("РеквНаимДок,РеквНомерДок,РеквДатаДок",
			"Универсальный передаточный документ", Строка(ИсходныйДокНомер), ИсходныйДокДата);
	КонецЕсли;
	УКД502_ЗаписатьРеквДок(ЗаписьXML, "ПередатДокум", ПередатДок);
	ОснКор = УКД502_Поле(ДопДанные502, "ДокумОснКор");
	Если ОснКор = Неопределено Тогда
		Если ЗначениеЗаполнено(ДокВыгрузки.ДоговорВзаиморасчетов) Тогда
			ОснКор = Новый Структура("РеквНаимДок,РеквНомерДок,РеквДатаДок",
				"Договор", Строка(ДокВыгрузки.ДоговорВзаиморасчетов.Номер),
				ДокВыгрузки.ДоговорВзаиморасчетов.НачПериода);
		Иначе
			ВызватьИсключение "УКД 5.02: не указан документ-основание корректировки (ДокумОснКор).";
		КонецЕсли;
	КонецЕсли;
	УКД502_ЗаписатьРеквДок(ЗаписьXML, "ДокумОснКор", ОснКор);
	ЗаписьXML.ЗаписатьКонецЭлемента();//СодФХЖ3
		
	// Подписант: реальные данные вместо фиктивных Ф/И/О.
	Подписант = УКД502_Поле(ДопДанные502, "Подписант");
	Если Подписант = Неопределено Тогда
		Подписант = УКД502_ПодписантИзДокумента(ДокВыгрузки);
	КонецЕсли;
	УКД502_ЗаписатьПодписанта(ЗаписьXML, Подписант);

	ЗаписьXML.ЗаписатьКонецЭлемента();
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	Возврат ЗаписьXML.Закрыть();
КонецФункции

// Действительные реквизиты документа ВозвратПокупателя и справочника Сотрудники
// проверены по метаданным выгрузки конфигурации.
Функция УКД502_ПодписантИзДокумента(ДокВыгрузки)
	Сотрудник = УКД502_Поле(ДокВыгрузки, "СотрудникРуководитель");
	Если Не ЗначениеЗаполнено(Сотрудник) Тогда
		ВызватьИсключение "УКД 5.02: не указан СотрудникРуководитель. Передайте Подписант в ДопДанные502.";
	КонецЕсли;
	Фамилия = УКД502_Поле(Сотрудник, "Фамилия");
	Имя = УКД502_Поле(Сотрудник, "Имя");
	УКД502_Обязательное(Фамилия, "СотрудникРуководитель.Фамилия");
	УКД502_Обязательное(Имя, "СотрудникРуководитель.Имя");
	ФИО = Новый Структура("Фамилия,Имя", Фамилия, Имя);
	Отчество = УКД502_Поле(Сотрудник, "Отчество");
	Если УКД502_Заполнено(Отчество) Тогда ФИО.Вставить("Отчество", Отчество); КонецЕсли;
	Результат = Новый Структура("СпосПодтПолном,ФИО", "1", ФИО);
	Должность = УКД502_Поле(Сотрудник, "Должность");
	Если УКД502_Заполнено(Должность) Тогда
		Результат.Вставить("Должн", Строка(Должность));
	КонецЕсли;
	Результат.Вставить("ДатаПодДок", ДокВыгрузки.Дата);
	Возврат Результат;
КонецФункции

// --------------------- ВСПОМОГАТЕЛЬНЫЕ ФУНКЦИИ 5.02 ---------------------

Функция УКД502_Поле(Источник, Имя, ПоУмолчанию = Неопределено)
	Если Источник = Неопределено Или Источник = Null Тогда
		Возврат ПоУмолчанию;
	КонецЕсли;
	Попытка
		Если ТипЗнч(Источник) = Тип("Структура") Или ТипЗнч(Источник) = Тип("ФиксированнаяСтруктура") Тогда
			Результат = Неопределено;
			Если Источник.Свойство(Имя, Результат) Тогда
				Возврат Результат;
			КонецЕсли;
		ИначеЕсли ТипЗнч(Источник) = Тип("Соответствие") Или ТипЗнч(Источник) = Тип("ФиксированноеСоответствие") Тогда
			Результат = Источник.Получить(Имя);
			Если Результат <> Неопределено Тогда
				Возврат Результат;
			КонецЕсли;
		Иначе
			Возврат Источник[Имя];
		КонецЕсли;
	Исключение
		// Реквизит может отсутствовать в конкретной конфигурации 1С.
	КонецПопытки;
	Возврат ПоУмолчанию;
КонецФункции

Функция УКД502_Заполнено(Значение)
	Если Значение = Неопределено Или Значение = Null Тогда Возврат Ложь; КонецЕсли;
	// Ноль - допустимое заполненное число для некоторых количеств и сумм.
	Если ТипЗнч(Значение) = Тип("Число") Тогда Возврат Истина; КонецЕсли;
	Возврат ЗначениеЗаполнено(Значение);
КонецФункции

Функция УКД502_Текст(Значение)
	Если Значение = Неопределено Или Значение = Null Тогда
		Возврат "";
	КонецЕсли;
	Если ТипЗнч(Значение) = Тип("Число") Тогда
		// XML Schema требует точку как десятичный разделитель и отсутствие групп разрядов.
		Возврат СтрЗаменить(СтрЗаменить(СокрЛП(Строка(Значение)), " ", ""), ",", ".");
	КонецЕсли;
	Возврат СокрЛП(Строка(Значение));
КонецФункции

Функция УКД502_Дата(Значение)
	Если ТипЗнч(Значение) = Тип("Дата") Тогда
		Возврат Формат(Значение, "ДФ=дд.ММ.гггг");
	КонецЕсли;
	Возврат УКД502_Текст(Значение);
КонецФункции

Процедура УКД502_АтрибутИз(Запись, Источник, Имя, ИмяВXML = "")
	Значение = УКД502_Поле(Источник, Имя);
	Если Не УКД502_Заполнено(Значение) Тогда
		Возврат;
	КонецЕсли;
	Если ИмяВXML = "" Тогда ИмяВXML = Имя; КонецЕсли;
	Если ТипЗнч(Значение) = Тип("Дата") Тогда
		Запись.ЗаписатьАтрибут(ИмяВXML, УКД502_Дата(Значение));
	Иначе
		Запись.ЗаписатьАтрибут(ИмяВXML, УКД502_Текст(Значение));
	КонецЕсли;
КонецПроцедуры

Процедура УКД502_Атрибуты(Запись, Источник, Список)
	Для Каждого Имя Из СтрРазделить(Список, ",") Цикл
		УКД502_АтрибутИз(Запись, Источник, Имя);
	КонецЦикла;
КонецПроцедуры

Процедура УКД502_Обязательное(Значение, Имя)
	Если Не УКД502_Заполнено(Значение) Тогда
		ВызватьИсключение "УКД 5.02: не заполнено обязательное поле " + Имя;
	КонецЕсли;
КонецПроцедуры

Процедура УКД502_ЭлементТекст(Запись, Имя, Значение)
	Если Не УКД502_Заполнено(Значение) Тогда Возврат; КонецЕсли;
	Запись.ЗаписатьНачалоЭлемента(Имя);
	Запись.ЗаписатьТекст(УКД502_Текст(Значение));
	Запись.ЗаписатьКонецЭлемента();
КонецПроцедуры

Процедура УКД502_ЗаписатьФИО(Запись, Источник)
	Фамилия = УКД502_Поле(Источник, "Фамилия");
	Имя = УКД502_Поле(Источник, "Имя");
	УКД502_Обязательное(Фамилия, "ФИО.Фамилия");
	УКД502_Обязательное(Имя, "ФИО.Имя");
	Запись.ЗаписатьНачалоЭлемента("ФИО");
	Запись.ЗаписатьАтрибут("Фамилия", УКД502_Текст(Фамилия));
	Запись.ЗаписатьАтрибут("Имя", УКД502_Текст(Имя));
	УКД502_АтрибутИз(Запись, Источник, "Отчество");
	Запись.ЗаписатьКонецЭлемента();
КонецПроцедуры

Процедура УКД502_ЗаписатьИдСв(Запись, Лицо, ДопЛицо)
	ИНН = УКД502_Текст(УКД502_Поле(Лицо, "ИНН"));
	ТипЛица = УКД502_Текст(УКД502_Поле(ДопЛицо, "ТипЛица"));
	Если ТипЛица = "" Тогда
		ТипКонтрагента = УКД502_Поле(Лицо, "ТипКонтрагента");
		Если ТипКонтрагента = Перечисления.ТипКонтрагента.Ип Тогда
			ТипЛица = "ИП";
		ИначеЕсли ТипКонтрагента = Перечисления.ТипКонтрагента.Фл Тогда
			ТипЛица = "ФЛ";
		ИначеЕсли СтрДлина(ИНН) = 10 Тогда
			ТипЛица = "ЮЛ";
		ИначеЕсли УКД502_Заполнено(УКД502_Поле(Лицо, "ОГРНИП")) Тогда
			ТипЛица = "ИП";
		Иначе
			ТипЛица = "ФЛ";
		КонецЕсли;
	КонецЕсли;
	Запись.ЗаписатьНачалоЭлемента("ИдСв");
	Если ТипЛица = "ЮЛ" Тогда
		УКД502_Обязательное(ИНН, "СвЮЛУч.ИННЮЛ");
		Запись.ЗаписатьНачалоЭлемента("СвЮЛУч");
		Наименование = УКД502_Поле(Лицо, "НаименованиеПолное");
		УКД502_Обязательное(Наименование, "СвЮЛУч.НаимОрг");
		Запись.ЗаписатьАтрибут("НаимОрг", УКД502_Текст(Наименование));
		Запись.ЗаписатьАтрибут("ИННЮЛ", ИНН);
		УКД502_АтрибутИз(Запись, Лицо, "КПП");
		Запись.ЗаписатьКонецЭлемента();
	ИначеЕсли ТипЛица = "ИП" Тогда
		УКД502_Обязательное(ИНН, "СвИП.ИННФЛ");
		ОГРНИП = УКД502_Поле(ДопЛицо, "ОГРНИП",
			УКД502_Поле(Лицо, "ОГРНИП", УКД502_Поле(Лицо, "ОГРН")));
		ДатаОГРНИП = УКД502_Поле(ДопЛицо, "ДатаОГРНИП", УКД502_Поле(Лицо, "ДатаОГРНИП"));
		УКД502_Обязательное(ОГРНИП, "СвИП.ОГРНИП");
		УКД502_Обязательное(ДатаОГРНИП, "СвИП.ДатаОГРНИП");
		Запись.ЗаписатьНачалоЭлемента("СвИП");
		Запись.ЗаписатьАтрибут("ИННФЛ", ИНН);
		УКД502_АтрибутИз(Запись, ДопЛицо, "СвГосРегИП");
		Запись.ЗаписатьАтрибут("ОГРНИП", УКД502_Текст(ОГРНИП));
		Запись.ЗаписатьАтрибут("ДатаОГРНИП", УКД502_Дата(ДатаОГРНИП));
		УКД502_АтрибутИз(Запись, ДопЛицо, "ИныеСвед");
		УКД502_ЗаписатьФИО(Запись, УКД502_Поле(ДопЛицо, "ФИО"));
		Запись.ЗаписатьКонецЭлемента();
	ИначеЕсли ТипЛица = "ФЛ" Тогда
		Запись.ЗаписатьНачалоЭлемента("СвФЛУч");
		Если СтрДлина(ИНН) = 12 Тогда Запись.ЗаписатьАтрибут("ИННФЛ", ИНН); КонецЕсли;
		УКД502_Атрибуты(Запись, ДопЛицо, "ИдСтатЛ,ИныеСвед");
		УКД502_ЗаписатьФИО(Запись, УКД502_Поле(ДопЛицо, "ФИО"));
		Запись.ЗаписатьКонецЭлемента();
	Иначе
		ВызватьИсключение "УКД 5.02: неизвестный ТипЛица (ЮЛ/ИП/ФЛ): " + ТипЛица;
	КонецЕсли;
	Запись.ЗаписатьКонецЭлемента(); // ИдСв
КонецПроцедуры

Процедура УКД502_ЗаписатьКонтакт(Запись, Контакт)
	Если Контакт = Неопределено Тогда Возврат; КонецЕсли;
	Запись.ЗаписатьНачалоЭлемента("Контакт");
	УКД502_АтрибутИз(Запись, Контакт, "ИнКонт");
	Телефон = УКД502_Поле(Контакт, "Тлф");
	Если ТипЗнч(Телефон) = Тип("Массив") Тогда
		Для Каждого Номер Из Телефон Цикл УКД502_ЭлементТекст(Запись, "Тлф", Номер); КонецЦикла;
	Иначе
		УКД502_ЭлементТекст(Запись, "Тлф", Телефон);
	КонецЕсли;
	Почта = УКД502_Поле(Контакт, "ЭлПочта");
	Если ТипЗнч(Почта) = Тип("Массив") Тогда
		Для Каждого Адрес Из Почта Цикл УКД502_ЭлементТекст(Запись, "ЭлПочта", Адрес); КонецЦикла;
	Иначе
		УКД502_ЭлементТекст(Запись, "ЭлПочта", Почта);
	КонецЕсли;
	Запись.ЗаписатьКонецЭлемента();
КонецПроцедуры

Процедура УКД502_ЗаписатьУчастника(Запись, Имя, Лицо, Сведения, ДопЛицо, ДопГАР)
	Запись.ЗаписатьНачалоЭлемента(Имя);
	ОКПО = УКД502_Поле(ДопЛицо, "ОКПО", УКД502_Поле(Лицо, "ОКПО"));
	Если УКД502_Заполнено(ОКПО) Тогда Запись.ЗаписатьАтрибут("ОКПО", УКД502_Текст(ОКПО)); КонецЕсли;
	УКД502_Атрибуты(Запись, ДопЛицо,
		"КодОПФ,ПолнНаимОПФ,СтруктПодр,ИнфДляУчаст,СокрНаим");
	УКД502_ЗаписатьИдСв(Запись, Лицо, ДопЛицо);
	УКД502_ЗаписатьАдрес(Запись, Сведения, Лицо, ДопГАР, ДопЛицо);
	Если УКД502_Заполнено(УКД502_Поле(Сведения, "НомерСчета")) Тогда
		Запись.ЗаписатьНачалоЭлемента("БанкРекв");
		УКД502_АтрибутИз(Запись, Сведения, "НомерСчета");
		Запись.ЗаписатьНачалоЭлемента("СвБанк");
		Банк = УКД502_Поле(Сведения, "Банк");
		ИмяБанка = УКД502_Поле(Банк, "Наименование");
		УКД502_Обязательное(ИмяБанка, "СвБанк.НаимБанк");
		Запись.ЗаписатьАтрибут("НаимБанк", УКД502_Текст(ИмяБанка));
		УКД502_АтрибутИз(Запись, Сведения, "БИК");
		УКД502_АтрибутИз(Запись, Сведения, "КоррСчет", "КорСчет");
		Запись.ЗаписатьКонецЭлемента(); // СвБанк
		Запись.ЗаписатьКонецЭлемента(); // БанкРекв
	КонецЕсли;
	Контакт = УКД502_Поле(ДопЛицо, "Контакт");
	Если Контакт = Неопределено Тогда
		Телефон = УКД502_Поле(Лицо, "НомерТелефона");
		Почта = УКД502_Поле(Лицо, "ЭлектроннаяПочта");
		Если УКД502_Заполнено(Телефон) Или УКД502_Заполнено(Почта) Тогда
			Контакт = Новый Структура;
			Если УКД502_Заполнено(Телефон) Тогда Контакт.Вставить("Тлф", Телефон); КонецЕсли;
			Если УКД502_Заполнено(Почта) Тогда Контакт.Вставить("ЭлПочта", Почта); КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	УКД502_ЗаписатьКонтакт(Запись, Контакт);
	Запись.ЗаписатьКонецЭлемента();
КонецПроцедуры

// Задействуем поля адреса, которые реально возвращает ЗначенияСервера.
// Синтаксический fias_id не является доказательством актуальности адреса в ГАР.
// МуниципРайон может поступить в разобранном адресе после расширения кеша,
// но не выводится автоматически из административного area_with_type.
Функция УКД502_СобратьГАРИзАдреса(ЮрАдрес)
	ИдНом = УКД502_Поле(ЮрАдрес, "fias_id");
	МуниципРайон = УКД502_Поле(ЮрАдрес, "МуниципРайон");
	Если Не УКД502_Заполнено(ИдНом) Тогда Возврат Неопределено; КонецЕсли;
	КодРегион = УКД502_Регион(ЮрАдрес, Неопределено);
	НаимРегион = УКД502_Поле(ЮрАдрес, "region_with_type");
	Если КодРегион <> "99" И МуниципРайон = Неопределено Тогда Возврат Неопределено; КонецЕсли;
	Если СтрДлина(УКД502_Текст(ИдНом)) <> 36 Или СтрДлина(КодРегион) <> 2
		Или Не УКД502_Заполнено(НаимРегион) Тогда Возврат Неопределено; КонецЕсли;
	ГАР = Новый Структура("ИдНом,Регион,НаимРегион", ИдНом, КодРегион, НаимРегион);
	ПочтовыйИндекс = УКД502_Поле(ЮрАдрес, "postal_code");
	Если УКД502_Заполнено(ПочтовыйИндекс) Тогда ГАР.Вставить("Индекс", ПочтовыйИндекс); КонецЕсли;
	Если МуниципРайон <> Неопределено Тогда ГАР.Вставить("МуниципРайон", МуниципРайон); КонецЕсли;
	Возврат ГАР;
КонецФункции

Функция УКД502_Регион(ЮрАдрес, Лицо, ГАР = Неопределено)
	Код = УКД502_Текст(УКД502_Поле(ГАР, "Регион",
		УКД502_Поле(ЮрАдрес, "region_code", УКД502_Поле(ЮрАдрес, "КодРегион"))));
	Если Код = "" Тогда
		КЛАДРРегион = УКД502_Текст(УКД502_Поле(ЮрАдрес, "region_kladr_id"));
		Если СтрДлина(КЛАДРРегион) >= 2 Тогда Код = Лев(КЛАДРРегион, 2); КонецЕсли;
	КонецЕсли;
	Если Код = "" Тогда
		СтранаРегион = УКД502_Поле(Лицо, "Страна");
		Если УКД502_Поле(СтранаРегион, "ЭтоСтрана", Истина) = Ложь Тогда
			Код = УКД502_Текст(УКД502_Поле(СтранаРегион, "Код"));
		КонецЕсли;
	КонецЕсли;
	Если СтрДлина(Код) = 3 И Лев(Код, 1) = "0" Тогда Код = Сред(Код, 2); КонецЕсли;
	Возврат Код;
КонецФункции

Процедура УКД502_ЗаписатьВидНаим(Запись, Имя, Источник, АтрибутВида)
	Если Источник = Неопределено Тогда Возврат; КонецЕсли;
	Вид = УКД502_Поле(Источник, АтрибутВида);
	Наим = УКД502_Поле(Источник, "Наим");
	Если Не УКД502_Заполнено(Вид) Или Не УКД502_Заполнено(Наим) Тогда Возврат; КонецЕсли;
	Запись.ЗаписатьНачалоЭлемента(Имя);
	Запись.ЗаписатьАтрибут(АтрибутВида, УКД502_Текст(Вид));
	Запись.ЗаписатьАтрибут("Наим", УКД502_Текст(Наим));
	Запись.ЗаписатьКонецЭлемента();
КонецПроцедуры

Процедура УКД502_ЗаписатьНомер(Запись, Имя, Источник)
	Если Источник = Неопределено Тогда Возврат; КонецЕсли;
	Тип = УКД502_Поле(Источник, "Тип");
	Номер = УКД502_Поле(Источник, "Номер");
	Если Не УКД502_Заполнено(Тип) Или Не УКД502_Заполнено(Номер) Тогда Возврат; КонецЕсли;
	Запись.ЗаписатьНачалоЭлемента(Имя);
	Запись.ЗаписатьАтрибут("Тип", УКД502_Текст(Тип));
	Запись.ЗаписатьАтрибут("Номер", УКД502_Текст(Номер));
	Запись.ЗаписатьКонецЭлемента();
КонецПроцедуры

Процедура УКД502_ЗаписатьАдрес(Запись, Сведения, Лицо, ДопГАР, ДопЛицо)
	ЮрАдрес = УКД502_Поле(Сведения, "ЮридическийАдрес");
	ГАР = ДопГАР;
	Если ГАР = Неопределено Тогда
		ГАР = УКД502_Поле(ЮрАдрес, "ГАР", УКД502_Поле(ЮрАдрес, "АдресГАР"));
	КонецЕсли;
	Если ГАР = Неопределено И УКД502_Заполнено(УКД502_Поле(ЮрАдрес, "ИдНом")) Тогда
		ГАР = ЮрАдрес;
	КонецЕсли;
	// В разборе ЗначенияСервера есть fias_id, region_kladr_id, region_with_type.
	// По одному fias_id нельзя достоверно восстановить муниципальный уровень ГАР.
	// Поэтому автоматически он применяется только при наличии достоверного МуниципРайон.
	Если ГАР = Неопределено Тогда
		ГАР = УКД502_СобратьГАРИзАдреса(ЮрАдрес);
	КонецЕсли;
	ИдНом = УКД502_Текст(УКД502_Поле(ГАР, "ИдНом"));
	КодРегион = УКД502_Регион(ЮрАдрес, Лицо, ГАР);
	НаимРегион = УКД502_Текст(УКД502_Поле(ГАР, "НаимРегион",
		УКД502_Поле(ЮрАдрес, "region_with_type", УКД502_Поле(ЮрАдрес, "НаимРегион"))));
	// Неполные данные ГАР не заменяем фиктивными. Выбираем РФ или текст.
	МуниципРайон = УКД502_Поле(ГАР, "МуниципРайон");
	ЕстьМуницип = МуниципРайон <> Неопределено
		И УКД502_Заполнено(УКД502_Поле(МуниципРайон, "ВидКод"))
		И УКД502_Заполнено(УКД502_Поле(МуниципРайон, "Наим"));
	ЕстьГАР = СтрДлина(ИдНом) = 36 И СтрДлина(КодРегион) = 2
		И УКД502_Заполнено(НаимРегион)
		И (КодРегион = "99" Или ЕстьМуницип);
	Если ДопГАР <> Неопределено И Не ЕстьГАР Тогда
		ВызватьИсключение "УКД 5.02: передан неполный АдрГАР. Проверьте ИдНом, регион и МуниципРайон.";
	КонецЕсли;
	ЕстьРФ = СтрДлина(КодРегион) = 2 И УКД502_Заполнено(НаимРегион);
	ТекстАдреса = УКД502_Текст(УКД502_Поле(ЮрАдрес, "ИсходныйАдрес"));
	Запись.ЗаписатьНачалоЭлемента("Адрес");
	УКД502_АтрибутИз(Запись, ДопЛицо, "ГЛНМеста");
	Если ЕстьГАР Тогда
		Запись.ЗаписатьНачалоЭлемента("АдрГАР");
		Запись.ЗаписатьАтрибут("ИдНом", ИдНом);
		ПочтовыйИндекс = УКД502_Поле(ГАР, "Индекс", УКД502_Поле(ЮрАдрес, "postal_code"));
		Если УКД502_Заполнено(ПочтовыйИндекс) Тогда
			Запись.ЗаписатьАтрибут("Индекс", УКД502_Текст(ПочтовыйИндекс));
		КонецЕсли;
		Запись.ЗаписатьНачалоЭлемента("Регион");
		Запись.ЗаписатьТекст(КодРегион);
		Запись.ЗаписатьКонецЭлемента();
		УКД502_ЭлементТекст(Запись, "НаимРегион", НаимРегион);
		УКД502_ЗаписатьВидНаим(Запись, "МуниципРайон", УКД502_Поле(ГАР, "МуниципРайон"), "ВидКод");
		УКД502_ЗаписатьВидНаим(Запись, "ГородСелПоселен", УКД502_Поле(ГАР, "ГородСелПоселен"), "ВидКод");
		УКД502_ЗаписатьВидНаим(Запись, "НаселенПункт", УКД502_Поле(ГАР, "НаселенПункт"), "Вид");
		УКД502_ЗаписатьВидНаим(Запись, "ЭлПланСтруктур", УКД502_Поле(ГАР, "ЭлПланСтруктур"), "Тип");
		УКД502_ЗаписатьВидНаим(Запись, "ЭлУлДорСети", УКД502_Поле(ГАР, "ЭлУлДорСети"), "Тип");
		УКД502_ЭлементТекст(Запись, "ЗемелУчасток", УКД502_Поле(ГАР, "ЗемелУчасток"));
		Здания = УКД502_Поле(ГАР, "Здание");
		Если ТипЗнч(Здания) = Тип("Массив") Тогда
			Для Каждого Здание Из Здания Цикл
				УКД502_ЗаписатьНомер(Запись, "Здание", Здание);
			КонецЦикла;
		Иначе
			УКД502_ЗаписатьНомер(Запись, "Здание", Здания);
		КонецЕсли;
		УКД502_ЗаписатьНомер(Запись, "ПомещЗдания", УКД502_Поле(ГАР, "ПомещЗдания"));
		УКД502_ЗаписатьНомер(Запись, "ПомещКвартиры", УКД502_Поле(ГАР, "ПомещКвартиры"));
		Запись.ЗаписатьКонецЭлемента(); // АдрГАР
	ИначеЕсли ЕстьРФ Тогда
		Запись.ЗаписатьНачалоЭлемента("АдрРФ");
		УКД502_АтрибутИз(Запись, ЮрАдрес, "postal_code", "Индекс");
		Запись.ЗаписатьАтрибут("КодРегион", КодРегион);
		Запись.ЗаписатьАтрибут("НаимРегион", НаимРегион);
		УКД502_АтрибутИз(Запись, ЮрАдрес, "city_district_with_type", "Район");
		УКД502_АтрибутИз(Запись, ЮрАдрес, "city_with_type", "Город");
		УКД502_АтрибутИз(Запись, ЮрАдрес, "settlement_with_type", "НаселПункт");
		УКД502_АтрибутИз(Запись, ЮрАдрес, "street_with_type", "Улица");
		УКД502_АтрибутИз(Запись, ЮрАдрес, "house", "Дом");
		УКД502_АтрибутИз(Запись, ЮрАдрес, "block", "Корпус");
		УКД502_АтрибутИз(Запись, ЮрАдрес, "flat", "Кварт");
		УКД502_АтрибутИз(Запись, ЮрАдрес, "ИныеСвед");
		Запись.ЗаписатьКонецЭлемента(); // АдрРФ
	Иначе
		УКД502_Обязательное(ТекстАдреса, "Адрес.АдрИнф.АдрТекст");
		КодСтр = УКД502_Текст(УКД502_Поле(ДопЛицо, "КодСтр",
			УКД502_Поле(УКД502_Поле(Лицо, "Страна"), "КодОКСМ", "643")));
		НаимСтран = УКД502_Текст(УКД502_Поле(ДопЛицо, "НаимСтран"));
		Если НаимСтран = "" И КодСтр = "643" Тогда НаимСтран = "Россия"; КонецЕсли;
		Если НаимСтран = "" Тогда
			НаимСтран = УКД502_Текст(УКД502_Поле(УКД502_Поле(Лицо, "Страна"), "Наименование"));
		КонецЕсли;
		УКД502_Обязательное(НаимСтран, "Адрес.АдрИнф.НаимСтран");
		Запись.ЗаписатьНачалоЭлемента("АдрИнф");
		Запись.ЗаписатьАтрибут("КодСтр", КодСтр);
		Запись.ЗаписатьАтрибут("НаимСтран", НаимСтран);
		Запись.ЗаписатьАтрибут("АдрТекст", ТекстАдреса);
		Запись.ЗаписатьКонецЭлемента(); // АдрИнф
	КонецЕсли;
	Запись.ЗаписатьКонецЭлемента(); // Адрес
КонецПроцедуры

Процедура УКД502_ЗаписатьРеквДок(Запись, Имя, Источник)
	Для Каждого Реквизит Из СтрРазделить("РеквНаимДок,РеквНомерДок,РеквДатаДок", ",") Цикл
		УКД502_Обязательное(УКД502_Поле(Источник, Реквизит), Имя + "." + Реквизит);
	КонецЦикла;
	Запись.ЗаписатьНачалоЭлемента(Имя);
	УКД502_Атрибуты(Запись, Источник,
		"РеквНаимДок,РеквНомерДок,РеквДатаДок,РеквИдФайлДок,РеквИдДок,РИдСистХранД,РеквУРЛСистДок,РеквДопСведДок");
	Реквизиты = УКД502_Поле(Источник, "РеквИдРекСост");
	Если Реквизиты <> Неопределено Тогда
		Если ТипЗнч(Реквизиты) = Тип("Массив") Тогда
			Для Каждого Рекв Из Реквизиты Цикл УКД502_ЗаписатьИдРекСост(Запись, Рекв); КонецЦикла;
		Иначе
			УКД502_ЗаписатьИдРекСост(Запись, Реквизиты);
		КонецЕсли;
	КонецЕсли;
	Запись.ЗаписатьКонецЭлемента();
КонецПроцедуры

Процедура УКД502_ЗаписатьИдРекСост(Запись, Источник)
	Запись.ЗаписатьНачалоЭлемента("РеквИдРекСост");
	Если УКД502_Заполнено(УКД502_Поле(Источник, "ИННЮЛ")) Тогда
		УКД502_ЭлементТекст(Запись, "ИННЮЛ", УКД502_Поле(Источник, "ИННЮЛ"));
	ИначеЕсли УКД502_Заполнено(УКД502_Поле(Источник, "ИННФЛ")) Тогда
		УКД502_ЭлементТекст(Запись, "ИННФЛ", УКД502_Поле(Источник, "ИННФЛ"));
	ИначеЕсли УКД502_Поле(Источник, "ДаннИно") <> Неопределено Тогда
		Ино = УКД502_Поле(Источник, "ДаннИно");
		УКД502_ЗаписатьДаннИно(Запись, Ино);
	ИначеЕсли УКД502_Заполнено(УКД502_Поле(Источник, "НаимОИВ")) Тогда
		УКД502_ЭлементТекст(Запись, "НаимОИВ", УКД502_Поле(Источник, "НаимОИВ"));
	Иначе
		ВызватьИсключение "УКД 5.02: РеквИдРекСост требует ИННЮЛ, ИННФЛ, ДаннИно или НаимОИВ.";
	КонецЕсли;
	Запись.ЗаписатьКонецЭлемента();
КонецПроцедуры

Процедура УКД502_ЗаписатьВидОбяз(Запись, МассивВидов)
	Если МассивВидов = Неопределено Тогда Возврат; КонецЕсли;
	Если ТипЗнч(МассивВидов) = Тип("Массив") Тогда
		Для Каждого Вид Из МассивВидов Цикл
			Запись.ЗаписатьНачалоЭлемента("ВидОбяз");
			УКД502_Атрибуты(Запись, Вид, "КодВидОбяз,НаимВидОбяз");
			Запись.ЗаписатьКонецЭлемента();
		КонецЦикла;
	Иначе
		Запись.ЗаписатьНачалоЭлемента("ВидОбяз");
		УКД502_Атрибуты(Запись, МассивВидов, "КодВидОбяз,НаимВидОбяз");
		Запись.ЗаписатьКонецЭлемента();
	КонецЕсли;
КонецПроцедуры

Процедура УКД502_ЗаписатьИнфПродЗаГоскКазн(Запись, Источник)
	Если Источник = Неопределено Тогда Возврат; КонецЕсли;
	УКД502_Обязательное(УКД502_Поле(Источник, "ДатаГосКонт"), "ИнфПродЗаГоскКазн.ДатаГосКонт");
	УКД502_Обязательное(УКД502_Поле(Источник, "НомерГосКонт"), "ИнфПродЗаГоскКазн.НомерГосКонт");
	Запись.ЗаписатьНачалоЭлемента("ИнфПродЗаГоскКазн");
	УКД502_Атрибуты(Запись, Источник,
		"ДатаГосКонт,НомерГосКонт,ЛицСчетПрод,КодПродБюджКласс,КодЦелиПрод,КодКазначПрод,НаимКазначПрод");
	Запись.ЗаписатьКонецЭлемента();
КонецПроцедуры

Процедура УКД502_ЗаписатьСвДТ(Запись, Коллекция)
	Если Коллекция = Неопределено Тогда Возврат; КонецЕсли;
	Если ТипЗнч(Коллекция) <> Тип("Массив") Тогда
		ОдинЭлемент = Коллекция;
		Коллекция = Новый Массив;
		Коллекция.Добавить(ОдинЭлемент);
	КонецЕсли;
	Для Каждого ДТ Из Коллекция Цикл
		Запись.ЗаписатьНачалоЭлемента("СвДТ");
		УКД502_Атрибуты(Запись, ДТ, "КодПроисх,НомерДТДо,НомерДТПосле");
		УКД502_ЭлементТекст(Запись, "КрНаимСтрПр", УКД502_Поле(ДТ, "КрНаимСтрПр"));
		НомУв = УКД502_Поле(ДТ, "НомерДТУв");
		Если УКД502_Заполнено(НомУв) Тогда УКД502_ЭлементТекст(Запись, "НомерДТУв", НомУв); КонецЕсли;
		НомУм = УКД502_Поле(ДТ, "НомерДТУм");
		Если УКД502_Заполнено(НомУм) Тогда УКД502_ЭлементТекст(Запись, "НомерДТУм", НомУм); КонецЕсли;
		Запись.ЗаписатьКонецЭлемента();
	КонецЦикла;
КонецПроцедуры

Процедура УКД502_ЗаписатьИнфПолФХЖ2(Запись, Коллекция)
	Если Коллекция = Неопределено Тогда Возврат; КонецЕсли;
	Если ТипЗнч(Коллекция) <> Тип("Массив") Тогда
		ОдинЭлемент = Коллекция;
		Коллекция = Новый Массив;
		Коллекция.Добавить(ОдинЭлемент);
	КонецЕсли;
	Для Каждого Инфо Из Коллекция Цикл
		УКД502_Обязательное(УКД502_Поле(Инфо, "Идентиф"), "ИнфПолФХЖ2.Идентиф");
		УКД502_Обязательное(УКД502_Поле(Инфо, "Значен"), "ИнфПолФХЖ2.Значен");
		Запись.ЗаписатьНачалоЭлемента("ИнфПолФХЖ2");
		УКД502_Атрибуты(Запись, Инфо, "Идентиф,Значен");
		Запись.ЗаписатьКонецЭлемента();
	КонецЦикла;
КонецПроцедуры

Процедура УКД502_ЗаписатьСведПрослеж(Запись, Коллекция)
	Если Коллекция = Неопределено Тогда Возврат; КонецЕсли;
	Если ТипЗнч(Коллекция) <> Тип("Массив") Тогда
		ОдинЭлемент = Коллекция;
		Коллекция = Новый Массив;
		Коллекция.Добавить(ОдинЭлемент);
	КонецЕсли;
	Для Каждого Прослеж Из Коллекция Цикл
		УКД502_Обязательное(УКД502_Поле(Прослеж, "НомТовПрослеж"), "СведПрослеж.НомТовПрослеж");
		Запись.ЗаписатьНачалоЭлемента("СведПрослеж");
		УКД502_Атрибуты(Запись, Прослеж, "НомТовПрослеж,ЕдИзмПрослеж,НаимЕдИзмПрослеж,ДопИнфПрослеж");
		Кол = УКД502_Поле(Прослеж, "ИзмКолВЕдПрослеж");
		УКД502_Обязательное(Кол, "СведПрослеж.ИзмКолВЕдПрослеж");
		Если Кол <> Неопределено Тогда
			УКД502_Обязательное(УКД502_Поле(Кол, "КолТовЕдПрослежДо"), "СведПрослеж.КолТовЕдПрослежДо");
			УКД502_Обязательное(УКД502_Поле(Кол, "КолТовЕдПрослежПосле"), "СведПрослеж.КолТовЕдПрослежПосле");
			Запись.ЗаписатьНачалоЭлемента("ИзмКолВЕдПрослеж");
			УКД502_Атрибуты(Запись, Кол, "КолТовЕдПрослежДо,КолТовЕдПрослежПосле,КолТовЕдПрослежУвел,КолТовЕдПрослежУм");
			Запись.ЗаписатьКонецЭлемента();
		КонецЕсли;
		Стоимость = УКД502_Поле(Прослеж, "ИзмСтТовБезНДСПрослеж");
		УКД502_Обязательное(Стоимость, "СведПрослеж.ИзмСтТовБезНДСПрослеж");
		Если Стоимость <> Неопределено Тогда
			УКД502_Обязательное(УКД502_Поле(Стоимость, "СтТовБезНДСПрослежДо"), "СведПрослеж.СтТовБезНДСПрослежДо");
			УКД502_Обязательное(УКД502_Поле(Стоимость, "СтТовБезНДСПрослежПосле"), "СведПрослеж.СтТовБезНДСПрослежПосле");
			Запись.ЗаписатьНачалоЭлемента("ИзмСтТовБезНДСПрослеж");
			УКД502_Атрибуты(Запись, Стоимость,
				"СтТовБезНДСПрослежДо,СтТовБезНДСПрослежПосле,СтТовБезНДСПрослежУвел,СтТовБезНДСПрослежУм");
			Запись.ЗаписатьКонецЭлемента();
		КонецЕсли;
		Запись.ЗаписатьКонецЭлемента();
	КонецЦикла;
КонецПроцедуры

Процедура УКД502_ЗаписатьМаркировку(Запись, Имя, КИЗИзУчета, ДопМаркировка)
	Если (КИЗИзУчета = Неопределено Или КИЗИзУчета.Количество() = 0) И ДопМаркировка = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Запись.ЗаписатьНачалоЭлемента(Имя);
	УКД502_Атрибуты(Запись, ДопМаркировка,
		"ГТИН,КолВедМарк,КолВедВесМарк,ПрПартМарк,ИдентТрансУпак");
	Если КИЗИзУчета <> Неопределено Тогда
		Для Каждого Марка Из КИЗИзУчета Цикл
			КИЗ = УКД502_Текст(УКД502_Поле(Марка, "КИЗ"));
			Если СтрДлина(КИЗ) > 255 Тогда
				ВызватьИсключение "УКД 5.02: длина КИЗ превышает 255 символов.";
			КонецЕсли;
			УКД502_ЭлементТекст(Запись, "КИЗ", КИЗ);
		КонецЦикла;
	КонецЕсли;
	Упаковки = УКД502_Поле(ДопМаркировка, "НомУпак");
	Если ТипЗнч(Упаковки) = Тип("Массив") Тогда
		Для Каждого Номер Из Упаковки Цикл УКД502_ЭлементТекст(Запись, "НомУпак", Номер); КонецЦикла;
	Иначе
		УКД502_ЭлементТекст(Запись, "НомУпак", Упаковки);
	КонецЕсли;
	Запись.ЗаписатьКонецЭлемента();
КонецПроцедуры

Процедура УКД502_ЗаписатьСвГосСист(Запись, Коллекция)
	Если Коллекция = Неопределено Тогда Возврат; КонецЕсли;
	Если ТипЗнч(Коллекция) <> Тип("Массив") Тогда
		ОдинЭлемент = Коллекция;
		Коллекция = Новый Массив;
		Коллекция.Добавить(ОдинЭлемент);
	КонецЕсли;
	Для Каждого ГосСист Из Коллекция Цикл
		УКД502_Обязательное(УКД502_Поле(ГосСист, "НаимГосСист"), "СвГосСист.НаимГосСист");
		УКД502_Обязательное(УКД502_Поле(ГосСист, "ИдНомУчетЕд"), "СвГосСист.ИдНомУчетЕд");
		Запись.ЗаписатьНачалоЭлемента("СвГосСист");
		УКД502_Атрибуты(Запись, ГосСист, "НаимГосСист,УчетЕд,ИнаяИнф");
		УКД502_ЭлементТекст(Запись, "ИдНомУчетЕд", УКД502_Поле(ГосСист, "ИдНомУчетЕд"));
		Запись.ЗаписатьКонецЭлемента();
	КонецЦикла;
КонецПроцедуры

Процедура УКД502_ЗаписатьПодписанта(Запись, Данные)
	Если Данные = Неопределено Тогда
		ВызватьИсключение "УКД 5.02: передайте реального Подписанта (ФИО, СпосПодтПолном) в ДопДанные502.";
	КонецЕсли;
	УКД502_Обязательное(УКД502_Поле(Данные, "СпосПодтПолном"), "Подписант.СпосПодтПолном");
	Запись.ЗаписатьНачалоЭлемента("Подписант");
	УКД502_Атрибуты(Запись, Данные,
		"Должн,ТипПодпис,ДатаПодДок,СпосПодтПолном,ДопСведПодп");
	УКД502_ЗаписатьФИО(Запись, УКД502_Поле(Данные, "ФИО", Данные));
	ДоверЭл = УКД502_Поле(Данные, "СвДоверЭл");
	ДоверБум = УКД502_Поле(Данные, "СвДоверБум");
	Способ = УКД502_Текст(УКД502_Поле(Данные, "СпосПодтПолном"));
	Если Способ = "3" И ДоверЭл = Неопределено Тогда
		ВызватьИсключение "УКД 5.02: при СпосПодтПолном=3 обязательна СвДоверЭл.";
	КонецЕсли;
	Если Способ = "5" И ДоверБум = Неопределено Тогда
		ВызватьИсключение "УКД 5.02: при СпосПодтПолном=5 обязательна СвДоверБум.";
	КонецЕсли;
	Если Способ <> "3" И ДоверЭл <> Неопределено Тогда
		ВызватьИсключение "УКД 5.02: СвДоверЭл допускается только при СпосПодтПолном=3.";
	КонецЕсли;
	Если Способ <> "5" И ДоверБум <> Неопределено Тогда
		ВызватьИсключение "УКД 5.02: СвДоверБум допускается только при СпосПодтПолном=5.";
	КонецЕсли;
	Если ДоверЭл <> Неопределено И ДоверБум <> Неопределено Тогда
		ВызватьИсключение "УКД 5.02: СвДоверЭл и СвДоверБум взаимоисключающие в одном Подписант.";
	КонецЕсли;
	Если ДоверЭл <> Неопределено Тогда
		УКД502_Обязательное(УКД502_Поле(ДоверЭл, "НомДовер"), "СвДоверЭл.НомДовер");
		УКД502_Обязательное(УКД502_Поле(ДоверЭл, "ДатаВыдДовер"), "СвДоверЭл.ДатаВыдДовер");
		УКД502_Обязательное(УКД502_Поле(ДоверЭл, "ИдСистХран"), "СвДоверЭл.ИдСистХран");
		Запись.ЗаписатьНачалоЭлемента("СвДоверЭл");
		УКД502_Атрибуты(Запись, ДоверЭл,
			"НомДовер,ДатаВыдДовер,ВнНомДовер,ДатаВнРегДовер,ИдСистХран,УРЛСист");
		Запись.ЗаписатьКонецЭлемента();
	КонецЕсли;
	Если ДоверБум <> Неопределено Тогда
		УКД502_Обязательное(УКД502_Поле(ДоверБум, "ДатаВыдДовер"), "СвДоверБум.ДатаВыдДовер");
		УКД502_Обязательное(УКД502_Поле(ДоверБум, "ВнНомДовер"), "СвДоверБум.ВнНомДовер");
		Запись.ЗаписатьНачалоЭлемента("СвДоверБум");
		УКД502_Атрибуты(Запись, ДоверБум, "ДатаВыдДовер,ВнНомДовер,СвИдДовер");
		Если УКД502_Поле(ДоверБум, "ФИО") <> Неопределено Тогда
			УКД502_ЗаписатьФИО(Запись, УКД502_Поле(ДоверБум, "ФИО"));
		КонецЕсли;
		Запись.ЗаписатьКонецЭлемента();
	КонецЕсли;
	Запись.ЗаписатьКонецЭлемента();
КонецПроцедуры

Процедура УКД502_ЗаписатьДаннИно(Запись, Данные)
	Для Каждого Атрибут Из СтрРазделить("ИдСтат,КодСтр,НаимСтран,Наим", ",") Цикл
		УКД502_Обязательное(УКД502_Поле(Данные, Атрибут), "ДаннИно." + Атрибут);
	КонецЦикла;
	Запись.ЗаписатьНачалоЭлемента("ДаннИно");
	УКД502_Атрибуты(Запись, Данные, "ИдСтат,КодСтр,НаимСтран,Наим,Идентиф,ИныеСвед");
	Запись.ЗаписатьКонецЭлемента();
КонецПроцедуры

Процедура УКД502_ЗаписатьИнфПолФХЖ1(Запись, Данные)
	Запись.ЗаписатьНачалоЭлемента("ИнфПолФХЖ1");
	УКД502_АтрибутИз(Запись, Данные, "ИдФайлИнфПол");
	Коллекция = УКД502_Поле(Данные, "ТекстИнф");
	Если Коллекция <> Неопределено Тогда
		Если ТипЗнч(Коллекция) <> Тип("Массив") Тогда
			Один = Коллекция;
			Коллекция = Новый Массив;
			Коллекция.Добавить(Один);
		КонецЕсли;
		Для Каждого Инфо Из Коллекция Цикл
			УКД502_Обязательное(УКД502_Поле(Инфо, "Идентиф"), "ИнфПолФХЖ1.ТекстИнф.Идентиф");
			УКД502_Обязательное(УКД502_Поле(Инфо, "Значен"), "ИнфПолФХЖ1.ТекстИнф.Значен");
			Запись.ЗаписатьНачалоЭлемента("ТекстИнф");
			УКД502_Атрибуты(Запись, Инфо, "Идентиф,Значен");
			Запись.ЗаписатьКонецЭлемента();
		КонецЦикла;
	КонецЕсли;
	Запись.ЗаписатьКонецЭлемента();
КонецПроцедуры

&НаСервере
Функция ВыгружатьАдресаКакИностранные(Организация,Контрагент)
	Ответ =  Ложь;
	
	Если ТипЗнч(Контрагент)=Тип("СправочникСсылка.Контрагенты") тогда
		Запрос = Новый Запрос;Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЭДООтношения.ВыгружатьАдресаКакИностранные КАК ВыгружатьАдресаКакИностранные
		|ИЗ
		|	РегистрСведений.ЭДООтношения КАК ЭДООтношения
		|ГДЕ
		|	ЭДООтношения.Сторона2.ИНН = &ИНН
		|	И ЭДООтношения.Партнерство = ИСТИНА";
		
		Запрос.УстановитьПараметр("ИНН", Контрагент.ИНН);
		Запрос.УстановитьПараметр("Организация", Организация);
		
		РезультатЗапроса = Запрос.Выполнить();
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			Ответ = Ответ или ВыборкаДетальныеЗаписи.ВыгружатьАдресаКакИностранные;	
		КонецЦикла;
	КонецЕсли;
	Возврат Ответ;
КонецФункции 

&НаСервере
Функция ВыгружатьАдресаКакИностранныеНеПартнер(Организация,Контрагент)
	Ответ =  Ложь;
	
	Если ТипЗнч(Контрагент)=Тип("СправочникСсылка.Контрагенты") тогда
		Запрос = Новый Запрос;Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЭДООтношения.ВыгружатьАдресаКакИностранные КАК ВыгружатьАдресаКакИностранные
		|ИЗ
		|	РегистрСведений.ЭДООтношения КАК ЭДООтношения
		|ГДЕ
		|	ЭДООтношения.Сторона2.ИНН = &ИНН";
		
		Запрос.УстановитьПараметр("ИНН", Контрагент.ИНН);
		Запрос.УстановитьПараметр("Организация", Организация);
		
		РезультатЗапроса = Запрос.Выполнить();
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			Ответ = Ответ или ВыборкаДетальныеЗаписи.ВыгружатьАдресаКакИностранные;	
		КонецЦикла;
	КонецЕсли;
	Возврат Ответ;
КонецФункции

&НаСервере
Функция ЧЗВыбытие_СформироватьXML(ДокВыгрузки) Экспорт
    //Данные для заполнения
	ПервичныйДокумент = ДокВыгрузки.Основание;
    НаименованиеДокумента = ПервичныйДокумент.Метаданные().Имя;	
	
	Если НаименованиеДокумента = "РеализацияТоваров" Тогда
		ИНН = ПервичныйДокумент.Организация.ИНН;
		Причина = "реализации товаров в государства-члены ЕАЭС";
    ИначеЕсли  НаименованиеДокумента = "ПеремещениеТоваровВПроизводство" Тогда
    	ИНН = ПервичныйДокумент.ДокументОснование.Организация.ИНН;
		Причина = "использования для собственных нужд предприятия (в том числе отпуск в производство)";  
	ИначеЕсли  НаименованиеДокумента = "СписаниеТоваров" Тогда
	    ИНН = ПервичныйДокумент.Организация.ИНН;
		Причина = "утрата товаров";
	КонецЕсли;
	
	ДатаДляИндифик = ПервичныйДокумент.Дата;
	ДатаДокумента = Строка(Формат(ДатаДляИндифик,"ДФ=yyyy-MM-dd"));
	НомерДокумента = ПервичныйДокумент.Номер;
		 
	ЗаписьXML = Новый ЗаписьXML; 
    ЗаписьXML.УстановитьСтроку("UTF-8");
	ЗаписьXML.ЗаписатьОбъявлениеXML();
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("withdrawal");  
  	ЗаписьXML.ЗаписатьАтрибут("version","8"); 
   
    ЗаписьXML.ЗаписатьНачалоЭлемента("trade_participant_inn");
	ЗаписьXML.ЗаписатьТекст(ИНН);
	ЗаписьXML.ЗаписатьКонецЭлемента();
		
	ЗаписьXML.ЗаписатьНачалоЭлемента("withdrawal_type");
	ЗаписьXML.ЗаписатьТекст("OTHER");
	ЗаписьXML.ЗаписатьКонецЭлемента();
		
	ЗаписьXML.ЗаписатьНачалоЭлемента("withdrawal_type_other");
	ЗаписьXML.ЗаписатьТекст(Причина);
	ЗаписьXML.ЗаписатьКонецЭлемента();
		
	ЗаписьXML.ЗаписатьНачалоЭлемента("withdrawal_date");
	ЗаписьXML.ЗаписатьТекст(ДатаДокумента);
	ЗаписьXML.ЗаписатьКонецЭлемента();
		
	ЗаписьXML.ЗаписатьНачалоЭлемента("primary_document_type");
	ЗаписьXML.ЗаписатьТекст("OTHER");
	ЗаписьXML.ЗаписатьКонецЭлемента();
		
	ЗаписьXML.ЗаписатьНачалоЭлемента("primary_document_number");
	ЗаписьXML.ЗаписатьТекст(НомерДокумента);
	ЗаписьXML.ЗаписатьКонецЭлемента();
		
	ЗаписьXML.ЗаписатьНачалоЭлемента("primary_document_date");
	ЗаписьXML.ЗаписатьТекст(ДатаДокумента);
	ЗаписьXML.ЗаписатьКонецЭлемента();
		
	ЗаписьXML.ЗаписатьНачалоЭлемента("primary_document_custom_name");
	ЗаписьXML.ЗаписатьТекст(НаименованиеДокумента);
	ЗаписьXML.ЗаписатьКонецЭлемента();
		
	ЗаписьXML.ЗаписатьНачалоЭлемента("products_list");
	Для Каждого стрТовар из ДокВыгрузки.Товары цикл
	    ЗаписьXML.ЗаписатьНачалоЭлемента("product");
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("cis");
		//ЗаписьXML.ЗаписатьСекциюCDATA(Лев(стрТовар.КИЗ,31));
		ЗаписьXML.ЗаписатьТекст(Лев(стрТовар.КИЗ,31));
		//ЗаписьXML.ЗаписатьБезОбработки(Лев(стрТовар.КИЗ,31));
	    ЗаписьXML.ЗаписатьКонецЭлемента();
		
		ЗаписьXML.ЗаписатьКонецЭлемента();
	КонецЦикла;	
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	Возврат ЗаписьXML.Закрыть();
КонецФункции  

#Область Выгрузка_в_ГИСМТ_по_API
&НаСервере
Функция ЧЗВыбытие_СформироватьJSON_ПоТоварнойГруппе(ДокВыгрузки, ТоварнаяГруппа = "tires") Экспорт 
	//Выгружает документ "Честный знак: Расход" в json для конкретной товарной группы 	
	//см. описание https://docs.crpt.ru/gismt/True_API/#_%D0%B2%D1%8B%D0%B2%D0%BE%D0%B4_%D0%B8%D0%B7_%D0%BE%D0%B1%D0%BE%D1%80%D0%BE%D1%82%D0%B0
	
	//Возвращает json:
	//{
	//"inn": "7701234567",
	//"action": "OTHER",
	//"action_other": "использования для собственных нужд предприятия (в том числе отпуск в производство)",
	//"action_date": "2026-05-28",
	//"document_type": "OTHER",
	//"document_number": "000012345",
	//"document_date": "2026-05-28",
	//"primary_document_custom_name": "ПеремещениеТоваровВПроизводство",
	//"products": [{ "cis": "0104650117240408211dmfcZNcM" }, { "cis": "0104650117240408212dmfcZNcM"}]
	//}
	
	//см.описание товарных групп:	https://docs.crpt.ru/gismt/True_API/#_%D1%81%D0%BF%D1%80%D0%B0%D0%B2%D0%BE%D1%87%D0%BD%D0%B8%D0%BA_%D1%81%D0%BF%D0%B8%D1%81%D0%BE%D0%BA_%D0%BF%D0%BE%D0%B4%D0%B4%D0%B5%D1%80%D0%B6%D0%B8%D0%B2%D0%B0%D0%B5%D0%BC%D1%8B%D1%85_%D1%82%D0%BE%D0%B2%D0%B0%D1%80%D0%BD%D1%8B%D1%85_%D0%B3%D1%80%D1%83%D0%BF%D0%BF
	
	ПервичныйДокумент = ДокВыгрузки.Основание;
	НаименованиеДокумента = ПервичныйДокумент.Метаданные().Имя;
	
	Если НаименованиеДокумента = "РеализацияТоваров" Тогда
		ИНН = ПервичныйДокумент.Организация.ИНН;
		Причина = "реализации товаров в государства-члены ЕАЭС";
	ИначеЕсли НаименованиеДокумента = "ПеремещениеТоваровВПроизводство" Тогда
		ИНН = ПервичныйДокумент.ДокументОснование.Организация.ИНН;
		Причина = "использования для собственных нужд предприятия (в том числе отпуск в производство)";
	ИначеЕсли НаименованиеДокумента = "СписаниеТоваров" Тогда
		ИНН = ПервичныйДокумент.Организация.ИНН;
		Причина = "утрата товаров";       
	КонецЕсли;
	
	ДатаДокумента = Формат(ПервичныйДокумент.Дата, "ДФ=yyyy-MM-dd");
	
	МассивТоваров = Новый Массив;
	Для Каждого i Из ДокВыгрузки.Товары Цикл
		ЕстьСовпадение = Ложь;
		
		Если НЕ ЗначениеЗаполнено(i.КИЗ) Тогда
			Продолжить;
		КонецЕсли;
		
		Доступно = ТоварнаяГруппа = "tires" И i.Номенклатура.ВидМаркированнойПродукции = Перечисления.ВидыМаркированнойПродукции.Шины;
		Если Доступно Тогда
			ЕстьСовпадение = Истина;
		КонецЕсли;  
		
		Доступно = НЕ ЕстьСовпадение И ТоварнаяГруппа = "autofluids" И (i.Номенклатура.ВидМаркированнойПродукции = Перечисления.ВидыМаркированнойПродукции.Масла ИЛИ i.Номенклатура.ВидМаркированнойПродукции = Перечисления.ВидыМаркированнойПродукции.Антифризы);
		Если Доступно Тогда
			ЕстьСовпадение = Истина;
		КонецЕсли;  
		
		Доступно = НЕ ЕстьСовпадение И ТоварнаяГруппа = "perfumery" И i.Номенклатура.ВидМаркированнойПродукции = Перечисления.ВидыМаркированнойПродукции.ПарфюмерныеИКосметическиеСредстваИБытоваяХимия;
		Если Доступно Тогда
			ЕстьСовпадение = Истина;
		КонецЕсли;  
		
		Доступно =  НЕ ЕстьСовпадение И ТоварнаяГруппа = "carparts" И i.Номенклатура.ВидМаркированнойПродукции = Перечисления.ВидыМаркированнойПродукции.Автозапчасти;
		Если Доступно Тогда
			ЕстьСовпадение = Истина;
		КонецЕсли;    
		
		Если Не ЕстьСовпадение Тогда
			Продолжить;
		КонецЕсли;
		
		СтрКИ = Новый Структура;
		Если i.Номенклатура.ВидМаркированнойПродукции = Перечисления.ВидыМаркированнойПродукции.ПарфюмерныеИКосметическиеСредстваИБытоваяХимия Тогда
			СтрКИ.Вставить("cis", Лев(i.КИЗ, 24));
		Иначе
			СтрКИ.Вставить("cis", Лев(i.КИЗ, 31));
		КонецЕсли;
		МассивТоваров.Добавить(СтрКИ);		
	КонецЦикла;
	
	Если МассивТоваров.Количество() = 0 Тогда
		Возврат "";
	КонецЕсли;
	
	// Тело документа LK_RECEIPT (True API, формат MANUAL)
	ДокументJSON = Новый Структура;    
	//ДокументJSON.Вставить("type","LK_RECEIPT"); - ошибка
	ДокументJSON.Вставить("inn", СокрЛП(ИНН));
	ДокументJSON.Вставить("action", "OTHER");
	ДокументJSON.Вставить("action_other", Причина);
	ДокументJSON.Вставить("action_date", ДатаДокумента);
	ДокументJSON.Вставить("document_type", "OTHER");
	ДокументJSON.Вставить("document_number", СокрЛП(ПервичныйДокумент.Номер));
	ДокументJSON.Вставить("document_date", ДатаДокумента);
	ДокументJSON.Вставить("primary_document_custom_name", НаименованиеДокумента);
	ДокументJSON.Вставить("products", МассивТоваров);
	
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку(Новый ПараметрыЗаписиJSON(, Символы.Таб));
	ЗаписатьJSON(ЗаписьJSON, ДокументJSON);
	
	Возврат ЗаписьJSON.Закрыть();	
КонецФункции

&НаСервере
Функция ЧЗВыбытие_Выгрузка_в_ГИСМТ_ПоТоварнойГруппе(ГИСМТToken, ТоварнаяГруппа, jsonВыбытие) Экспорт 
	//HTTP - запрос в ГИСМТ (crpt.ru) на выгрузку документа выбытия товаров
	// см. https://docs.crpt.ru/gismt/True_API/#_%D0%B2%D1%8B%D0%B2%D0%BE%D0%B4_%D0%B8%D0%B7_%D0%BE%D0%B1%D0%BE%D1%80%D0%BE%D1%82%D0%B0
	
	Доступно =  ТипЗнч(ГИСМТToken) = Тип("Строка") 
		И ТипЗнч(jsonВыбытие) = Тип("Строка")
		И ЗначениеЗаполнено(ГИСМТToken)
		И ЗначениеЗаполнено(jsonВыбытие);
	Если Не Доступно Тогда
		Возврат "ошибка: неверные параметры";				
	КонецЕсли;	
		
	кмд = СтрШаблон("curl --request POST 'https://markirovka.crpt.ru/api/v3/true-api/lk/documents/create?pg=%1' -H 'Authorization: Bearer %2' -H 'Content-Type: application/json; charset=UTF-8' -H 'Accept: application/json' -d '%3'", ТоварнаяГруппа, ГИСМТToken, jsonВыбытие);
	Ответ = Авито.CURL(кмд); 
	Если ТипЗнч(Ответ)= Тип("Строка") Тогда
		Возврат Ответ;
	КонецЕсли;
	
	Возврат Ответ.КодСостояния();	
КонецФункции

&НаСервере
Функция ЧЗВыбытие_Выгрузка_в_ГИСМТ(ДокЧЗВыбытие, ГИСМТToken) Экспорт 
	
	Ответы = Новый Массив();
	
	ТоварныеГруппы = СтрРазделить("tires,autofluids,perfumery,carparts", ",");
	
	Для Каждого ТоварнаяГруппа Из ТоварныеГруппы Цикл
		
		jsonВыбытие = ЧЗВыбытие_СформироватьJSON_ПоТоварнойГруппе(ДокЧЗВыбытие,ТоварнаяГруппа);
		
		Если Не ЗначениеЗаполнено(jsonВыбытие) Тогда
			Продолжить;
		КонецЕсли;     
		
		Рез = ЧЗВыбытие_Выгрузка_в_ГИСМТ_ПоТоварнойГруппе(ГИСМТToken, ТоварнаяГруппа, jsonВыбытие);
		Если ТипЗнч(Рез) = Тип("Строка") Тогда
			Ответы.Добавить(Рез);
		КонецЕсли;
	КонецЦикла;     
	Возврат Ответы
КонецФункции
#КонецОбласти

&НаСервере
Функция Реализация_СформироватьXML_СЧФ503АктСвод(ДокВыгрузки) Экспорт
	ИдОтпр = "2BK-0000000000-0000000";
	ИдПол = "2BK-0000000000-0000000000000";  
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПрослеживаемыеТовары.Номенклатура КАК Номенклатура,
	|	ПрослеживаемыеТовары.РНПТ КАК РНПТ,
	|	ПрослеживаемыеТовары.Количество КАК Количество,
	|	ПрослеживаемыеТовары.КоличествоПрослеживаемости КАК КоличествоПрослеживаемости,
	|	ПрослеживаемыеТовары.СтранаПроисхождения КАК СтранаПроисхождения
	|ИЗ
	|	РегистрНакопления.ПрослеживаемыеТовары КАК ПрослеживаемыеТовары
	|ГДЕ
	|	ПрослеживаемыеТовары.Регистратор = &Регистратор";
	
	Запрос.УстановитьПараметр("Регистратор", ДокВыгрузки);
	СведенияОПрослеживаемости = Запрос.Выполнить().Выгрузить();
	
	Если СведенияОПрослеживаемости.Количество() > 0 тогда 
		ВыводитьРНПТ = Истина;
	Иначе
		ВыводитьРНПТ = Ложь;	
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗначенияСвойствКонтрагентов.Значение КАК Значение
	|ИЗ
	|	РегистрСведений.ЗначенияСвойствКонтрагентов КАК ЗначенияСвойствКонтрагентов
	|ГДЕ
	|	ЗначенияСвойствКонтрагентов.Контрагент = &Контрагент
	|	И ЗначенияСвойствКонтрагентов.Свойство = &Свойство";
	
	Запрос.УстановитьПараметр("Контрагент", ДокВыгрузки.Контрагент); 
	Запрос.УстановитьПараметр("Свойство", Справочники.ЗначенияСвойствОбъектов.ГрузотправительПрочерк); 
	СвойствоПрочерк = Запрос.Выполнить().Выгрузить();
	
	Если СвойствоПрочерк.Количество() > 0 тогда 
		ВыводитьПрочерк = Ложь;
	Иначе
		ВыводитьПрочерк = Ложь;	
	КонецЕсли;
	
	
	
	
	
	Если (ДокВыгрузки.Контрагент.ТипКонтрагента=Перечисления.ТипКонтрагента.Ип) ИЛИ (ДокВыгрузки.Контрагент.ТипКонтрагента=Перечисления.ТипКонтрагента.Фл ) Тогда
		КонтрИП = Истина;
	КонецЕсли;
	
	Если ТипЗнч(ДокВыгрузки) = Тип("ДокументСсылка.ЗаказНаряд") Тогда 
		ДатаУПД = ДокВыгрузки.ДатаЗакрытия;
	Иначе
		ДатаУПД = ДокВыгрузки.Дата;
	КонецЕсли;
	
	
	
	ОргИП = Ложь;
	БанковскийСчетКонтрагента = ДокВыгрузки.Контрагент.РасчСчет;
	БанковскийСчетФирмы = ДокВыгрузки.Организация.РасчСчет;
	СведенияОПоставщике = ЗначенияСервера.СведенияОЮрФизЛице(ДокВыгрузки.Организация, ДатаУПД);
	СведенияОПокупателе = ЗначенияСервера.СведенияОЮРФизЛице(ДокВыгрузки.Контрагент, ДатаУПД);
	
	Если ДокВыгрузки.Метаданные().Реквизиты.Найти("Получатель")<>Неопределено И ЗначениеЗаполнено(ДокВыгрузки.Получатель) и ТипЗнч(ДокВыгрузки.Получатель) = Тип("СправочникСсылка.Контрагенты") тогда
		СведенияОГрузополучателе  = ЗначенияСервера.СведенияОЮрФизЛице(ДокВыгрузки.Получатель,  ДатаУПД);
		ПолучательПоДокументу = ДокВыгрузки.Получатель;
	Иначе
		СведенияОГрузополучателе  = СведенияОПокупателе;
		ПолучательПоДокументу = ДокВыгрузки.Контрагент;
	КонецЕсли;  
	
	СведенияОГрузоотправитель = СведенияОПоставщике;
	
	НовыйУникальныйИдентификатор = Новый УникальныйИдентификатор;
	ДатаДляИндифик = ТекущаяДата();
	Год   = Строка(Формат(ДатаДляИндифик, "ДФ=гггг")); // Год
	Месяц = Строка(Формат(ДатаДляИндифик, "ДФ=ММ"));   // Месяц
	День  = Строка(Формат(ДатаДляИндифик, "ДФ=дд"));   // День
	
	ДатаПреобразоваянная = Год + Месяц + День;
	//НомерТелефона
	
	//-------------------------------------------------------------------------------------------------------
	ЗаписьXML = Новый ЗаписьXML;
	ЗаписьXML.УстановитьСтроку();
	ЗаписьXML.ЗаписатьОбъявлениеXML();
	//Файл++
	ЗаписьXML.ЗаписатьНачалоЭлемента("Файл");
	ЗаписьXML.ЗаписатьСоответствиеПространстваИмен("xsd","http://www.w3.org/2001/XMLSchema");
	ЗаписьXML.ЗаписатьСоответствиеПространстваИмен("xsi","http://www.w3.org/2001/XMLSchema-instance");
	ЗаписьXML.ЗаписатьАтрибут("ИдФайл", "ON_NSCHFDOPPR_" + ИдПол + "_" + ИдОтпр + "_" + ДатаПреобразоваянная + "_" + НовыйУникальныйИдентификатор);	
	ЗаписьXML.ЗаписатьАтрибут("ВерсФорм", "5.03");
	ЗаписьXML.ЗаписатьАтрибут("ВерсПрог", "Диадок 1.0");
	
	
	//Документ++
	ЗаписьXML.ЗаписатьНачалоЭлемента("Документ");	
	ЗаписьXML.ЗаписатьАтрибут("КНД", "1115131"); 
	ЗаписьXML.ЗаписатьАтрибут("Функция", "СЧФ");
	ЗаписьXML.ЗаписатьАтрибут("ДатаИнфПр", Формат(ДатаУПД, "ДЛФ=Д"));
	ЗаписьXML.ЗаписатьАтрибут("ВремИнфПр", "00.00.00");
	ЗаписьXML.ЗаписатьАтрибут("НаимЭконСубСост", ДокВыгрузки.Организация.НаименованиеПолное+", ИНН/КПП "+ДокВыгрузки.Организация.ИНН+"/"+ДокВыгрузки.Организация.КПП);
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("СвСчФакт"); //СвСчФакт
	ЗаписьXML.ЗаписатьАтрибут("НомерДок", ?(ЗначениеЗаполнено(ДокВыгрузки.НомерСчф),ДокВыгрузки.НомерСчф,ДокВыгрузки.Номер));
	Если ТипЗнч(ДокВыгрузки) = Тип("ДокументСсылка.ЗаказНаряд") Тогда 
		ЗаписьXML.ЗаписатьАтрибут("ДатаДок", Формат(ДатаУПД, "ДЛФ=Д"));
	Иначе
		ЗаписьXML.ЗаписатьАтрибут("ДатаДок", Формат(ДатаУПД, "ДЛФ=Д"));
	КонецЕсли;
	
	//Продавец
	
	//<СвПрод
	ЗаписьXML.ЗаписатьНачалоЭлемента("СвПрод");
	ЗаписьXML.ЗаписатьАтрибут("ОКПО", ДокВыгрузки.Организация.ОКПО);
	//<ИдСв>
	ЗаписьXML.ЗаписатьНачалоЭлемента("ИдСв");
	ЗаписьXML.ЗаписатьНачалоЭлемента("СвЮЛУч");  
	ЗаписьXML.ЗаписатьАтрибут("НаимОрг", ДокВыгрузки.Организация.НаименованиеПолное);
	ЗаписьXML.ЗаписатьАтрибут("ИННЮЛ", ДокВыгрузки.Организация.ИНН);
	ЗаписьXML.ЗаписатьАтрибут("КПП", ДокВыгрузки.Организация.КПП);
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.ЗаписатьКонецЭлемента();
	//</ИдСв> 
	
	//<Адрес>	 
	ЗаписьXML.ЗаписатьНачалоЭлемента("Адрес"); 
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("АдрИнф");
	ЗаписьXML.ЗаписатьАтрибут("КодСтр","643"); 
	ЗаписьXML.ЗаписатьАтрибут("НаимСтран","Россия");
	ЗаписьXML.ЗаписатьАтрибут("АдрТекст", СокрЛП(СведенияОПоставщике.ЮридическийАдрес.ИсходныйАдрес));
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.ЗаписатьКонецЭлемента();
	//</Адрес>
	
	Если ЗначениеЗаполнено(СведенияОПоставщике.НомерСчета) Тогда 
		//<БанкРекв
		ЗаписьXML.ЗаписатьНачалоЭлемента("БанкРекв");
		ЗаписьXML.ЗаписатьАтрибут("НомерСчета", Строка(СведенияОПоставщике.НомерСчета)); 
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("СвБанк");
		ЗаписьXML.ЗаписатьАтрибут("НаимБанк", СведенияОПоставщике.Банк.Наименование);
		ЗаписьXML.ЗаписатьАтрибут("БИК", Строка(СведенияОПоставщике.БИК));
		ЗаписьXML.ЗаписатьАтрибут("КорСчет", Строка(СведенияОПоставщике.КоррСчет));
		ЗаписьXML.ЗаписатьКонецЭлемента();
		
		ЗаписьXML.ЗаписатьКонецЭлемента();
		//</БанкРекв>
	КонецЕсли; 	
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	//</СвПрод>
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("ДокПодтвОтгрНом");
	ЗаписьXML.ЗаписатьАтрибут("РеквНаимДок", "Акт");
	ЗаписьXML.ЗаписатьАтрибут("РеквНомерДок", СокрЛП(ДокВыгрузки.Номер));
	ЗаписьXML.ЗаписатьАтрибут("РеквДатаДок", Формат(ДатаУПД, "ДЛФ=Д"));
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	//<СвПокуп>
	ЗаписьXML.ЗаписатьНачалоЭлемента("СвПокуп");
	//<ИдСв>
	ЗаписьXML.ЗаписатьНачалоЭлемента("ИдСв");
	//<СвЮЛУч 
	ЗаписьXML.ЗаписатьНачалоЭлемента("СвЮЛУч");
	
	КПП = ДокВыгрузки.Контрагент.КПП;	//значение по умолчанию  
	ЗаписьXML.ЗаписатьАтрибут("НаимОрг", ДокВыгрузки.Контрагент.НаименованиеПолное);
	ЗаписьXML.ЗаписатьАтрибут("ИННЮЛ", ДокВыгрузки.Контрагент.ИНН); 
	ЗаписьXML.ЗаписатьАтрибут("КПП", КПП); 
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.ЗаписатьКонецЭлемента();
	//</ИдСв>
	ЗаписьXML.ЗаписатьНачалоЭлемента("Адрес");
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("АдрИнф");
	ЗаписьXML.ЗаписатьАтрибут("КодСтр", "643");
	ЗаписьXML.ЗаписатьАтрибут("НаимСтран","Россия");
	ЗаписьXML.ЗаписатьАтрибут("АдрТекст", СокрЛП(СведенияОПокупателе.ЮридическийАдрес.ИсходныйАдрес));	
	ЗаписьXML.ЗаписатьКонецЭлемента();	
	
	ЗаписьXML.ЗаписатьКонецЭлемента();        
	Если ЗначениеЗаполнено(СведенияОПокупателе.НомерСчета) Тогда  
		//<БанкРекв
		ЗаписьXML.ЗаписатьНачалоЭлемента("БанкРекв");
		ЗаписьXML.ЗаписатьАтрибут("НомерСчета", Строка(СведенияОПокупателе.НомерСчета));
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("СвБанк");
		ЗаписьXML.ЗаписатьАтрибут("НаимБанк", СведенияОПокупателе.Банк.Наименование);
		ЗаписьXML.ЗаписатьАтрибут("КорСчет", Строка(СведенияОПокупателе.КоррСчет));
		ЗаписьXML.ЗаписатьАтрибут("БИК", Строка(СведенияОПокупателе.БИК));
		ЗаписьXML.ЗаписатьКонецЭлемента();
		
		ЗаписьXML.ЗаписатьКонецЭлемента();
		//</БанкРекв>
	КонецЕсли; 	
	ЗаписьXML.ЗаписатьКонецЭлемента();
	//</СвПокуп>
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("ДенИзм");
	ЗаписьXML.ЗаписатьАтрибут("КодОКВ", "643");
	ЗаписьXML.ЗаписатьАтрибут("НаимОКВ", "Российский рубль");
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("ИнфПолФХЖ1");  
	
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("ТекстИнф");
	ЗаписьXML.ЗаписатьАтрибут("Идентиф","ИдентификаторДокументаОснования"); 
	Текст = Строка(ДокВыгрузки.УникальныйИдентификатор());
	ЗаписьXML.ЗаписатьАтрибут("Значен",Текст); 
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("ТекстИнф");
	Текст =  "Реализация";
	ЗаписьXML.ЗаписатьАтрибут("Идентиф","ВидСчетаФактуры"); 
	ЗаписьXML.ЗаписатьАтрибут("Значен",Текст);
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("ТекстИнф");
	Текст = "true";
	ЗаписьXML.ЗаписатьАтрибут("Идентиф","ТолькоУслуги"); 
	ЗаписьXML.ЗаписатьАтрибут("Значен",Текст); 
	
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("ТекстИнф");
	Текст = "№ п/п № "+ ДокВыгрузки.Номер +" от " + Формат(ДатаУПД, "ДЛФ=Д")+"г.";
	ЗаписьXML.ЗаписатьАтрибут("Идентиф","ДокументОбОтгрузке");
	ЗаписьXML.ЗаписатьАтрибут("Значен",Текст); 
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.ЗаписатьКонецЭлемента(); 		
	
	
	
	ЗаписьXML.ЗаписатьКонецЭлемента(); 
	//</СвСчФакт>  
	
	
	//Табличная часть  
	
	//------------------------------------------------------------------------------------------------------------------------------------------------------------
	ЗаписьXML.ЗаписатьНачалоЭлемента("ТаблСчФакт");
	НомерСтроки = 0;
	ИтогКолМест = 0;
	ИтогБрутто = 0;
	ИтогНетто = 0;
	ИтогСумБезНДС = 0;
	ИтогСумНДС = 0;
	ИтогСумУчНДС = 0;  
	
	
	ДанныеТоваров = Новый Массив; 
	
	УчетнаяДата = ДокВыгрузки.Дата;
	ДокДата = СокрЛП(Формат(УчетнаяДата,"ДЛФ=DD"));
	
	НаименованиеУслуги = "Оказание услуг по ремонту и обслуживанию автотранспортного средства "; 		стрТовар = Новый Структура;
	стрТовар.Вставить("Номенклатура", НаименованиеУслуги);
	стрТовар.Вставить("Количество", 1); 
	стрТовар.Вставить("Сумма", ДокВыгрузки.СуммаДокумента);
	стрТовар.Вставить("СуммаНДС", ДокВыгрузки.СуммаНДС);
	стрТовар.Вставить("СтавкаНДС", ДокВыгрузки.СтавкаНДС);
	
	ДанныеТоваров.Добавить(стрТовар);
	Для Каждого стрТовар из ДанныеТоваров цикл
		ХарактеристикаДляПоиска = "";
		НомерСтроки = НомерСтроки + 1; 
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("СведТов");
		ЗаписьXML.ЗаписатьАтрибут("НомСтр", Строка(НомерСтроки));
		СтавкаКоэффициент = ЗначенияСервера.ПреобразуемСтавкиНДС(СтрТовар.СтавкаНДС);
		
		Если ЗначениеЗаполнено(СтрТовар.Сумма) И ЗначениеЗаполнено(СтрТовар.СтавкаНДС) Тогда		
			СуммаБезНДС = СтрТовар.Сумма - СтрТовар.СуммаНДС;
			СуммаНДСдоОкругления = СтрТовар.Сумма - СуммаБезНДС;
			СуммаНДСизСуммы = Окр(СуммаНДСдоОкругления, 2);
		КонецЕсли;
		Если ЗначениеЗаполнено(СуммаБезНДС) И ЗначениеЗаполнено(СтрТовар.Количество) Тогда		
			Цена = СуммаБезНДС / СтрТовар.Количество;
		КонецЕсли;
		
		Если ТипЗнч(СтрТовар.Номенклатура)=Тип("СправочникСсылка.Номенклатура") Тогда
			ЗаписьXML.ЗаписатьАтрибут("НаимТов", СтрТовар.Номенклатура.Наименование); 
			
		Иначе
			ЗаписьXML.ЗаписатьАтрибут("НаимТов", СокрЛП(СтрТовар.Номенклатура)); 
			
		КонецЕсли;
		
		ЗаписьXML.ЗаписатьАтрибут("КолТов", Строка(СтрЗаменить(СтрТовар.Количество, Символы.НПП,"")));
		ЗаписьXML.ЗаписатьАтрибут("ЦенаТов",Строка(Формат(Цена,"ЧДЦ=2; ЧГ=0; ЧРД=.")));
		ЗаписьXML.ЗаписатьАтрибут("СтТовБезНДС", Строка(Формат(СуммаБезНДС,"ЧДЦ=2; ЧГ=0; ЧРД=.")));
		ЗаписьXML.ЗаписатьАтрибут("НалСт", СтавкаКоэффициент.Ставка); 
		ЗаписьXML.ЗаписатьАтрибут("СтТовУчНал", Строка(Формат(СтрТовар.Сумма,"ЧДЦ=2; ЧГ=0; ЧРД=.")));	    
		ЗаписьXML.ЗаписатьНачалоЭлемента("ДопСведТов");
		ЗаписьXML.ЗаписатьАтрибут("ПрТовРаб", "2"); 
		ЗаписьXML.ЗаписатьКонецЭлемента();
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("Акциз");
		ЗаписьXML.ЗаписатьНачалоЭлемента("БезАкциз");
		ЗаписьXML.ЗаписатьТекст("без акциза");
		ЗаписьXML.ЗаписатьКонецЭлемента();
		ЗаписьXML.ЗаписатьКонецЭлемента();
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("СумНал"); 
		
		Если СуммаНДСизСуммы > 0 Тогда
			ЗаписьXML.ЗаписатьНачалоЭлемента("СумНал");
			ЗаписьXML.ЗаписатьТекст(Строка(Формат(СуммаНДСизСуммы,"ЧДЦ=2; ЧГ=0; ЧРД=.")));
		ИначеЕсли СуммаНДСизСуммы = 0 Тогда		
			ЗаписьXML.ЗаписатьНачалоЭлемента("БезНДС");
			ЗаписьXML.ЗаписатьТекст("без НДС");
		КонецЕсли;
		ЗаписьXML.ЗаписатьКонецЭлемента();
		ЗаписьXML.ЗаписатьКонецЭлемента();
		ЗаписьXML.ЗаписатьКонецЭлемента();
		
		ИтогКолМест = ИтогКолМест + СтрТовар.Количество; 
		ИтогНетто = ИтогНетто + СтрТовар.Количество;
		ИтогСумБезНДС = ИтогСумБезНДС + СуммаБезНДС;
		ИтогСумНДС = ИтогСумНДС + СтрТовар.СуммаНДС;	
		ИтогСумУчНДС = ИтогСумУчНДС + СтрТовар.Сумма;
	КонецЦикла;
	
	// Конец табличной части
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("ВсегоОпл");
	ЗаписьXML.ЗаписатьАтрибут("СтТовБезНДСВсего", Строка(Формат(ИтогСумБезНДС,"ЧДЦ=2; ЧГ=0; ЧРД=.")));
	ЗаписьXML.ЗаписатьАтрибут("СтТовУчНалВсего", Строка(Формат(ИтогСумУчНДС,"ЧДЦ=2; ЧГ=0; ЧРД=.")));
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("СумНалВсего");
	ЗаписьXML.ЗаписатьНачалоЭлемента("СумНал");
	ЗаписьXML.ЗаписатьТекст(Строка(Формат(ИтогСумНДС,"ЧДЦ=2; ЧГ=0; ЧРД=.")));
	ЗаписьXML.ЗаписатьКонецЭлемента();
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.ЗаписатьКонецЭлемента();
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	//Подписант
	ЗаписьXML.ЗаписатьНачалоЭлемента("Подписант");
	ЗаписьXML.ЗаписатьАтрибут("ОблПолн", "5");
	ЗаписьXML.ЗаписатьАтрибут("Статус", "1");
	ЗаписьXML.ЗаписатьАтрибут("ОснПолн", "Должностные обязанности");
	ЗаписьXML.ЗаписатьНачалоЭлемента("ЮЛ");
	
	ПодписантОветственный = "";
	ЗаписьXML.ЗаписатьНачалоЭлемента("ФИО");
	ЗаписьXML.ЗаписатьАтрибут("Фамилия", "-");
	ЗаписьXML.ЗаписатьАтрибут("Имя", "-");
	
	ЗаписьXML.ЗаписатьКонецЭлемента();
	ЗаписьXML.ЗаписатьКонецЭлемента();
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.ЗаписатьКонецЭлемента();
	ЗаписьXML.ЗаписатьКонецЭлемента(); 
	
	Возврат ЗаписьXML.Закрыть();
КонецФункции 

&НаСервере
Функция ЗН_СформироватьXML_Айтеко(ДокВыгрузки) Экспорт
	ИдОтпр = "2BK-0000000000-0000000";
	ИдПол = "2BK-0000000000-0000000000000";  
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ПрослеживаемыеТовары.Номенклатура КАК Номенклатура,
	               |	ПрослеживаемыеТовары.РНПТ КАК РНПТ,
	               |	ПрослеживаемыеТовары.Количество КАК Количество,
	               |	ПрослеживаемыеТовары.КоличествоПрослеживаемости КАК КоличествоПрослеживаемости,
	               |	ПрослеживаемыеТовары.СтранаПроисхождения КАК СтранаПроисхождения
	               |ИЗ
	               |	РегистрНакопления.ПрослеживаемыеТовары КАК ПрослеживаемыеТовары
	               |ГДЕ
	               |	ПрослеживаемыеТовары.Регистратор = &Регистратор";	
	Запрос.УстановитьПараметр("Регистратор", ДокВыгрузки);
	СведенияОПрослеживаемости = Запрос.Выполнить().Выгрузить();
	Если СведенияОПрослеживаемости.Количество() > 0 тогда 
		ВыводитьРНПТ = Истина;
	Иначе
		ВыводитьРНПТ = Ложь;	
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЗначенияСвойствКонтрагентов.Значение КАК Значение
	               |ИЗ
	               |	РегистрСведений.ЗначенияСвойствКонтрагентов КАК ЗначенияСвойствКонтрагентов
	               |ГДЕ
	               |	ЗначенияСвойствКонтрагентов.Контрагент = &Контрагент
	               |	И ЗначенияСвойствКонтрагентов.Свойство = &Свойство";	
	Запрос.УстановитьПараметр("Контрагент", ДокВыгрузки.Контрагент); 
	Запрос.УстановитьПараметр("Свойство", Справочники.ЗначенияСвойствОбъектов.ГрузотправительПрочерк); 
	СвойствоПрочерк = Запрос.Выполнить().Выгрузить();
	Если СвойствоПрочерк.Количество() > 0 тогда 
		ВыводитьПрочерк = Истина;
	Иначе
		ВыводитьПрочерк = Ложь;	
	КонецЕсли;
	
	Если (ДокВыгрузки.Контрагент.ТипКонтрагента=Перечисления.ТипКонтрагента.Ип) ИЛИ (ДокВыгрузки.Контрагент.ТипКонтрагента=Перечисления.ТипКонтрагента.Фл ) Тогда
		КонтрИП = Истина;
	КонецЕсли;
	
	ДатаУПД = ДокВыгрузки.ДатаЗакрытия;
	НомУПД = ?(ЗначениеЗаполнено(ДокВыгрузки.НомерСчф), ДокВыгрузки.НомерСчф, ДокВыгрузки.Номер);	
	
	ОргИП = Ложь;
	БанковскийСчетКонтрагента = ДокВыгрузки.Контрагент.РасчСчет;
	БанковскийСчетФирмы = ДокВыгрузки.Организация.РасчСчет;
	СведенияОПоставщике = ЗначенияСервера.СведенияОЮрФизЛице(ДокВыгрузки.Организация, ДатаУПД);
	СведенияОПокупателе = ЗначенияСервера.СведенияОЮРФизЛице(ДокВыгрузки.Контрагент, ДатаУПД);
	
	Если ДокВыгрузки.Метаданные().Реквизиты.Найти("Получатель") <> Неопределено
		И ЗначениеЗаполнено(ДокВыгрузки.Получатель)
		И ТипЗнч(ДокВыгрузки.Получатель) = Тип("СправочникСсылка.Контрагенты") Тогда
		СведенияОГрузополучателе  = ЗначенияСервера.СведенияОЮрФизЛице(ДокВыгрузки.Получатель,  ДатаУПД);
		ПолучательПоДокументу = ДокВыгрузки.Получатель;
	Иначе
		СведенияОГрузополучателе  = СведенияОПокупателе;
		ПолучательПоДокументу = ДокВыгрузки.Контрагент;
	КонецЕсли;  
	
	СведенияОГрузоотправитель = СведенияОПоставщике;
	
	НовыйУникальныйИдентификатор = Новый УникальныйИдентификатор;
	ДатаДляИндифик = ТекущаяДата();
	Год   = Строка(Формат(ДатаДляИндифик, "ДФ=гггг")); // Год
	Месяц = Строка(Формат(ДатаДляИндифик, "ДФ=ММ"));   // Месяц
	День  = Строка(Формат(ДатаДляИндифик, "ДФ=дд"));   // День
	
	ДатаПреобразоваянная = Год + Месяц + День;
	
	ЗаписьXML = Новый ЗаписьXML;
	
	ЗаписьXML.УстановитьСтроку();
	ЗаписьXML.ЗаписатьОбъявлениеXML();
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("Файл");
	ЗаписьXML.ЗаписатьСоответствиеПространстваИмен("xsd","http://www.w3.org/2001/XMLSchema");
	ЗаписьXML.ЗаписатьСоответствиеПространстваИмен("xsi","http://www.w3.org/2001/XMLSchema-instance");
	
	ЗаписьXML.ЗаписатьАтрибут("ИдФайл", "ON_NSCHFDOPPR_" + ИдПол + "_" + ИдОтпр + "_" + ДатаПреобразоваянная + "_" + НовыйУникальныйИдентификатор);	
	ЗаписьXML.ЗаписатьАтрибут("ВерсФорм", "5.03");
	ЗаписьXML.ЗаписатьАтрибут("ВерсПрог", "Diadoc 1.0");
	ЗаписьXML.ЗаписатьНачалоЭлемента("Документ");	
	ЗаписьXML.ЗаписатьАтрибут("КНД", "1115131"); 	
	ЗаписьXML.ЗаписатьАтрибут("ПоФактХЖ", "Документ об отгрузке товаров (выполнении работ), передаче имущественных прав (документ об оказании услуг)");
	ЗаписьXML.ЗаписатьАтрибут("НаимДокОпр", "УПД");
	ЗаписьXML.ЗаписатьАтрибут("ДатаИнфПр", Формат(ДатаУПД, "ДЛФ=Д"));
	ЗаписьXML.ЗаписатьАтрибут("ВремИнфПр", "00.00.00");
	ЗаписьXML.ЗаписатьАтрибут("НаимЭконСубСост", ДокВыгрузки.Организация.НаименованиеПолное);
	ЗаписьXML.ЗаписатьАтрибут("Функция", "СЧФДОП");
	ЗаписьXML.ЗаписатьНачалоЭлемента("СвСчФакт");
	ЗаписьXML.ЗаписатьАтрибут("НомерДок", НомУПД);
	Если ТипЗнч(ДокВыгрузки) = Тип("ДокументСсылка.ЗаказНаряд") Тогда 
		ЗаписьXML.ЗаписатьАтрибут("ДатаДок", Формат(ДатаУПД, "ДЛФ=Д"));
	Иначе
		ЗаписьXML.ЗаписатьАтрибут("ДатаДок", Формат(ДатаУПД, "ДЛФ=Д"));		
	КонецЕсли;
		
	//Продавец
	ЗаписьXML.ЗаписатьНачалоЭлемента("СвПрод");
	ЗаписьXML.ЗаписатьНачалоЭлемента("ИдСв");
	ЗаписьXML.ЗаписатьНачалоЭлемента("СвЮЛУч");  
	ЗаписьXML.ЗаписатьАтрибут("КПП", ДокВыгрузки.Организация.КПП);
	ЗаписьXML.ЗаписатьАтрибут("НаимОрг", ДокВыгрузки.Организация.НаименованиеПолное);
	ЗаписьXML.ЗаписатьАтрибут("ИННЮЛ", ДокВыгрузки.Организация.ИНН);
	ЗаписьXML.ЗаписатьКонецЭлемента();
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("Адрес");
	ЗаписьXML.ЗаписатьНачалоЭлемента("АдрРФ");
	
	Если ЗначениеЗаполнено(СведенияОПоставщике.ЮридическийАдрес.postal_code) Тогда
		ЗаписьXML.ЗаписатьАтрибут("Индекс", СокрЛП(СведенияОПоставщике.ЮридическийАдрес.postal_code));
	КонецЕсли;
	Если ДокВыгрузки.Организация.Страна.ЭтоСтрана=Ложь тогда
		Если Лев(СокрЛП(ДокВыгрузки.Организация.Страна.Код),1)= "0" тогда
			ЗаписьXML.ЗаписатьАтрибут("КодРегион",Сред(СокрЛП(ДокВыгрузки.Организация.Страна.Код),2));	
		Иначе	
			ЗаписьXML.ЗаписатьАтрибут("КодРегион",СокрЛП(ДокВыгрузки.Организация.Страна.Код));
		КонецЕсли;	
	Иначе 	
		ЗаписьXML.ЗаписатьАтрибут("КодРегион",СокрЛП(ДокВыгрузки.Организация.Страна.КодОКСМ));	
	КонецЕсли;
	ЗаписьXML.ЗаписатьАтрибут("НаимРегион",СокрЛП(СведенияОПоставщике.ЮридическийАдрес.region_with_type));
	
	Если ЗначениеЗаполнено(СведенияОПоставщике.ЮридическийАдрес.city_district_with_type) Тогда
		ЗаписьXML.ЗаписатьАтрибут("Район",СокрЛП(СведенияОПоставщике.ЮридическийАдрес.city_district_with_type));
	КонецЕсли;
	Если ЗначениеЗаполнено(СведенияОПоставщике.ЮридическийАдрес.city_with_type) Тогда
		ЗаписьXML.ЗаписатьАтрибут("Город", СокрЛП(СведенияОПоставщике.ЮридическийАдрес.city_with_type));
	КонецЕсли;
	Если ЗначениеЗаполнено(СведенияОПоставщике.ЮридическийАдрес.settlement_with_type) Тогда
		ЗаписьXML.ЗаписатьАтрибут("НаселПункт", СокрЛП(СведенияОПоставщике.ЮридическийАдрес.settlement_with_type));
	КонецЕсли;
	Если ЗначениеЗаполнено(СведенияОПоставщике.ЮридическийАдрес.street_with_type) Тогда
		ЗаписьXML.ЗаписатьАтрибут("Улица", СокрЛП(СведенияОПоставщике.ЮридическийАдрес.street_with_type));
	КонецЕсли;
	Если ЗначениеЗаполнено(СведенияОПоставщике.ЮридическийАдрес.house) Тогда
		ЗаписьXML.ЗаписатьАтрибут("Дом", СокрЛП(СведенияОПоставщике.ЮридическийАдрес.house));
	КонецЕсли;
	Если ЗначениеЗаполнено(СведенияОПоставщике.ЮридическийАдрес.flat) Тогда
		ЗаписьXML.ЗаписатьАтрибут("Кварт", СокрЛП(СведенияОПоставщике.ЮридическийАдрес.flat));
	КонецЕсли;
	
	ЗаписьXML.ЗаписатьКонецЭлемента();
	ЗаписьXML.ЗаписатьКонецЭлемента();
	Если ЗначениеЗаполнено(СведенияОПоставщике.НомерСчета) Тогда 
		ЗаписьXML.ЗаписатьНачалоЭлемента("БанкРекв");
		ЗаписьXML.ЗаписатьАтрибут("НомерСчета", Строка(СведенияОПоставщике.НомерСчета));
		ЗаписьXML.ЗаписатьНачалоЭлемента("СвБанк");
		ЗаписьXML.ЗаписатьАтрибут("НаимБанк", СведенияОПоставщике.Банк.Наименование);
		ЗаписьXML.ЗаписатьАтрибут("КорСчет", Строка(СведенияОПоставщике.КоррСчет));
		ЗаписьXML.ЗаписатьАтрибут("БИК", Строка(СведенияОПоставщике.БИК));
		ЗаписьXML.ЗаписатьКонецЭлемента();
		ЗаписьXML.ЗаписатьКонецЭлемента();
	КонецЕсли; 	
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	//Продавец	
	
	////ГрузОтпр
	// конец ГрузОтпр	
	
	////ГрузПолуч
	// конец Грузопол	 
	
	//СвПокуп
	ЗаписьXML.ЗаписатьНачалоЭлемента("СвПокуп");
	ЗаписьXML.ЗаписатьНачалоЭлемента("ИдСв");
	ЗаписьXML.ЗаписатьНачалоЭлемента("СвЮЛУч");
	
	КПП = ДокВыгрузки.Контрагент.КПП;	//значение по умолчанию  
	ЗаписьXML.ЗаписатьАтрибут("КПП", КПП); 
	
	ЗаписьXML.ЗаписатьАтрибут("НаимОрг", ДокВыгрузки.Контрагент.НаименованиеПолное);
	ЗаписьXML.ЗаписатьАтрибут("ИННЮЛ", ДокВыгрузки.Контрагент.ИНН);
	ЗаписьXML.ЗаписатьКонецЭлемента();
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("Адрес");
	ВыгружатьАдресаКакИностранные = ВыгружатьАдресаКакИностранные(ДокВыгрузки.Организация, ДокВыгрузки.Контрагент);
	
	доступно = СведенияОПокупателе.ЮридическийАдрес.house  = неопределено;
	доступно = доступно или СведенияОПокупателе.ЮридическийАдрес.flat = неопределено;
	доступно = доступно или ВыгружатьАдресаКакИностранные;
	
	Если доступно тогда
		ЗаписьXML.ЗаписатьНачалоЭлемента("АдрИнф");
		ЗаписьXML.ЗаписатьАтрибут("КодСтр","643"); 
		ЗаписьXML.ЗаписатьАтрибут("НаимСтран","Россия");
		ЗаписьXML.ЗаписатьАтрибут("АдрТекст", СокрЛП(СведенияОПокупателе.ЮридическийАдрес.ИсходныйАдрес));	
		ЗаписьXML.ЗаписатьКонецЭлемента();	
	Иначе	
		ЗаписьXML.ЗаписатьНачалоЭлемента("АдрРФ");
		Если ЗначениеЗаполнено(СведенияОПокупателе.ЮридическийАдрес.postal_code) Тогда
			ЗаписьXML.ЗаписатьАтрибут("Индекс", СокрЛП(СведенияОПокупателе.ЮридическийАдрес.postal_code));
		КонецЕсли;
		Если ДокВыгрузки.Контрагент.Страна.ЭтоСтрана=Ложь тогда
			Если Лев(СокрЛП(ДокВыгрузки.Контрагент.Страна.Код),1)= "0" тогда
				ЗаписьXML.ЗаписатьАтрибут("КодРегион",Сред(СокрЛП(ДокВыгрузки.Контрагент.Страна.Код),2));	
			Иначе	
				ЗаписьXML.ЗаписатьАтрибут("КодРегион",СокрЛП(ДокВыгрузки.Контрагент.Страна.Код));
			КонецЕсли;	
		Иначе 	
			ЗаписьXML.ЗаписатьАтрибут("КодРегион",СокрЛП(ДокВыгрузки.Контрагент.Страна.КодОКСМ));
		КонецЕсли; 
		ЗаписьXML.ЗаписатьАтрибут("НаимРегион",СокрЛП(СведенияОПокупателе.ЮридическийАдрес.region_with_type));
		Если ЗначениеЗаполнено(СведенияОПокупателе.ЮридическийАдрес.city_district_with_type) Тогда
			ЗаписьXML.ЗаписатьАтрибут("Район",СокрЛП(СведенияОПокупателе.ЮридическийАдрес.city_district_with_type));
		КонецЕсли;
		Если ЗначениеЗаполнено(СведенияОПокупателе.ЮридическийАдрес.city_with_type) Тогда
			ЗаписьXML.ЗаписатьАтрибут("Город", СокрЛП(СведенияОПокупателе.ЮридическийАдрес.city_with_type));
		КонецЕсли;
		Если ЗначениеЗаполнено(СведенияОПокупателе.ЮридическийАдрес.settlement_with_type) Тогда
			ЗаписьXML.ЗаписатьАтрибут("НаселПункт", СокрЛП(СведенияОПокупателе.ЮридическийАдрес.settlement_with_type));
		КонецЕсли;
		Если ЗначениеЗаполнено(СведенияОПокупателе.ЮридическийАдрес.street_with_type) Тогда
			ЗаписьXML.ЗаписатьАтрибут("Улица", СокрЛП(СведенияОПокупателе.ЮридическийАдрес.street_with_type));
		КонецЕсли;
		Если ЗначениеЗаполнено(СведенияОПокупателе.ЮридическийАдрес.house) Тогда
			ЗаписьXML.ЗаписатьАтрибут("Дом", СокрЛП(СведенияОПокупателе.ЮридическийАдрес.house));
		КонецЕсли;
		Если ЗначениеЗаполнено(СведенияОПокупателе.ФактическийАдрес.block) Тогда
			ЗаписьXML.ЗаписатьАтрибут("Корпус", СведенияОПокупателе.ФактическийАдрес.block);
		КонецЕсли;
		Если ЗначениеЗаполнено(СведенияОПокупателе.ЮридическийАдрес.flat) Тогда
			ЗаписьXML.ЗаписатьАтрибут("Кварт", СокрЛП(СведенияОПокупателе.ЮридическийАдрес.flat));
		КонецЕсли;		
		ЗаписьXML.ЗаписатьКонецЭлемента();
	КонецЕсли;	
	ЗаписьXML.ЗаписатьКонецЭлемента();        
	
	Если ЗначениеЗаполнено(СведенияОПокупателе.НомерСчета) Тогда 
		ЗаписьXML.ЗаписатьНачалоЭлемента("БанкРекв");
		ЗаписьXML.ЗаписатьАтрибут("НомерСчета", Строка(СведенияОПокупателе.НомерСчета));
		ЗаписьXML.ЗаписатьНачалоЭлемента("СвБанк");
		ЗаписьXML.ЗаписатьАтрибут("НаимБанк", СведенияОПокупателе.Банк.Наименование);
		ЗаписьXML.ЗаписатьАтрибут("КорСчет", Строка(СведенияОПокупателе.КоррСчет));
		ЗаписьXML.ЗаписатьАтрибут("БИК", Строка(СведенияОПокупателе.БИК));
		ЗаписьXML.ЗаписатьКонецЭлемента();
		ЗаписьXML.ЗаписатьКонецЭлемента();
	КонецЕсли; 	
	ЗаписьXML.ЗаписатьКонецЭлемента();	
	// конец СвПокуп	
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("ДенИзм");
	ЗаписьXML.ЗаписатьАтрибут("КодОКВ", Строка("643"));
	ЗаписьXML.ЗаписатьАтрибут("НаимОКВ", Строка("Российский рубль"));
	ЗаписьXML.ЗаписатьКонецЭлемента();
	ЗаписьXML.ЗаписатьКонецЭлемента(); 
	
	//Табличная часть
	ЗаписьXML.ЗаписатьНачалоЭлемента("ТаблСчФакт");
	НомерСтроки = 0;
	ИтогКолМест = 0;
	ИтогБрутто = 0;
	ИтогНетто = 0;
	ИтогСумБезНДС = 0;
	ИтогСумНДС = 0;
	ИтогСумУчНДС = 0;  
		
	ДанныеТоваров = ТабРаботТоваровЗН(ДокВыгрузки);
	ДанныеТоваров = ТабРаботПодрядовЗН(ДокВыгрузки,ДанныеТоваров);
		
	Для Каждого стрТовар из ДанныеТоваров цикл
		ХарактеристикаДляПоиска = "";
		НомерСтроки = НомерСтроки + 1; 
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("СведТов");
		ЗаписьXML.ЗаписатьАтрибут("НомСтр", Строка(НомерСтроки));
		СтавкаКоэффициент = ЗначенияСервера.ПреобразуемСтавкиНДС(СтрТовар.СтавкаНДС);
		
		Если ЗначениеЗаполнено(СтрТовар.Сумма) И ЗначениеЗаполнено(СтрТовар.СтавкаНДС) Тогда		
			СуммаБезНДС = СтрТовар.Сумма - СтрТовар.СуммаНДС;
			СуммаНДСдоОкругления = СтрТовар.Сумма - СуммаБезНДС;
			СуммаНДСизСуммы = Окр(СуммаНДСдоОкругления, 2);
		КонецЕсли;
		Если ЗначениеЗаполнено(СуммаБезНДС) И ЗначениеЗаполнено(СтрТовар.Количество) Тогда		
			Цена = СуммаБезНДС / СтрТовар.Количество;
		КонецЕсли;
		ЗаписьXML.ЗаписатьАтрибут("НаимТов", СокрЛП(СтрТовар.Номенклатура));
		
		Если ТипЗнч(СтрТовар.Номенклатура)=Тип("СправочникСсылка.Номенклатура") Тогда
			ЗаписьXML.ЗаписатьАтрибут("ОКЕИ_Тов", СокрЛП(СтрТовар.Номенклатура.ЕдиницаИзмерения.Код)); 
			ЗаписьXML.ЗаписатьАтрибут("НаимЕдИзм", СокрЛП(СтрТовар.Номенклатура.ЕдиницаИзмерения));
		КонецЕсли;
		
		ЗаписьXML.ЗаписатьАтрибут("КолТов", Строка(СтрЗаменить(Формат(СтрТовар.Количество,"ЧГ=0; ЧРД=."), Символы.НПП,"")));
		ЗаписьXML.ЗаписатьАтрибут("ЦенаТов",Строка(Формат(Цена,"ЧДЦ=2; ЧГ=0; ЧРД=.")));
		ЗаписьXML.ЗаписатьАтрибут("НалСт", СтавкаКоэффициент.Ставка);  
		ЗаписьXML.ЗаписатьАтрибут("СтТовБезНДС", Строка(Формат(СуммаБезНДС,"ЧДЦ=2; ЧГ=0; ЧРД=.")));
		ЗаписьXML.ЗаписатьАтрибут("СтТовУчНал", Строка(Формат(СтрТовар.Сумма,"ЧДЦ=2; ЧГ=0; ЧРД=.")));
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("ДопСведТов");
		Если ТипЗнч(СтрТовар.Номенклатура) = Тип("СправочникСсылка.Номенклатура") Тогда
			ЗаписьXML.ЗаписатьАтрибут("ПрТовРаб", "1");
			ЗаписьXML.ЗаписатьАтрибут("КодТов", СокрЛП(?(СокрЛП(СтрТовар.Номенклатура.Артикул)="",СтрТовар.Номенклатура.КодКаталога,СтрТовар.Номенклатура.Артикул)));
		Иначе	
			ЗаписьXML.ЗаписатьАтрибут("ПрТовРаб", "2");	
		КонецЕсли;
		ЗаписьXML.ЗаписатьКонецЭлемента();		
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("Акциз");
		ЗаписьXML.ЗаписатьНачалоЭлемента("БезАкциз");
		ЗаписьXML.ЗаписатьТекст("без акциза");
		ЗаписьXML.ЗаписатьКонецЭлемента();
		ЗаписьXML.ЗаписатьКонецЭлемента();
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("СумНал"); 
		
		Если СуммаНДСизСуммы > 0 Тогда
			ЗаписьXML.ЗаписатьНачалоЭлемента("СумНал");
			ЗаписьXML.ЗаписатьТекст(Строка(Формат(СуммаНДСизСуммы,"ЧДЦ=2; ЧГ=0; ЧРД=.")));
		ИначеЕсли СуммаНДСизСуммы = 0 Тогда		
			ЗаписьXML.ЗаписатьНачалоЭлемента("БезНДС");
			ЗаписьXML.ЗаписатьТекст("без НДС");
		КонецЕсли;
		ЗаписьXML.ЗаписатьКонецЭлемента();
		ЗаписьXML.ЗаписатьКонецЭлемента();
		
		ЗаписьXML.ЗаписатьКонецЭлемента();
		ИтогКолМест = ИтогКолМест + СтрТовар.Количество; 
		ИтогНетто = ИтогНетто + СтрТовар.Количество;
		ИтогСумБезНДС = ИтогСумБезНДС + СуммаБезНДС;
		ИтогСумНДС = ИтогСумНДС + СтрТовар.СуммаНДС;	
		ИтогСумУчНДС = ИтогСумУчНДС + СтрТовар.Сумма;		
	КонецЦикла;	
	// Конец табличной части
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("ВсегоОпл");
	ЗаписьXML.ЗаписатьАтрибут("СтТовБезНДСВсего", Строка(Формат(ИтогСумБезНДС,"ЧДЦ=2; ЧГ=0; ЧРД=.")));
	ЗаписьXML.ЗаписатьАтрибут("СтТовУчНалВсего", Строка(Формат(ИтогСумУчНДС,"ЧДЦ=2; ЧГ=0; ЧРД=.")));
	ЗаписьXML.ЗаписатьАтрибут("КолНеттоВс","0" );	
	ЗаписьXML.ЗаписатьНачалоЭлемента("СумНалВсего");
	Если ИтогСумНДС > 0 Тогда
		ЗаписьXML.ЗаписатьНачалоЭлемента("СумНал");
		ЗаписьXML.ЗаписатьТекст(Строка(Формат(ИтогСумНДС,"ЧДЦ=2; ЧГ=0; ЧРД=."))); 
	Иначе
		ЗаписьXML.ЗаписатьНачалоЭлемента("БезНДС");
		ЗаписьXML.ЗаписатьТекст("без НДС");
	КонецЕсли;
	
	ЗаписьXML.ЗаписатьКонецЭлемента();
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.ЗаписатьКонецЭлемента();
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("СвПродПер");
	ЗаписьXML.ЗаписатьНачалоЭлемента("СвПер");
	ЗаписьXML.ЗаписатьАтрибут("СодОпер", "Товары переданы"); 
	ЗаписьXML.ЗаписатьАтрибут("ДатаПер", Формат(ДатаУПД, "ДЛФ=Д"));
	ЗаписьXML.ЗаписатьНачалоЭлемента("ОснПер");
	Если ЗначениеЗаполнено(ДокВыгрузки.ДоговорВзаиморасчетов) Тогда 
		ЗаписьXML.ЗаписатьАтрибут("РеквНаимДок", "Договор");                                     
		ЗаписьXML.ЗаписатьАтрибут("РеквНомерДок", Строка(ДокВыгрузки.ДоговорВзаиморасчетов.Номер));
		ЗаписьXML.ЗаписатьАтрибут("РеквДатаДок", Строка(Формат(ДокВыгрузки.ДоговорВзаиморасчетов.НачПериода, "ДЛФ=Д")));
	Иначе 
		ЗаписьXML.ЗаписатьАтрибут("РеквНаимДок", "Заказ-наряд");                                     
		ЗаписьXML.ЗаписатьАтрибут("РеквНомерДок", Строка(ДокВыгрузки.Номер));
		ЗаписьXML.ЗаписатьАтрибут("РеквДатаДок", Строка(Формат(ДокВыгрузки.ДатаЗакрытия, "ДЛФ=Д")));
	КонецЕсли;	
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	Если ТипЗнч(ДокВыгрузки) = Тип("ДокументСсылка.ЗаказНаряд")
		И ДокВыгрузки.Контрагент.ШаблонСтрокиДанныеТранспортировки = 1 Тогда 
		ЗаписьXML.ЗаписатьНачалоЭлемента("ТранГруз");
		ДатаТранГруз = ?(ЗначениеЗаполнено(ДокВыгрузки.ДатаЗакрытия),ДокВыгрузки.ДатаЗакрытия,ДокВыгрузки.Дата); 
		СтрТранГруз = "Заказ-наряд № "+СокрЛП(ДокВыгрузки.Номер)+" от "+Формат(ДатаТранГруз,"ДЛФ=Д")+" г.";
		ЗаписьXML.ЗаписатьАтрибут("СвТранГруз", СтрТранГруз);
		ЗаписьXML.ЗаписатьКонецЭлемента();
	КонецЕсли;
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("СвПерВещи");
	ЗаписьXML.ЗаписатьКонецЭлемента();
	ЗаписьXML.ЗаписатьКонецЭлемента();
	ЗаписьXML.ЗаписатьНачалоЭлемента("ИнфПолФХЖ3");
	ЗаписьXML.ЗаписатьКонецЭлемента();
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	//Подписант
	ЗаписьXML.ЗаписатьНачалоЭлемента("Подписант");
	ЗаписьXML.ЗаписатьАтрибут("ОснПолн", "Должностные обязанности");
	ЗаписьXML.ЗаписатьАтрибут("ОблПолн", "1");
	ЗаписьXML.ЗаписатьАтрибут("Статус", "1");	
	ЗаписьXML.ЗаписатьНачалоЭлемента("ЮЛ");
	
	Если ЗначениеЗаполнено(ДокВыгрузки.Организация.ИНН) Тогда
		ЗаписьXML.ЗаписатьАтрибут("ИННЮЛ", ДокВыгрузки.Организация.ИНН);		
	Иначе 		
		ЗаписьXML.ЗаписатьАтрибут("ИННЮЛ", "0101010108");
	КонецЕсли;
	
	ПодписантОветственный = "";
	ЗаписьXML.ЗаписатьАтрибут("Должн", "Директор");
	ЗаписьXML.ЗаписатьНачалоЭлемента("ФИО");
	ЗаписьXML.ЗаписатьАтрибут("Фамилия", "Ф");
	ЗаписьXML.ЗаписатьАтрибут("Имя", "И");
	
	ЗаписьXML.ЗаписатьАтрибут("Отчество", "О");
	
	ЗаписьXML.ЗаписатьКонецЭлемента();
	ЗаписьXML.ЗаписатьКонецЭлемента();
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.ЗаписатьКонецЭлемента();
	ЗаписьXML.ЗаписатьКонецЭлемента(); 
	
	Возврат ЗаписьXML.Закрыть();
КонецФункции
	 
&НаСервере
Функция ЧЗВыбытие_СформироватьExcel(ДокВыгрузки) Экспорт
	
	ТабДок = Новый ТабличныйДокумент;	
	
	Для Каждого стрТовар из ДокВыгрузки.Товары цикл 
		
		Область = ТабДок.Область(стрТовар.НомерСтроки, 1);
		Область.Текст = Лев(стрТовар.КИЗ,31)    
		
	КонецЦикла;	
	ИмяВременногоФайла = ПолучитьИмяВременногоФайла("xlsx");
	ТабДок.Записать(ИмяВременногоФайла, ТипФайлаТабличногоДокумента.XLSX);
	
	ДвоичныеДанные = Новый ДвоичныеДанные(ИмяВременногоФайла);
	АдресХранилища = ПоместитьВоВременноеХранилище(ДвоичныеДанные, Новый УникальныйИдентификатор);
	
	УдалитьФайлы(ИмяВременногоФайла); // Очищаем за собой
	Возврат АдресХранилища;
КонецФункции

//=================================================================================================
//	Агрегатор	
//=================================================================================================

&НаСервере
Функция ИнтернетЗаявкаСвойства(Телефон) Экспорт    
	кмд = СтрШаблон("curl -X POST 'http://mainappl/sys_agr/hs/webhooks/anypost/v1' -H 'Content-type:application/json' --data '{""type"":""InternetQueryPropertiesByPhone"", ""phone"":""%1""}'", "9506080027");
	Отв = Авито.CURL_HttpResponse(кмд);
	ТелоОтвета = Отв.ПолучитьТелоКакСтроку();
	Если Отв.КодСостояния <> 200 Тогда
		ЗаписьЖурналаРегистрации("Свойства интернет-заявки", УровеньЖурналаРегистрации.Ошибка,,СтрШаблон("Ошибка. Код ответа = %1, Тело = %2", Отв.КодСостояния, ТелоОтвета));
		Возврат "[]";
	КонецЕсли;  
	
	Возврат  ТелоОтвета
КонецФункции

#Область opt_matrix_to_zakaz 

Функция СтруктураВJSON(Структура) Экспорт
	
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();
	ЗаписатьJSON(ЗаписьJSON, Структура);
	
	Возврат ЗаписьJSON.Закрыть();
	
КонецФункции 

Функция JSONВСтруктуру(JSON) Экспорт
	
	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(JSON);    
	Возврат ПрочитатьJSON(ЧтениеJSON);
	
КонецФункции  

Функция РезультатЗапросаВСтруктуру(Знач РезультатЗапроса) Экспорт
	
	Результат = Новый Структура;
	Для Каждого Колонка Из РезультатЗапроса.Колонки Цикл
		Результат.Вставить(Колонка.Имя);
	КонецЦикла;
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Результат;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	
	ЗаполнитьЗначенияСвойств(Результат, Выборка);
	
	Возврат Результат;
	
КонецФункции  

Функция ИнтернетЗаявку_Получи(Телефон, Начало = Неопределено, Окончание = Неопределено) Экспорт 
	//Возвращает только имя сайта	
	Если НЕ ЗначениеЗаполнено(Справочники.ЗначенияСвойствОбъектов.Втор_Резерв6.Комментарий) Тогда
		Возврат "";
	КонецЕсли;  
	
	Доступно = ТипЗнч(Телефон) = Тип("Строка") И СтрДлина(Телефон) = 10; 
	Если Не Доступно Тогда
		Возврат "";
	КонецЕсли;
	
	sql = 
	"ВЫБРАТЬ ПЕРВЫЕ 1 Здч.Инициатор КАК Сайт, ЕСТЬNULL(Инт.Комментарий, """") КАК Комментарий
	|ИЗ	РегистрСведений.ЗадачиИнтернетЗаявки КАК Здч ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ИнтернетЗаявки КАК Инт ПО (Инт.Сигнатура = Здч.Сигнатура)
	|ГДЕ Здч.Телефон = &Телефон И Здч.ДатаЗакрытия МЕЖДУ &Начало И &Окончание";
	
	query = СтрШаблон(" {""text"":%1} ", ЗаписатьЗначениеJson(sql)); 	                                                    	
	
	Если Не ЗначениеЗаполнено(Окончание) Тогда
		Окончание = ЗначенияСервера.ТекущаяДатаСервер();
		Начало	  = Окончание - 300;     	
	КонецЕсли; 
	
	Если Не ЗначениеЗаполнено(Начало) Тогда
		Начало	  = Окончание - 300;   
	КонецЕсли; 
	
	params	= СтрШаблон(" { ""text"" : %1, ""params"" :	{""Телефон"": %2, ""Начало"":""%3"", ""Окончание"":""%4""}}", ЗаписатьЗначениеJson(sql), ЗаписатьЗначениеJson(Телефон) ,ЗаписатьДатуJSON(Начало, ФорматДатыJson.ISO), ЗаписатьДатуJSON(Окончание, ФорматДатыJson.ISO));    

	кмд 	= СтрШаблон(" curl --request POST ""http://mainappl.main.luidorauto.ru/sys_agr/hs/webhooks/jsonrpc/v1"" -H ""Accept"":""application/json"" --data '{""jsonrpc"": ""2.0"", ""method"":""%1"", ""params"":[%2], ""id"":1} ' ", "sql_2_json", params);

    Попытка
		Ответ 	= Авито.CURL_Str(кмд); 
	Исключение
		ЗаписьЖурналаРегистрации("ИнтернетЗаявки.Получи", УровеньЖурналаРегистрации.Ошибка,, СтрШаблон("кмд = %1", кмд), ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		Возврат ""; 
	КонецПопытки;  
	
	Попытка
		z = ПрочитатьЗначениеJson(Ответ);
	Исключение
		Возврат "";
	КонецПопытки; 
	
	Доступно = z.Свойство("result") И ЗначениеЗаполнено(z.result);
	Если Не Доступно Тогда
		Возврат "";
	КонецЕсли;
	
	Рез = z.result[0];
	Доступно = Рез.Свойство("Сайт") И ЗначениеЗаполнено(Рез.Сайт);
	Если Не Доступно Тогда
		Возврат "";
	КонецЕсли; 
	
	Возврат z.result[0]["Сайт"]; 
	
КонецФункции  

Функция ИнтернетЗаявкуСоСвойствами_Получи(Телефон, Начало = Неопределено, Окончание = Неопределено) Экспорт 
	//Ищет интернет-заявку и  ее свойства, указанные в комментарии из Агрегатора, 
	
	Рез = Новый Структура("Сайт, Свойства");
	Рез.Свойства = Новый ТаблицаЗначений();
	Рез.Свойства.Колонки.Добавить("Имя", 		Новый ОписаниеТипов("Строка")); 
    Рез.Свойства.Колонки.Добавить("Значение",	Новый ОписаниеТипов("Строка"));
	
	Если НЕ ЗначениеЗаполнено(Справочники.ЗначенияСвойствОбъектов.Втор_Резерв6.Комментарий) Тогда
		Возврат "";
	КонецЕсли;  
	
	Доступно = ТипЗнч(Телефон) = Тип("Строка") И СтрДлина(Телефон) = 10; 
	Если Не Доступно Тогда
		Возврат Рез;
	КонецЕсли;
	
	sql = 
	"ВЫБРАТЬ ПЕРВЫЕ 1 Здч.Инициатор КАК Сайт, ЕСТЬNULL(Инт.Комментарий, """") КАК Комментарий
	|ИЗ	РегистрСведений.ЗадачиИнтернетЗаявки КАК Здч ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ИнтернетЗаявки КАК Инт ПО (Инт.Сигнатура = Здч.Сигнатура)
	|ГДЕ Здч.Телефон = &Телефон И Здч.ДатаЗакрытия МЕЖДУ &Начало И &Окончание";
	
	query = СтрШаблон(" {""text"":%1} ", ЗаписатьЗначениеJson(sql)); 	                                                    	
	
	Если Не ЗначениеЗаполнено(Окончание) Тогда
		Окончание = ЗначенияСервера.ТекущаяДатаСервер();
		Начало	  = Окончание - 300;     	
	КонецЕсли; 
	
	Если Не ЗначениеЗаполнено(Начало) Тогда
		Начало	  = Окончание - 300;   
	КонецЕсли; 
	
	params	= СтрШаблон(" { ""text"" : %1, ""params"" :	{""Телефон"": %2, ""Начало"":""%3"", ""Окончание"":""%4""}}", ЗаписатьЗначениеJson(sql), ЗаписатьЗначениеJson(Телефон) ,ЗаписатьДатуJSON(Начало, ФорматДатыJson.ISO), ЗаписатьДатуJSON(Окончание, ФорматДатыJson.ISO));    

	кмд 	= СтрШаблон(" curl --request POST ""http://mainappl.main.luidorauto.ru/sys_agr/hs/webhooks/jsonrpc/v1"" -H ""Accept"":""application/json"" --data '{""jsonrpc"": ""2.0"", ""method"":""%1"", ""params"":[%2], ""id"":1} ' ", "sql_2_json", params);

    Попытка
		Ответ 	= Авито.CURL_Str(кмд); 
	Исключение
		ЗаписьЖурналаРегистрации("ИнтернетЗаявки.Получи", УровеньЖурналаРегистрации.Ошибка,, СтрШаблон("кмд = %1", кмд), ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		Возврат Рез; 
	КонецПопытки;  
	
	Попытка
		z = ПрочитатьЗначениеJson(Ответ);
	Исключение
		Возврат Рез;
	КонецПопытки; 
	
	Доступно = z.Свойство("result") И ЗначениеЗаполнено(z.result);
	Если Не Доступно Тогда
		Возврат Рез;
	КонецЕсли;
	
	Рез = z.result[0];
	Доступно = Рез.Свойство("Сайт") И ЗначениеЗаполнено(Рез.Сайт);
	Если Не Доступно Тогда 
		Возврат Рез;
	КонецЕсли; 
	
	//Сайт
	Рез.Сайт = z.result[0]["Сайт"];
	
	Если Не ЗначениеЗаполнено(z.result[0]["Комментарий"]) Тогда
		Возврат Рез;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(z.result[0]["Комментарий"]) Тогда
		Попытка      
			Св = ПрочитатьЗначениеJson(z.result[0]["Комментарий"]);
		Исключение 
			Св = "";
		КонецПопытки;  
		Если ЗначениеЗаполнено(Св) Тогда
			Для Каждого i Из z.result[0]["Комментарий"] Цикл
				Зап = Рез.Свойства.Добавить();
				//Зап.Имя 
			КонецЦикла;;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Рез;
КонецФункции

#КонецОбласти   



